[
    {
        "text": "Review this statement \"[Resource groups] provide organizations with the ability to manage the compliance of Azure resources across multiple subscriptions.\". If this statement is correct, select `No change is needed`. If the statement is incorrect, select the answer choice that makes the statement correct.",
        "options": ["No change is needed", "Management groups", "Azure policies", "Azure App Service plans"],
        "correct": 1,
        "explanation": "The correct answer is \"Management groups\". Explanation: 1/ Resource groups: These are used to organize and manage Azure resources within a single subscription, but they cannot span multiple subscriptions. 2/ Management groups: These provide the ability to manage and enforce policies, compliance, and access across multiple subscriptions in Azure. Therefore, they are the correct choice for managing compliance across subscriptions. 3/ Azure policies: These are used to define and enforce compliance rules for resources, but they work at a subscription or resource group level, not across subscriptions directly. 4/ Azure App Service plans: These are used for hosting web apps and are unrelated to compliance management."
    },
    {
        "text": "When an Azure subscriptions expires, the associated Azure Active Directory (Azure AD) tenant is deleted automatically.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, an Azure subscription's expiration does not automatically lead to the deletion of the associated Azure Active Directory (Azure AD) tenant. Explanation: Azure Subscriptions: If an Azure subscription expires, the resources within the subscription may become inaccessible, but the Azure AD tenant remains active. Azure AD Tenant: The tenant is independent of the subscription and continues to exist even without an active subscription. It remains responsible for managing identities and authentication."
    },
    {
        "text": "You can change the Azure Active Directory (Azure AD) tenant to which an Azure subscription is associated.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, you can change the Azure Active Directory (Azure AD) tenant to which an Azure subscription is associated. This process involves transferring the subscription to a different Azure AD tenant. Here's how it works step be step: 1/ Prepare the Subscription, 2/ Transfer Ownership, 3/ Post-Transfer Actions."
    },
    {
        "text": "An Azure subscription can be associated to multiple Azure Active Directory (Azure AD) tenants?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, an Azure subscription cannot be associated with multiple Azure Active Directory (Azure AD) tenants at the same time. An Azure subscription has a one-to-one relationship with an Azure AD tenant, meaning it is always tied to a single Azure AD tenant for identity and access management."
    },
    {
        "text": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to a scale set. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "The correct answer is \"No\". Explanation: Deploying virtual machines to a scale set alone does not ensure availability if a single data center fails. While scale sets provide automatic scaling and load balancing, to protect against data center failure you need to deploy the virtual machines across Availability Zones or use Availability Sets. These features are specifically designed to provide redundancy and resilience against such failures."
    },
    {
        "text": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more resource groups. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "The correct answer is \"No\". Explanation: Deploying virtual machines to two or more resource groups does not ensure availability in the event of a single data center failure. Resource groups are logical containers and do not provide physical redundancy. To achieve high availability, the virtual machines must be deployed across Availability Zones or Availability Sets within an Azure region. These features are designed to protect against data center failures."
    },
    {
        "text": "You plan to extend your company's network to Azure. The network contains a VPN appliance that uses an IP address of 131.107.200.1. You need to create an Azure resource that defines the VPN appliance in Azure. Which Azure resource should you create? To answer, select the appropriate resource in the answer area.",
        "options": ["NAT gateways", "Application gateways", "Local network gateways", "Virtual network gateways", "On-premises data gateways", "Azure data box gateway", "Azure Stack Edge / Data Box gateway", "Web Application Firewall policies"],
        "correct": 2,
        "explanation": "The correct answer is \"Local network gateways\". Explanation: A local network gateway in Azure represents the on-premises network or VPN appliance, enabling Azure to recognize and establish connections to it. It specifies the IP address of the VPN appliance (in this case, 131.107.200.1) and allows configurations for connecting an Azure Virtual Network to your company's network."
    },
    {
        "text": "You need to identify the type of failure for which an Azure Availability Zone can be used to protect access to Azure services. What should you identify?",
        "options": ["a physical server failure", "an Azure region failure", "a storage failure", "an Azure data center failure"],
        "correct": 3,
        "explanation": "The correct answer is \"an Azure data center failure\". Explanation: Azure Availability Zones are designed to protect access to Azure services by providing redundancy across physically separate data centers within the same region. This ensures that services remain operational even if a specific data center within the region experiences a failure."
    },
    {
        "text": "Which cloud computing benefit provides continuous user access to a cloud-based application with minimal downtime?",
        "options": ["agility", "scalability", "elasticity", "high availability"],
        "correct": 3,
        "explanation": "The correct answer is \"high availability\". Explanation: High availability ensures that cloud-based applications remain operational and accessible with minimal downtime. This is achieved through redundant systems, failover mechanisms, and resilient infrastructure, providing a seamless experience for users."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Ensure that users always have the best experience by deploying apps to all the regions where there are users.\"",
        "options": ["Disaster recovery", "Geo-distribution", "High availability", "Scalability"],
        "correct": 1,
        "explanation": "The correct answer is \"Geo-distribution\". Explanation: Geo-distribution ensures that applications and resources are deployed in multiple regions to be closer to users. This approach minimizes latency, improves performance, and delivers the best user experience by utilizing Azure's global data center network."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Provide a continous user experience with no apparent downtime.\"",
        "options": ["Disaster recovery", "Geo-distribution", "High availability", "Scalability"],
        "correct": 2,
        "explanation": "The correct answer is \"High availability\". Explanation: High availability ensures that systems or services are continuously operational without noticeable downtime, even in the event of hardware or software failures. This capability is achieved through redundancy, failover mechanisms, and resilient infrastructure."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Increase the compute capacity of apps in the cloud.\"",
        "options": ["Disaster recovery", "Geo-distribution", "High availability", "Scalability"],
        "correct": 3,
        "explanation": "The correct answer is \"geo-redundancy\". Explanation: Geo-redundancy in Azure ensures that resources and data are replicated across multiple geographic locations. This capability helps deploy resources closer to users, enhancing performance and reducing latency while also providing resiliency against regional outages."
    },
    {
        "text": "What Azure capability ensures that resources are deployed closer to users? ",
        "options": ["resource cost analysis", "packet inspection", "geo-redundancy", "isolation and segmentation"],
        "correct": 2,
        "explanation": "The correct answer is \"geo-redundancy\". Explanation: Geo-redundancy in Azure ensures that resources and data are replicated across multiple geographic locations. This capability helps deploy resources closer to users, enhancing performance and reducing latency while also providing resiliency against regional outages."
    },
    {
        "text": "What is a feature of an Azure virtual network?",
        "options": ["resource cost analysis", "packet inspection", "geo-redundancy", "isolation and segmentation"],
        "correct": 3,
        "explanation": "The correct answer is \"isolation and segmentation\". Explanation: Azure Virtual Network (VNet) enables isolation and segmentation, which allows you to create secure and private communication environments for your resources. It provides control over IP addresses, subnets, and network traffic, ensuring that your resources are isolated from other users and networks."
    },
    {
        "text": "What are two benefits of cloud computing? ",
        "options": ["Enables the rapid provisioning of resources, Has the same configuration options as on-premises", "Enables the rapid provisioning of resources, Has increased administrative complexity", "Has the same configuration options as on-premises, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)", "Enables the rapid provisioning of resources, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)"],
        "correct": 3,
        "explanation": "The correct option is \"Enables the rapid provisioning of resources, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)\".1/ Rapid provisioning of resources: Cloud computing allows for quick scaling of resources to meet changing demands efficiently. 2/ Shifts CAPEX to OPEX: With cloud computing, organizations avoid large upfront capital expenses for infrastructure and instead pay for resources as they use them, making it an operational expense."
    },
    {
        "text": "Which term represents the ability to increase the computing capacity of a virtual machine by adding memory or CPUs?",
        "options": ["agility", "vertical scaling", "horizontal scaling", "elasticity"],
        "correct": 1,
        "explanation": "The correct term is vertical scaling. This represents the ability to increase the computing capacity of a virtual machine by adding resources such as memory or CPUs. Vertical scaling enhances the performance of the existing instance without adding new instances. Reference: https://learn.microsoft.com/en-us/azure/azure-monitor/autoscale/autoscale-overview."
    },
    {
        "text": "Select appropriate answer: What Azure Service supports synchronization between on-premises storage and Azure Storage?",
        "options": ["Azure Blob Storage", "Azure Files", "Azure Queue Storage ", "Azure File Sync"],
        "correct": 3,
        "explanation": "The correct service is Azure File Sync, not Azure Files. Azure File Sync is specifically designed to enable synchronization between on-premises file servers and Azure Files, allowing you to centralize file storage in Azure while keeping local access to frequently used data. Azure Files, on the other hand, provides fully managed cloud file shares, but it doesn't include synchronization capabilities by itself. - Azure Blob Storage: Designed for storing large amounts of unstructured data, such as text or binary files. It's ideal for scenarios like serving images, streaming media, or creating data lakes for analytics. - Azure Files: Provides fully managed file shares in the cloud, accessible via SMB or NFS protocols. It's perfect for replacing on-premises file servers or enabling shared application settings. - Azure Queue Storage: A service for storing large numbers of messages, enabling asynchronous communication between application components. Commonly used in distributed systems. - Azure Table Storage: A NoSQL datastore for structured data, offering fast and cost-effective storage for applications that don't require complex joins or stored procedures"
    },
    {
        "text": "Which cloud computing model includes on-premises and cloud-based resources?",
        "options": ["Hybrid Cloud", "Private Cloud", "Public Cloud"],
        "correct": 0,
        "explanation": "The correct answer is Hybrid Cloud. This cloud computing model combines on-premises infrastructure with cloud-based resources, allowing organizations to use both environments seamlessly to meet their needs."
    },
    {
        "text": "A Microsoft SQL Server database that is hosted in the cloud and has software updates managed by Azure is an example of ...",
        "options": ["disaster recovery as a service (DRaaS)", "Infrastructure as a Service (Iaas)", "Platform as a Service (PaaS)", "Software as a Service (SaaS)"],
        "correct": 2,
        "explanation": "The correct answer is Platform as a Service (PaaS). This is because, in this scenario, Azure manages the software updates and underlying infrastructure for the Microsoft SQL Server database while allowing users to focus on managing and using the database itself. PaaS is designed to reduce administrative effort by handling these backend tasks."
    },
    {
        "text": "Select the answer that correctly completes the sentence. An Azure web app that queries an on-premises Microsoft SQL server is an example of a [ ... ].",
        "options": ["Hybrid Cloud", "Private Cloud", "Public Cloud", "Multi-vendor Cloud"],
        "correct": 0,
        "explanation": "The correct answer is Hybrid Cloud. An Azure web app querying an on-premises Microsoft SQL server demonstrates a combination of public cloud services (Azure) and on-premises infrastructure, which is the essence of a hybrid cloud setup."
    },
    {
        "text": "Microsoft 365 is an example of which cloud service model?",
        "options": ["Infrastructure as a Service (Iaas)", "Platform as a Service (SaaS)", "Software as a Service (SaaS)"],
        "correct": 2,
        "explanation": "The correct answer is Software as a Service (SaaS). Microsoft 365 is a SaaS model, as it provides ready-to-use software applications like Word, Excel, and Outlook that are accessed over the internet without requiring users to manage the underlying infrastructure or platform."
    },
    {
        "text": "You have an accounting application named App1 that uses a legacy database. You plan to move App1 to the cloud. Which service model should you use?",
        "options": ["Infrastructure as a Service (Iaas)", "Platform as a Service (PaaS)", "Software as a Service (SaaS)"],
        "correct": 0,
        "explanation": "The best choice in this scenario is Infrastructure as a Service (IaaS). Since App1 uses a legacy database, migrating it to the cloud via IaaS would provide the necessary flexibility and control. With IaaS, you can replicate your on-premises setup and manage the operating system, database, and application as needed, making it ideal for legacy systems."
    },
    {
        "text": "You plan to use Azure to host application named App2. The application must meet the following requirements: App2 must run interactively with the operating system of the server.",
        "options": ["Infrastructure as a Service (Iaas)", "Platform as a Service (PaaS)", "Software as a Service (SaaS)"],
        "correct": 0,
        "explanation": "The correct answer is Infrastructure as a Service (IaaS). Here's why: IaaS provides virtualized computing resources such as servers, storage, and networking. It enables applications like App2 to interact directly with the operating system of the server, giving you complete control over the server environment. This is ideal for scenarios requiring close integration with the OS."
    },
    {
        "text": "You plan to use Azure to host application named App1. The application must meet the following requirements: 1/ You must be able to modify the code of App1. 2/ Administrative effort to manage the operating system of App1 must be minimized.",
        "options": ["Infrastructure as a Service (Iaas)", "Platform as a Service (PaaS)", "Software as a Service (SaaS)"],
        "correct": 1,
        "explanation": "The correct answer is Platform as a Service (PaaS). Here's why: PaaS allows you to modify and control the application code while the cloud provider manages the underlying operating system and infrastructure. This minimizes the administrative effort required to maintain the operating system. PaaS provides a framework that developers can build upon to develop or customize cloud-based applications. Similar to the way you create an Excel macro, PaaS lets developers create applications using built-in software components. Cloud features such as scalability, high-availability, and multi-tenant capability are included, reducing the amount of coding that developers must do."
    },
    {
        "text": "Select the appropriate answer that correctly completes the sentence : Azure Site recovery provides [ ... ] for virtual machines.",
        "options": ["high availability", "disaster recovery", "elasticity ", "fault tolerance"],
        "correct": 1,
        "explanation": "The correct answer is disaster recovery. Azure Site Recovery is designed to ensure business continuity by replicating virtual machines, enabling organizations to recover and maintain operations during outages or disasters."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Applications can be developed, tested and launched rapidly.",
        "options": ["Agility", "Geo-distribution", "Scalability"],
        "correct": 0,
        "explanation": "The cloud computing benefit that matches the description is Agility. This refers to the ability to quickly adapt and innovate, enabling efficient development and deployment processes."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Applications and data can be deployed to multiple regions.",
        "options": ["Agility", "Geo-distribution", "Scalability"],
        "correct": 1,
        "explanation": "The cloud computing benefit that matches the description is Geo-distribution. This benefit refers to the ability to distribute resources, applications, and data across multiple geographical locations for better performance, availability, and compliance."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Resources can be provisioned dynamically to meet changing demands.",
        "options": ["Agility", "Geo-distribution", "Scalability"],
        "correct": 2,
        "explanation": "The cloud computing benefit that matches the description is Scalability. This refers to the ability to quickly adjust resources up or down based on workload demands, ensuring efficiency and cost-effectiveness."
    },
    {
        "text": "Is this statment correct. The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\", the statement is generally correct. Scaling up cloud computing capacity is often more cost-effective than increasing the computing capacity of an on-premises datacenter. Here's why: 1/ Cloud Computing: Cloud providers use pay-as-you-go pricing models. You only pay for the resources you use, and scaling is immediate, without the need for upfront investments in hardware or infrastructure. - 2/ On-Premises Datacenter: Expanding capacity typically involves purchasing new hardware, upgrading infrastructure, and potentially investing in space and cooling systems, which can be costly and time-consuming."
    },
    {
        "text": "Is this statment correct. You must have internet connectivity to use cloud computing!",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\", you don't necessarely need internet connectivity, 2 reasons: 1/ Private Cloud and Internet Connectivity: Private clouds operate within an organization's local network, so they don't require internet access. Users can access resources directly through the internal network, ensuring data stays within the organization's infrastructure. 2/ Azure ExpressRoute: This service provides a private, dedicated connection between on-premises infrastructure and Microsoft Azure. It bypasses the public internet, offering enhanced reliability, security, and lower latency for hybrid cloud setups."
    },
    {
        "text": "Is this statment correct. You must have physical servers to use cloud computing!",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\", the statement \"You must have physical servers to use cloud computing\" is not entirely correct. Cloud computing involves accessing resources (like storage, applications, and processing power) hosted on remote servers via the internet or a private network. For public cloud services, users don't need their own physical servers—resources are provided by the cloud provider. However, private cloud or hybrid cloud setups may require physical servers for hosting infrastructure within the organization's premises."
    },
    {
        "text": "Your company has virtual machines (VMs) hosted in Microsoft Azure. The VMs are located in a single Azure virtual network named VNet1. The company has users that work remotely. The remote workers require access to the VMs on VNet1. You need to provide access for the remote workers. What should you do?",
        "options": ["Configure a Site-to-Site (S2S) VPN", "Configure a VNet-toVNet VPN", "Configure a Point-to-Site (P2S) VPN", "Configure DirectAccess on a Windows Server 2012 server VM", "Configure a Multi-Site VPN"],
        "correct": 2,
        "explanation": "A Point-to-Site (P2S) VPN gateway connection lets you create a secure connection to your virtual network from an individual client computer. ... P2S VPN is also a useful solution to use instead of S2S VPN when you have only a few clients that need to connect to a VNet."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] Provides a choice to use on-premises or cloud-based resources.",
        "options": ["Hybrid Cloud", "Private Cloud", "Public Cloud"],
        "correct": 0,
        "explanation": "The cloud model that best matches the advantage Provides a choice to use on-premises or cloud-based resources is \"Hybrid Cloud\". This model combines the flexibility of public cloud services with the control of on-premises infrastructure, allowing organizations to balance their workloads between the two as needed."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] Provides complete control over security.",
        "options": ["Hybrid Cloud", "Private Cloud", "Public Cloud"],
        "correct": 1,
        "explanation": "The cloud model that best matches the advantage Provides complete control over security is \"Private Cloud\". This model allows organizations to have exclusive access to infrastructure, enabling them to implement and manage their own security measures according to specific needs and standards."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] No required capital expenditure.",
        "options": ["Hybrid Cloud", "Private Cloud", "Public Cloud"],
        "correct": 2,
        "explanation": "Based on the advantage No required capital expenditure, the best match among the cloud models would be \"Public Cloud\". This model operates on a pay-as-you-go system, removing the need for upfront hardware investments."
    },
    {
        "text": "You are tasked with deploying Azure virtual machines for your company and need the appropriate cloud deployment solution—you recommend using Infrastructure as a Service (IaaS); does this solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, VM's are delivered through Infrastructure as a Service (IaaS)."
    },
    {
        "text": "Your developers have created 10 web applications to host on Azure, requiring custom domains, 10 GB of storage each, dedicated compute instances, load balancing, and cost minimization—what Azure web tier plan should you use?",
        "options": ["Standard", "Basic", "Free", "Shared"],
        "correct": 0,
        "explanation": "App Service Free and Shared Plans are not for production and offers only 1 GB of storage, they also do not have dedicated compute. Basic plan, even it offers 10 GB of storage do not offers load-balancing 'no traffic management' refer to https://azure.microsoft.com/en-us/pricing/details/app-service/windows/. Cheapest solution is then Standard plan. Note that each tier provides a specific subset of App Service features. These features include custom domains and TLS/SSL certificates, autoscaling, deployment slots, backups, Azure Traffic Manager integration, and more."
    },
    {
        "text": "You plan to migrate a company to Azure with each division having an administrator to manage its Azure resources and want the deployment to allow segmentation while minimizing administrative effort—you propose using several Azure Active Directory (Azure AD) directories; does this solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "You do not need 'several' AAD directories, best practice is only one, the word 'several' cause problem here! You plan to make use of several Azure Active Directory (Azure AD) directories.."
    },
    {
        "text": "Your developers created a publicly accessible portal web app for Miami branch users to retrieve customer and product information, and you plan to host it on Azure, requiring the miami.weyland.com URL, deployment to two instances, SSL support, 12 GB of storage, and minimized costs—which Azure web tier plan should you use?",
        "options": ["Standard", "Basic", "Free", "Shared"],
        "correct": 0,
        "explanation": "Standard offer 50 GB, Basic 10 GB only, as costs must be optimized this is the most cost efficient solution."
    },
    {
        "text": "Your company plans to migrate virtual machines from Hyper-V hosts in a data center to an Azure pay-as-you-go subscription, requiring the correct expenditure model—you recommend using the elastic expenditure model; does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "The term \"elastic expenditure model\" isn't a standard term or concept used in Azure or cloud computing. The two common expenditure models in Azure are \"pay-as-you-go\" and \"reserved instances\"."
    },
    {
        "text": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required to make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the scalable expenditure model. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Operating expenditures are ongoing costs of doing business. Consuming cloud services in a pay-as-you-go model could qualify as an operating expenditure. References : https://docs.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/business-outcomes/fiscal-outcomes."
    },
    {
        "text": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the operational expenditure model. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Operating expenditures are ongoing costs of doing business. Consuming cloud services in a pay-as-you-go model could qualify as an operating expenditure. References : https://docs.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/business-outcomes/fiscal-outcomes."
    },
    {
        "text": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Cosmos DB. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Machine Learning Studio (classic) is a drag-and-drop tool you can use to build, test, and deploy predictive analytics solutions. Azure Cosmos DB is a fully managed NoSQL database for modern app development."
    },
    {
        "text": "Your company's Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to sync all the Active Directory user accounts to Azure Active Directory (Azure AD). Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Answer is \"Yes\"; it is beneficial to sync your on premise AD with the AD Azure to minimize the impact on users."
    },
    {
        "text": "You have been informed by your superiors of the company's intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". The solution to encrypt credentials is Azure Key Vault. reference https://learn.microsoft.com/en-us/azure/key-vault/. Azure Multi-Factor Authentication (MFA) is a security feature that adds an extra layer of protection to user accounts by requiring multiple forms of verification during sign-in."
    },
    {
        "text": "You have been informed by your superiors of the company's intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Information Protection. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". The solution to encrypt credentials is Azure Key Vault. reference https://learn.microsoft.com/en-us/azure/key-vault/. Azure Information Protection (AIP) is a cloud-based solution designed to help organizations classify, label, and protect sensitive information, whether it's stored in the cloud or on-premises."
    },
    {
        "text": "Is this statment correct. A company can extend its internal network to the public cloud!",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, the statement is correct! A company can extend its internal network to the public cloud through various connectivity solutions. This is typically done using secure networking methods such as: 1/ VPN (Virtual Private Network): Provides a secure connection between on-premises resources and the cloud. - 2/ Azure ExpressRoute: Offers private, high-speed connectivity directly to the Azure cloud without using the public internet. - 3/ Hybrid Cloud Integration: Allows seamless extension of resources and workloads between the internal network and public cloud infrastructure. - These solutions enable businesses to leverage the scalability and flexibility of the public cloud while maintaining connectivity with their internal network."
    },
    {
        "text": "Is this statment correct. A company can extend an internal network by adding its own physical servers to the public cloud!",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, the statement is not correct. A company cannot extend its internal network by adding its own physical servers to the public cloud, as the public cloud is managed by cloud providers like Microsoft, AWS, or Google, and consists of infrastructure owned and operated by them."
    },
    {
        "text": "Is this statment correct. A private cloud must be disconnected from the Internet!",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, the statement is incorrect. A private cloud does not have to be disconnected from the Internet. While private clouds are designed for exclusive use by a single organization and often emphasize security and control, they can still be connected to the Internet if needed—for example, to facilitate remote access, hybrid cloud integrations, or external communications. The level of connectivity depends on the organization's requirements and security policies."
    },
    {
        "text": "Is this statment correct. Part of a hybrid cloud is the public cloud!",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, the statement is correct! A hybrid cloud is a computing environment that combines public cloud, private cloud, and sometimes on-premises infrastructure. In a hybrid cloud, the public cloud is an integral part, enabling organizations to benefit from scalability and cost-effectiveness while maintaining control over sensitive data in private cloud or on-premises systems."
    },
    {
        "text": "What is the first stage in the Microsoft Cloud Adoption Framework for Azure?",
        "options": ["Adopt the cloud.", "Make a plan.", "Ready your organization.", "Define your strategy."],
        "correct": 3,
        "explanation": "The correct answer is \"Define your strategy.\" The first stage in the Microsoft Cloud Adoption Framework for Azure involves defining your strategy, where you clarify business objectives, identify motivations for cloud adoption, and establish measurable outcomes. This stage sets the foundation for a successful cloud journey."
    },
    {
        "text": "Is this statment correct. Cloud computing leverages virtualization to provide services to multiple customers simultaneously!",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, the statement is correct! Cloud computing leverages virtualization to provide services to multiple customers simultaneously. Virtualization allows cloud providers to divide physical hardware into multiple virtual machines (VMs) or environments. These virtual resources can then be allocated dynamically to different customers, enabling the efficient and simultaneous use of the same underlying physical infrastructure. This approach ensures cost-effectiveness, scalability, and resource optimization."
    },
    {
        "text": "Is this statment correct. Customers can minimize capital expenditure (CapEx) by using a public cloud!",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, the statement is correct! By using a public cloud, customers can minimize capital expenditure (CapEx) because they avoid the upfront costs of purchasing hardware, setting up infrastructure, and maintaining physical servers. Instead, they shift to an operational expenditure (OpEx) model, paying for resources like storage, compute, or networking only as needed."
    },
    {
        "text": "Is this statment correct. Cloud computing provides elastic scalability!",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, the statement is correct! Cloud computing does provide elastic scalability. This means that resources such as compute power, storage, and network capacity can be scaled up or down dynamically based on demand. Elastic scalability ensures that organizations pay only for the resources they use, making it cost-effective and highly efficient."
    },
    {
        "text": "Is Microsoft Intune an example of Software as a Service (SaaS)?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, Microsoft Intune is an example of Software as a Service (SaaS). It is a cloud-based service designed for mobile device and application management. As a SaaS offering, Intune allows organizations to manage their devices, ensure security compliance, and control access to corporate resources without the need for on-premises infrastructure. Microsoft handles the backend operations, and users focus on configuring policies and managing devices."
    },
    {
        "text": "Is a DNS running on an Azure virtual machine an example of Platform as a Service (PaaS)?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, a DNS running on an Azure virtual machine is an example of Infrastructure as a Service (IaaS), not Platform as a Service (PaaS). When you deploy a DNS server on an Azure VM, Azure provides the virtual machine infrastructure, but you are responsible for configuring, managing, and maintaining the DNS software and operating system. This level of control and responsibility places it in the IaaS category. If you’re looking for a PaaS solution for DNS in Azure, Azure DNS is the service to consider. It provides a managed DNS solution where Azure takes care of the infrastructure, scalability, and maintenance, leaving you to manage your DNS zones and records."
    },
    {
        "text": "Is Azure Files an example of Infrastructure as a Service (IaaS)?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Azure Files is a Platform as a Service (PaaS) that provides fully managed, cloud-based file shares accessible via standard protocols like SMB and NFS. It is serverless, supports hybrid environments (cloud and on-premises), and offers features like Azure File Sync for local caching and synchronization. Azure manages the underlying infrastructure, allowing users to focus on storing and sharing files without worrying about maintenance or scalability."
    },
    {
        "text": "What does a customer provide in a software as a service (SaaS) model?",
        "options": ["application data", "data storage", "compute resources", "application software"],
        "correct": 0,
        "explanation": "The correct answer is \"application data\". In the Software as a Service (SaaS) model, the customer is responsible for providing and managing their own application data, while the SaaS provider handles everything else, including application software, data storage, compute resources, and maintenance. This allows customers to focus on using the software without worrying about infrastructure or backend systems."
    },
    {
        "text": "Is this statment correct? Azure Cosmos DB is an example of Software as a Service (SaaS)?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "The correct answer is \"No\". Azure Cosmos DB is not an example of Software as a Service (SaaS); it is an example of Platform as a Service (PaaS). As a PaaS offering, Azure Cosmos DB provides a globally distributed, multi-model database solution that is managed by Azure. You, as the user, handle the application and data, while Azure manages the underlying infrastructure and services for scalability, availability, and maintenance."
    },
    {
        "text": "Is this statment correct? Azure SQL database is an example of platform as a Service (PaaS)?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "The correct answer is \"Yes\". Azure SQL Database is indeed an example of Platform as a Service (PaaS). In this service model, Azure manages the infrastructure, operating system, and database server for you. This allows you to focus on using the database without worrying about hardware, maintenance, or updates."
    },
    {
        "text": "Is this statment correct? MS SQL 2029 installed on an Azure virtual machine is an example of platform as a Service (PaaS)?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\", that statement is incorrect. Microsoft SQL Server installed on an Azure virtual machine is an example of Infrastructure as a Service (IaaS), not Platform as a Service (PaaS)."
    },
    {
        "text": "Select the answer that correctly completes the sentence. You can assign a [ ... ] to every Azure resource.",
        "options": ["blueprint", "lock", "policy", "service endpoint"],
        "correct": 1,
        "explanation": "The correct answer is \"lock\". In Azure, you can assign a lock to every resource to prevent accidental deletion or modification. Locks can be set at different levels, such as resource groups or individual resources, and they enforce either a \"Read-Only\" or \"Delete\" restriction."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company's migration plan. What should you create?",
        "options": ["Azure virtual machines, Azure SQL databases, and Azure Storage accounts.", "an Azure App Service and Azure virtual machines that have Microsoft SQL Server installed.", "an Azure App Service and Azure SQL databases.", "Azure storage accounts and web server in Azure virtual machines."],
        "correct": 2,
        "explanation": "The correct answer is \"an Azure App Service and Azure SQL databases\". Here's why: Platform as a Service (PaaS) includes services like Azure App Service and Azure SQL Database. These are managed services that handle the underlying infrastructure, allowing you to focus solely on application development and data management. - The other options, such as using virtual machines (VMs), involve managing infrastructure, which makes them part of Infrastructure as a Service (IaaS) rather than PaaS."
    },
    {
        "text": "To which cloud models can you deploy physical servers?",
        "options": ["private cloud and hybrid cloud only", "private cloud only", "private cloud, hybrid cloud and public cloud", "hybrid cloud only"],
        "correct": 0,
        "explanation": "The correct answer is \"private cloud and hybrid cloud only\". Explanation: - Private Cloud: Physical servers can be deployed in a private cloud because the infrastructure is dedicated solely to one organization. It allows complete control over hardware, including physical servers. - Hybrid Cloud: A hybrid cloud integrates private and public cloud models. Physical servers can be part of the private portion of the hybrid cloud, working alongside public cloud resources to handle specific workloads or meet regulatory requirements. - Public Cloud: Physical servers are managed by the cloud provider in a public cloud, and customers don’t have the option to deploy their own physical servers. Instead, they use shared or dedicated virtualized resources."
    },
    {
        "text": "You plan to provision Infrastructure as a Service (IaaS) resources in Azure. Which resource is an example of IaaS?",
        "options": ["an Azure web app", "an Azure virtual machine", "an Azure logic app", "an Azure SQL database"],
        "correct": 1,
        "explanation": "The correct answer is \"an Azure virtual machine\". Infrastructure as a Service (IaaS) provides virtualized computing resources like servers, storage, and networking, enabling users to manage operating systems and applications. Azure Virtual Machines fall under this category because they offer raw computing resources that users can configure and control. - Why others are not IaaS: Azure web app: This is a Platform as a Service (PaaS) solution that abstracts the infrastructure, offering a managed environment for hosting web applications. Azure logic app: This is a PaaS/Serverless solution for automating workflows and integrations without requiring infrastructure management. Azure SQL database: This is also a PaaS solution, as it provides a fully managed relational database service without the need for infrastructure oversight."
    },
    {
        "text": "Your company has an on-premises network that contains multiple servers. The company plans to migrate servers to Azure virtual machines to reduce administrative responsibilities. You need to identify which administrative responsibilities will be eliminated after the planned migration. Which two responsibilities should you identify? Each correct answer presents a complete solution.",
        "options": ["Backing up application data, Replacing failed server hardware", "Managing physical server security, Replacing failed server hardware", "Updating server operating systems, Managing permissions to shared documents", "Managing permissions to shared documents, Backing up application data"],
        "correct": 1,
        "explanation": "The two responsibilities that will be eliminated after migrating servers to Azure virtual machines are: 1/ \"Replacing failed server hardware\": Azure, being a cloud platform, handles all hardware-related responsibilities, including maintaining and replacing failed server hardware. This is no longer a concern for the customer. 2/ \"Managing physical server security\": Since Azure provides physical infrastructure and its data centers are secured by Microsoft, managing physical server security will no longer be the company's responsibility."
    },
    {
        "text": "In a public cloud model, only guest users at your company can access the resources in the cloud?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No, that statement is incorrect. In a public cloud model, resources are accessible to authorized users regardless of whether they are internal employees, external partners, or guest users. Access is determined by identity and access management policies rather than user type. Public cloud providers, like Azure, AWS, or Google Cloud, offer tools to manage permissions and roles to ensure only authenticated users can access specific resources."
    },
    {
        "text": "can a company extend the computing resources of its internal network by using an hybrid cloud?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, a company can extend the computing resources of its internal network by using a hybrid cloud. A hybrid cloud integrates an organization's on-premises infrastructure with public cloud services. This setup allows companies to: 1/ Scale computing resources seamlessly by leveraging the public cloud during peak workloads or for specific tasks. 2/ Maintain control over sensitive data and applications by keeping them on-premises while still benefiting from the flexibility and scalability of the public cloud. 3/ Optimize costs by balancing workloads between on-premises infrastructure and the cloud."
    },
    {
        "text": "To implement a hybrid cloud model, a company must have an internal network?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, that's correct. To implement a hybrid cloud model, a company needs to have an internal network, often referred to as on-premises infrastructure. The hybrid cloud model integrates this internal network with a public cloud platform, enabling seamless interaction between the two environments."
    },
    {
        "text": "What feature need a cloud service that can be accessed quickly from the Internet",
        "options": ["Disaster recovery", "Fault tolerance", "Low latency", "Dynamic scalability"],
        "correct": 2,
        "explanation": "The correct answer is Low latency. Low latency refers to a cloud service's ability to process and respond to requests quickly, ensuring smooth and fast accessibility from the internet. This is crucial for real-time applications, such as online gaming, video streaming, and e-commerce platforms, where delay can negatively impact user experience."
    },
    {
        "text": "What feature need a cloud service that performs quickly when demand increases",
        "options": ["Disaster recovery", "Fault tolerance", "Low latency", "Dynamic scalability"],
        "correct": 3,
        "explanation": "The correct answer is Dynamic scalability. Dynamic scalability refers to a cloud service's ability to automatically and efficiently allocate more resources (such as compute power, storage, or bandwidth) when demand increases. This ensures optimal performance even during high-demand periods, making it a key feature of modern cloud platforms."
    },
    {
        "text": "What feature need a cloud service that can be recovered after a failure occurs",
        "options": ["Disaster recovery", "Fault tolerance", "Low latency", "Dynamic scalability"],
        "correct": 0,
        "explanation": "The correct answer is Disaster recovery. Disaster recovery refers to the ability of a cloud service to be restored or recovered after a failure occurs. This typically involves predefined strategies and tools to back up data, systems, and applications, ensuring they can be restored quickly to minimize downtime."
    },
    {
        "text": "What feature need a cloud service that remains available after a failure occurs",
        "options": ["Disaster recovery", "Fault tolerance", "Low latency", "Dynamic scalability"],
        "correct": 1,
        "explanation": "The correct answer is Fault tolerance. A fault-tolerant cloud service is designed to continue operating without interruption even if a failure occurs in its components. This ensures high availability and reliability, as the system can detect and manage failures automatically, maintaining service continuity."
    },
    {
        "text": "You have 1,000 virtual machines hosted on the Hyper-V hosts in a data center. You plan to migrate all the virtual machines to an Azure pay-as-you-go subscription. You need to identify which expenditure model to use for the planned Azure solution. Which expenditure model should you identify?",
        "options": ["operational", "capital", "elastic", "scalable"],
        "correct": 0,
        "explanation": "The correct answer is \"operational\". When migrating to an Azure pay-as-you-go subscription, the expenditure model shifts from capital expenditure (CapEx), which involves upfront costs for physical infrastructure, to operational expenditure (OpEx). This is because pay-as-you-go services are billed based on consumption, meaning you only pay for the resources you use, turning infrastructure costs into ongoing operating expenses."
    },
    {
        "text": "Select the answer that correctly completes the sentence. [ ... ] is a desktop and application virtualization service that enables the use of a cloud-hosted version of Windows from any location.",
        "options": ["An availability set", "Azure Spot Virtual Machines", "Azure Virtual Desktop", "Azure Virtual Machines Scales Sets"],
        "correct": 2,
        "explanation": "The correct answer is Azure Virtual Desktop. Azure Virtual Desktop is a cloud-based desktop and application virtualization service that allows users to access a fully hosted version of Windows from any location. It enables remote work, offering features such as multi-session Windows 10 or 11, seamless Microsoft 365 integration, and robust security."
    },
    {
        "text": "In which type of cloud model are all the hardware resources owned by a third-party and shared between multiple tenants?",
        "options": ["private", "hybrid", "public "],
        "correct": 2,
        "explanation": "In the public cloud model, all hardware resources are owned and maintained by a third-party cloud provider (e.g., Microsoft Azure, AWS, Google Cloud) and are shared among multiple tenants in a multi-tenant environment. This allows for cost efficiency and scalability since users share the infrastructure while maintaining their own separate data and applications through strict access controls."
    },
    {
        "text": "To complete the sentence, select the appropriate option in the answer area. Azure site Recover provides [ ... ] for virtual machines.",
        "options": ["fault tolerance", "disaster recovery", "elasticity", "high availability"],
        "correct": 1,
        "explanation": "Azure Site Recovery ensures business continuity by continuously replicating workloads—whether they're on physical or virtual machines—from a primary site to a secondary location. These workloads are not actively running in the secondary location during normal operation but are kept up-to-date through real-time synchronization. Reference: https://learn.microsoft.com/en-us/azure/site-recovery/site-recovery-overview."
    },
    {
        "text": "You plan to migrate several servers from an on-premises network to Azure. What is an advantage of using a public cloud service for the servers over an on-premises network?",
        "options": ["The public cloud is owned by the public, NOT a private corporation", "The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud", "All public cloud resources can be freely accessed by every member of the public", "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud"],
        "correct": 3,
        "explanation": "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud. In a public cloud model, resources such as storage, compute power, and networking are shared among multiple organizations (known as a multi-tenant environment). This sharing of resources allows for cost efficiency and scalability, as companies can use only the resources they need without investing in physical infrastructure. The cloud provider manages the underlying hardware and ensures resource availability for all users."
    },
    {
        "text": "When planning to migrate a public website to Azure, you must plan to",
        "options": ["deploy a VPN", "pay monthly usage costs", "pay to transfer all the website data to Azure", "reduce the number of connections to the website"],
        "correct": 1,
        "explanation": "The correct answer is \"pay monthly usage costs\". When migrating a public website to Azure, the organization will need to plan for ongoing costs based on Azure's consumption-based pricing model. These costs include charges for compute resources, storage, bandwidth, and other Azure services used by the website."
    },
    {
        "text": "Select appropriate option:  An organization that hosts its infrastructure [ ... ] no longer requires a data center.",
        "options": ["in a private cloud", "in a hybrid cloud", "in the public cloud", "on a Hyper-V hosts"],
        "correct": 2,
        "explanation": "The correct answer is \"in the public cloud\". When an organization hosts its infrastructure in the public cloud, it no longer needs a physical data center because the cloud provider manages all the underlying hardware, networking, and maintenance. Public cloud services allow organizations to focus on their applications and data without worrying about owning or maintaining infrastructure."
    },
    {
        "text": "Complete this sentence: When you are implementing a Software as a Service (SaaS) solution, you are responsible for",
        "options": ["configuring high-availability", "defining scalability rules", "installing the SaaS solution", "configuring the SaaS solution"],
        "correct": 3,
        "explanation": "The correct answer is configuring the SaaS solution. When implementing a SaaS solution, the provider takes care of the infrastructure, scalability, and high availability, leaving the customer responsible for configuring the solution to meet their specific needs. This typically involves setting up user access, permissions, workflows, and customizations to tailor the software for business processes."
    },
    {
        "text": "Is this statement correct? A platform as a service (PaaS) solution that hosts web apps in Azure provides the ability to scale the platform automatically.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "A PaaS solution that hosts web apps in Azure does provide the ability to scale the platform automatically. This is known as autoscaling. Behind the scenes, the web apps are hosted on virtual machines running IIS. Autoscaling means adding more load balanced virtual machines to host the web apps."
    },
    {
        "text": "Is this statement correct? A platform as a service (PaaS) solution that hosts web apps in Azure provides full control of the operatings systems that hosts applications.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "A PaaS solution does not provide access to the operating system. The Azure Web Apps service provides an environment for you to host your web applications. Behind the scenes, the web apps are hosted on virtual machines running IIS. However, you have no direct access to the virtual machine, the operating system or IIS."
    },
    {
        "text": "Select correct statement. Azure virtual machines is",
        "options": ["Infrastructure as a Service (IaaS)", "Platform as a Service (PaaS)", "Sotfware as a Service (SaaS)"],
        "correct": 0,
        "explanation": "Infrastructure as a Service is the most flexible category of cloud services. It aims to give you complete control over the hardware that runs your application (IT infrastructure servers and virtual machines (VMs), storage, networks, and operating systems). Instead of buying hardware, with IaaS, you rent it."
    },
    {
        "text": "Select correct statement. Azure SQL databases is",
        "options": ["Infrastructure as a Service (IaaS)", "Platform as a Service (PaaS)", "Sotfware as a Service (SaaS)"],
        "correct": 1,
        "explanation": "Azure SQL Database is a fully managed Platform as a Service (PaaS) Database Engine that handles most of the database management functions such as upgrading, patching, backups, and monitoring without user involvement. Azure SQL Database is always running on the latest stable version of SQL Server Database Engine and patched OS with 99.99% availability. PaaS capabilities that are built-in into Azure SQL database enable you to focus on the domain specific database administration and optimization activities that are critical for your business."
    },
    {
        "text": "Is this statment correct? In a public cloud model, only guest users at your company can access the resources in the cloud.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". This statement is not correct. In a public cloud model, resources are made accessible over the internet to authorized users. These users could include employees, contractors, or even third-party collaborators, depending on the company's access policies. It's not restricted to \"guest users\" specifically."
    },
    {
        "text": "Is this statment correct? A company can extend the capacity of its internal network by using public cloud?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\". This statement is correct! A company can indeed extend the capacity of its internal network by utilizing public cloud resources. This approach is known as \"cloud bursting,\" where businesses leverage the public cloud to handle temporary spikes in workload or add extra capacity as needed."
    },
    {
        "text": "Is this statment correct? To achieve a hybrid cloud model a company must always migrate from a private cloud.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". The statement is not entirely correct. A hybrid cloud model combines elements of both private and public clouds, allowing data and applications to be shared between them. However, achieving a hybrid cloud setup does not always require migrating from an existing private cloud."
    },
    {
        "text": "You have an on-premises network that contains 100 servers. You need to recommend a solution that provides additional resources to your users. The solution must minimize capital and operational expenditure costs. What should you include in the recommendation?",
        "options": ["a complete migration to the public cloud", "an additional data center", "a private cloud", "a hybrid cloud"],
        "correct": 3,
        "explanation": "By adopting a hybrid cloud model, you can leverage your existing on-premises infrastructure (already spent CAPEX) while integrating with the cloud to minimize future CAPEX and OPEX."
    },
    {
        "text": "You plan to migrate a web application to Azure. The web application is accessed by external users. You need to recommend a cloud deployment solution to minimize the amount of administrative effort used to manage the web application. What should you include in the recommendation?",
        "options": ["Software as a Service (SaaS)", "Platform as a Service (PaaS)", "Infrastructure as a Service (IaaS)", "Database as a Service (DaaS)"],
        "correct": 1,
        "explanation": "Platform as a Service (PaaS). A PaaS solution, such as Azure App Service, is designed to reduce administrative effort by managing the underlying infrastructure, operating system updates, scaling, and other platform-related tasks. This allows you to focus on developing and maintaining your web application without worrying about server management."
    },
    {
        "text": "Your company hosts an accounting application named App1 that is used by all the customers of the company. App1 has low usage during the first three weeks of each month and very high usage during the last week of each month. Which benefit of Azure Cloud Services supports cost management for this type of usage pattern?",
        "options": ["high availability", "high latency", "elasticity ", "load balancing"],
        "correct": 2,
        "explanation": "Elasticity refers to the ability of cloud resources to automatically scale up or down based on demand."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure Storage accounts. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". Azure Storage is generally categorized as an Infrastructure as a Service (IaaS) offering rather than a Platform as a Service (PaaS).However, it is often integrated with PaaS services (e.g., Azure App Service or Azure Functions) as part of a larger solution, and it abstracts some infrastructure management tasks, making it feel \"PaaS-like\" in its simplicity and scalability. But strictly speaking, it is considered more IaaS than PaaS. On top of this, as we don't have an inventory of all PaaS to be migrated we cannot guarantee all PaaS solution can be migrated."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure SQL databases. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\" as we don't have an inventory of all PaaS to be migrated. If your company migration plan only involves hosting web applications and databases, then creating Azure App Service and Azure SQL Database as Platform as a Service (PaaS) solutions does meet the goal. However, if your migration includes other workloads (e.g., workflow automation, event-driven computing, or IoT solutions), additional PaaS services like Azure Functions, Azure Logic Apps, or Azure IoT Hub might be required to fully align with the company's stated plan to only use PaaS solutions."
    },
    {
        "text": "What are two characteristics of the public cloud? Each correct answer presents a complete solution.",
        "options": ["dedicated hardware,limited storage", "unsecured connections, metered pricing", "dedicated hardware, self-service management", "metered pricing, self-service management"],
        "correct": 3,
        "explanation": "Hardware is shared, connections are secured and robust, storage is scalable, price is metered and it is self-service management."
    },
    {
        "text": "You have an on-premises network that contains several servers. You plan to migrate all the servers to Azure. You need to recommend a solution to ensure that some of the servers are available if a single Azure data center goes offline for an extended period. What should you include in the recommendation?",
        "options": ["fault tolerance", "elasticity", "scalability", "low latency"],
        "correct": 0,
        "explanation": "\"fault tolerance\". To ensure server availability in case a single Azure data center goes offline, you should include Azure Availability Zones in your recommendation as it provides \"fault tolerance\"."
    },
    {
        "text": "If you create two Azure virtual machines that use B2S size, each virtual machine will always generate the same monthly costs, correct ?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". While two Azure virtual machines (VMs) with the same B2S size may have identical base pricing for their compute resources, their monthly costs may still vary depending on additional factors such as: - Running Hours: If one VM runs continuously while the other is stopped for some time, their costs will differ. - Storage: The costs of storage, like managed disks or additional data disks attached to each VM, may vary. - Networking: Outbound data transfer charges and network traffic can differ for each VM. - Resource Location: If the VMs are deployed in different regions, pricing differences might apply. So, while the base cost for compute might be the same, additional charges can cause the total monthly costs to vary. Let me know if you'd like to dive deeper into cost calculations or optimization strategies!"
    },
    {
        "text": "Azure provides flexibility between capital expenditure (CAPEX) and operational expenditure (OPEX), correct ?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\", that's correct! Azure offers flexibility by allowing businesses to shift their spending from capital expenditures (CAPEX) to operational expenditures (OPEX). Here's how: - CAPEX: Traditionally, organizations would need to invest heavily upfront in hardware, servers, and data centers, which are considered capital expenses. - OPEX: With Azure, businesses can adopt a pay-as-you-go model, where they only pay for the resources they use, such as virtual machines, storage, or bandwidth. This is classified as operational expenditure. By moving to Azure, companies can avoid large upfront costs and instead manage their IT budgets with predictable, ongoing operational expenses, which adds financial flexibility."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides professional development services to continuously add features to custom applications, correct ?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\", that's not accurate. A Platform as a Service (PaaS) solution in Azure, like Azure App Service, provides a platform for developers to build, deploy, and manage web apps without worrying about the underlying infrastructure. However, it does not include professional development services for continuously adding features to custom applications. PaaS simplifies the development process by providing tools and resources, such as frameworks, APIs, and scaling capabilities, but the development of features and enhancements to the application itself remains the responsibility of the application developers or the organization using the service."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides the ability to scale the platform automatically, correct ?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\", that's correct! A Platform as a Service (PaaS) solution like Azure App Service includes built-in features for automatic scaling. You can configure it to scale out (adding more instances) or scale up (increasing the resources of the existing instance) based on factors such as traffic, CPU usage, memory usage, or a specific schedule. This flexibility is one of the key benefits of PaaS, as it allows applications to handle varying workloads efficiently without requiring manual intervention."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides full control of the operating systems that host application, correct ?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". A Platform as a Service (PaaS) solution in Azure, such as Azure App Service, does not provide full control of the operating systems hosting the application. PaaS is designed to abstract infrastructure management, allowing developers to focus on building and deploying applications without worrying about the underlying hardware or operating systems. With PaaS, you can control and configure application settings, scaling, and deployment, but the underlying operating system is managed by Azure. This means you cannot directly modify or access the operating system or its settings, which is one of the defining characteristics of PaaS. If full control over the operating system is needed, you might want to explore Infrastructure as a Service (IaaS) solutions like Azure Virtual Machines."
    },
    {
        "text": "Your company's Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to require Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". This solution does not meet the goal. While Azure Multi-Factor Authentication (MFA) enhances security by adding an additional verification step for users, it does not directly address the goal of reducing the effect on users after the migration of network resources to Azure. To minimize the impact on users during such a migration, a strategy like implementing Azure AD Connect with hybrid identity would be more suitable. This ensures a smooth transition by allowing users to maintain their existing credentials and continue accessing resources seamlessly"
    },
    {
        "text": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include a local network gateway in your strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". The local network gateway is a specific object that represents your on-premises location (the site) for routing purposes."
    },
    {
        "text": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include network security groups (NSGs) in your strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\". You can use an Azure network security group to filter network traffic to and from Azure resources in an Azure virtual network. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. For each rule, you can specify source and destination, port, and protocol."
    },
    {
        "text": "Your company has an Azure Active Directory (Azure AD) environment. Users occasionally connect to Azure AD via the Internet. You have been tasked with making sure that users who connect to Azure AD via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Azure AD Privileged Identity Management. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "\"No\". Correct service would be Azure AD Identity Protection. Azure AD Privileged Identity Management provides time-based and approval-based role activation to mitigate the risks of excessive, unnecessary, or misused access permissions on resources that you care about."
    },
    {
        "text": "Your company has an Azure Active Directory (Azure AD) environment. Users occasionally connect to Azure AD via the Internet. You have been tasked with making sure that users who connect to Azure AD via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Azure AD Identity Protection. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, this solution meets the goal. Azure AD Identity Protection allows you to configure risk-based policies to detect and respond to suspicious activities, such as sign-ins from unidentified IP addresses. By using this feature, you can create policies that automatically require users to change their passwords when such risky sign-in activities are detected. This aligns with the requirement to encourage users to change passwords in these specific scenarios. Do not confuse with Azure Information Protection."
    },
    {
        "text": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Machine Learning Studio. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Azure Machine Learning Studio is the correct tool for predictive analytics in AI solutions, the solution meets the goal."
    },
    {
        "text": "Your company's infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure API Management service be included in the strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "No. ARM (Azure Resource Manager) is a tool that automates the deployments on the AZ cloud. Azure API Management Service ( APIM ) is a way to create and manage customer APIs for existing backend services. "
    },
    {
        "text": "Your company's infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure Resource Manager templates be included in the strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Yes, ARM templates allows deployment of many identical instances."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and one availability zone in your strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include one virtual machine and two availability zones in your strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and two availability zones in your strategy. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "Correct, answer is \"yes\". To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Microsoft Managed Desktop. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". 1st, Ubuntu is Not supported by Microsoft Managed Desktop; 2nd ,key here is \"developers\", as we commission and decomission quite often it sounds we use a Dev lab and for Dev labs we use Azure DevTest Labs. Reference : https://azure.microsoft.com/en-us/products/devtest-lab/ & https://azure.microsoft.com/en-us/pricing/details/devtest-lab/."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Azure Reserved Virtual Machines (VM) Instances. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "Answer is \"No\". While Azure Reserved Virtual Machines (VM) Instances (reserved for 1 or 3 years, so long-term) can do the trick, the most efficient, from costs perspective is to use Azure DevTest Labs that is specifically designed for short-term service.  Reference : https://azure.microsoft.com/en-us/products/devtest-lab/  & https://azure.microsoft.com/en-us/pricing/details/devtest-lab/."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Azure DevTest Labs. Does the solution meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "\"Yes\", Azure DevTest Labs is the best answer. This service is designed for developers to deploy for testing purpose, this is for short-term provisioning and the most cost efficient solution."
    },
  {
      "text": "Your company intends to subscribe to an Azure support plan. The support plan must allow for new support requests to be opened. Which of the following are support plans that will allow this?",
      "options": ["Basic, Developer, Standard, Professional Direct", "Developer, Standard, Professional Direct", "Basic, Developer, Standard"],
      "correct": 1,
      "explanation": "References: https://azure.microsoft.com/en-us/support/plans/"
  },
  {
      "text": "Your company has datacenters in Los Angeles and New York, a Microsoft Azure subscription, and wants to configure the datacenters as geo-clustered sites for site resiliency with data stored on multiple Nodes in separate geographic locations and readable from both primary and secondary locations—what Azure storage redundancy option should you recommend?",
      "options": ["Geo-redundant storage", "Read-only geo-redundant storage", "Zone-redundant storage", "Locally redundant storage"],
      "correct": 1,
      "explanation": "Geo-redundant because of LA and NY and read-only because we mentioned 'readable', Not writable!"
  },
  {
      "text": "Your company's Azure subscription includes a Basic support plan, and they want an assessment of an Azure environment's design from Microsoft, which isn't supported by the existing plan—you recommend subscribing to the Professional Direct support plan to enable this functionality while minimizing expenses; does this solution meet the goal?",
      "options": ["Yes", "No"],
      "correct": 0,
      "explanation": "Assessment of an Azure environment's design is only provided with the Professional Direct subscription plan. References: https://azure.microsoft.com/en-us/support/plans/"
  },
  {
      "text": "You are tasked with deploying Azure virtual machines for your company and need the appropriate cloud deployment solution—you recommend using Platform as a Service (PaaS); does this solution meet the goal?",
      "options": ["Yes", "No"],
      "correct": 1,
      "explanation": "Azure's primary service for Infrastructure as a Service (IaaS) is Azure Virtual Machines (VMs). References: https://learn.microsoft.com/en-us/azure/virtual-machines/overview."
  },
  {
    "text": "xxxx",
    "options": ["A governement contractor from any country, A governement entity from any country", "A governement entity from any country, A European governement entity, A United State governement entity", "A United State governement entity, A United State governement contractor", "A governement contractor from any country, A European governement contractor, A United State governement contractor"],
    "correct": 2,
    "explanation": "Azure Government is ONLY for United State governement and its contractors."
  }
]



