[
    {
        "text": "Which Azure service is best suited for creating event-driven custom code to handle HTTP requests or queue messages?",
        "options": ["A: Azure Logic Apps", "B: Azure Functions", "C: Azure App Service", "D: Azure Virtual Machines"],
        "correct": 1,
        "explanation": "<b>B</b>: Azure Functions are designed for writing event-driven custom code, such as handling HTTP requests or messages from a queue. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-functions/functions-overview\">here</a>."
    },
    {
        "text": "You need to automate a workflow that integrates multiple APIs, sends emails, and uploads files to a SharePoint site. Which Azure service would you use?",
        "options": ["A: Azure Functions", "B: Azure Logic Apps", "C: Azure Kubernetes Service", "D: Azure Data Factory"],
        "correct": 1,
        "explanation": "<b>B</b>: Azure Logic Apps are ideal for automating workflows and integrating multiple APIs and services like SharePoint. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/logic-apps-overview\">here</a>."
    },
    {
        "text": "Which Azure service offers a designer-first approach to visually build workflows without writing extensive code?",
        "options": ["A: Azure Functions", "B: Azure Logic Apps", "C: Azure App Service", "D: Azure Blob Storage"],
        "correct": 1,
        "explanation": "<b>B</b>: Azure Logic Apps provide a designer-first approach, allowing users to visually create workflows for integration without heavy coding. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/logic-apps-overview\">here</a>."
    },
    {
        "text": "What is the primary purpose of Azure Logic Apps?",
        "options": [
            "A: To create and run automated workflows that integrate apps, data, services, and systems.",
            "B: To host virtual machines in the cloud.",
            "C: To manage Azure subscriptions and billing.",
            "D: To provide a platform for building mobile applications."
        ],
        "correct": 0,
        "explanation": "<b>A</b>: Azure Logic Apps is primarily used to create and run automated workflows for integration across apps, data, services, and systems. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/logic-apps-overview\">here</a>."
    },
    {
        "text": "Which of the following is a key component of an Azure Logic Apps workflow?",
        "options": ["A: Triggers", "B: Actions", "C: Connectors", "D: All of the above"],
        "correct": 3,
        "explanation": "<b>D</b>: All of the above. Triggers start workflows, actions define operations, and connectors link various systems. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/logic-apps-overview\">here</a>."
    },
    {
        "text": "What is the difference between a built-in connector and a managed connector in Azure Logic Apps?",
        "options": [
            "A: Built-in connectors are hosted in Azure, while managed connectors run locally.",
            "B: Built-in connectors run natively on the Azure Logic Apps runtime, while managed connectors are hosted and run in Azure.",
            "C: Managed connectors are faster than built-in connectors.",
            "D: There is no difference between built-in and managed connectors."
        ],
        "correct": 1,
        "explanation": "<b>B</b>: Built-in connectors run natively on the Azure Logic Apps runtime for better performance, while managed connectors are hosted and run in Azure. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/logic-apps-overview\">here</a>."
    },
    
    {
        "text": "Need to create VM from Android laptop. Solution: Use Bash in Azure Cloud Shell. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, Cloud Shell is accessible via browser on Android, making it possible to create a VM using Bash in Azure Cloud Shell. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-shell/overview\">here</a>."
    },
    {
        "text": "Need Azure solution to secure websites from attacks AND generate reports of attempts. What to include?",
        "options": ["Azure Firewall", "a network security group (NSG)", "Azure Information Protection", "DDoS protection"],
        "correct": 3,
        "explanation": "<b>DDoS protection</b> provides attack mitigation and reporting capabilities, ensuring website security and insight into attempted breaches. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/ddos-protection/\">here</a>."
    },
    {
        "text": "Migrate on-prem app that sends email based on a rule to Azure. Recommend serverless solution.",
        "options": ["a logic app", "a server image in Azure Marketplace", "an API app", "a web app"],
        "correct": 0,
        "explanation": "<b>A logic app</b> is a suitable serverless solution for event-driven workflows like rule-based email notifications. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/logic-apps/\">here</a>."
    },
    {
        "text": "App has low usage for 3 weeks, very high usage last week. Which Azure benefit supports cost management?",
        "options": ["high availability", "high latency", "elasticity", "load balancing"],
        "correct": 2,
        "explanation": "<b>Elasticity</b> allows resources to scale up or down based on demand, optimizing costs for variable usage patterns. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/cloud-adoption/benefits\">here</a>."
    },
    {
        "text": "Migrate 5000 AD users to Azure, decommission on-prem DC. Recommend solution to minimize user impact.",
        "options": ["Implement Azure Multi-Factor Authentication (MFA)", "Sync all the Active Directory user accounts to Azure Active Directory (Azure AD)", "Instruct all users to change their password", "Create a guest user account in Azure Active Directory (Azure AD) for each user"],
        "correct": 1,
        "explanation": "<b>Sync all the Active Directory user accounts to Azure Active Directory (Azure AD)</b> using Azure AD Connect. This minimizes disruption by syncing identities and optionally passwords. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-install-express\">here</a>."
    },
    
    {
        "text": "A new Azure service is made available as a Public Preview. Solution: Rely on this service for production workloads. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Public Previews are experimental and not covered by Service Level Agreements (SLAs). They should not be used for critical production workloads. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/security/fundamentals/encryption-atrest\">here</a>."
    },
    
    {
        "text": "Need VM service availability if single DC fails. Solution: Deploy VMs to two or more resource groups. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, resource groups are logical containers and don't guarantee placement across failure domains. Availability Zones are needed to ensure service availability if a single data center fails. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/availability-zones/\">here</a>."
    },
    {
        "text": "What is guaranteed in an Azure Service Level Agreement (SLA) for virtual machines?",
        "options": ["uptime", "feature availability", "bandwidth", "performance"],
        "correct": 0,
        "explanation": "<b>Uptime</b> is guaranteed in an Azure SLA for virtual machines, based on deployment configuration (e.g., Availability Zones, Sets, single VM with premium disk). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/sla\">here</a>."
    },
    {
        "text": "Have 100 on-prem servers. Need solution for additional resources minimizing CapEx and OpEx.",
        "options": ["a complete migration to the public cloud", "an additional data center", "a private cloud", "a hybrid cloud"],
        "correct": 3,
        "explanation": "<b>A hybrid cloud</b> solution allows leveraging existing CapEx (on-premises) while using public cloud (OpEx) for elasticity and additional resources. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/hybrid/hybrid-cloud-overview\">here</a>."
    },
    {
        "text": "Need support plan with phone/email engineer access. Solution: Recommend Professional Direct. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, the <b>Professional Direct</b> plan offers phone/email access to support engineers. Premier, ProDirect, and Standard plans provide this service. Learn more on Microsoft Learn <a href=\"https://azure.microsoft.com/en-us/support/plans/\">here</a>."
    },
    {
        "text": "Evaluate bold text: All Azure services that are in public preview are <b>provided without any documentation</b>.",
        "options": ["No change is needed.", "only configurable from Azure CLI", "excluded from the Service Level Agreements", "only configurable from the Azure portal"],
        "correct": 2,
        "explanation": "<b>Excluded from the Service Level Agreements</b>. Public previews have supplemental terms excluding SLAs and warranties. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-preview\">here</a>."
    },
    
    {
        "text": "You can merge two Azure subscriptions into a single subscription.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, merging two Azure subscriptions into a single subscription is not possible, but resources can be moved and ownership transferred. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/manage/move-subscription\">here</a>."
    },
    {
        "text": "A resource instance can exist in multiple Azure subscriptions simultaneously.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, a resource belongs to only one subscription at a time. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/role-based-access-control/resource-manager-subscription-alignment\">here</a>."
    },
    {
        "text": "An Azure free account has a spending limit.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, an Azure free account includes a spending limit to prevent unexpected charges. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/manage/azure-free-account\">here</a>."
    },
    {
        "text": "An Azure free account includes unlimited blob storage.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Azure free accounts have limits on blob storage (e.g., 5 GB). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/common/storage-account-overview\">here</a>."
    },
    {
        "text": "An Azure free account allows you to create an unlimited number of web apps.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Azure free accounts have limits on the number of web apps that can be created (e.g., 10 apps). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/\">here</a>."
    },
    
    {
        "text": "Need to encrypt an on-premises database. Solution: Enable Azure Transparent Data Encryption (TDE). Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Azure Transparent Data Encryption (TDE) is designed for databases hosted within Azure services, not on-premises databases. SQL Server on-premises provides native encryption features instead. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-sql/database/transparent-data-encryption-tde-overview\">here</a>."
    },
    
        {
            "text": "Need to encrypt an Azure SQL Database. Solution: Enable Transparent Data Encryption (TDE). Does this meet the goal?",
            "options": ["Yes", "No"],
            "correct": 0,
            "explanation": "<b>Yes</b>, Transparent Data Encryption (TDE) is the recommended method to encrypt Azure SQL Databases. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-sql/database/transparent-data-encryption-tde-overview\">here</a>."
        },
        {
            "text": "Need to encrypt a virtual machine disk in Azure. Solution: Use Azure Disk Encryption with BitLocker for Windows or dm-crypt for Linux. Does this meet the goal?",
            "options": ["Yes", "No"],
            "correct": 0,
            "explanation": "<b>Yes</b>, Azure Disk Encryption encrypts virtual machine disks using BitLocker (Windows) or dm-crypt (Linux). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/disk-encryption-overview\">here</a>."
        },
        {
            "text": "Need to manage encryption keys for Azure Storage accounts. Solution: Use Azure Key Vault to manage customer-managed keys. Does this meet the goal?",
            "options": ["Yes", "No"],
            "correct": 0,
            "explanation": "<b>Yes</b>, Azure Key Vault is used to securely manage customer-managed encryption keys for Azure Storage accounts. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/common/customer-managed-keys-overview\">here</a>."
        },
        {
            "text": "Need to encrypt a database hosted on an on-premises server using Azure services. Solution: Use Azure Information Protection. Does this meet the goal?",
            "options": ["Yes", "No"],
            "correct": 1,
            "explanation": "<b>No</b>, Azure Information Protection is for labeling and protecting documents, not encrypting on-premises databases. A better option would be on-premises encryption tools or managing database encryption keys using Azure Key Vault. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/information-protection/\">here</a>."
        },
        {
            "text": "Need to secure data in transit between Azure services. Solution: Use TLS (Transport Layer Security). Does this meet the goal?",
            "options": ["Yes", "No"],
            "correct": 0,
            "explanation": "<b>Yes</b>, TLS is the recommended protocol for encrypting data in transit between Azure services. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/security/fundamentals/data-encryption-best-practices\">here</a>."
        },

    
    {
        "text": "Evaluate underlined text: An Azure region <b>contains one or more data centers that are connected by using a low-latency network</b>.",
        "options": ["No change is needed", "Is found in each country where Microsoft has a subsidiary office", "Can be found in every country in Europe and the Americas only", "Contains one or more data centers that are connect by using a high-latency network"],
        "correct": 0,
        "explanation": "<b>No change is needed</b>. An Azure region contains one or more data centers connected by using a low-latency network. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/availability-zones/\">here</a>."
    },
    {
        "text": "Need to create VM using `az vm create` command. Solution: Install Azure CLI on Windows 10, sign in, run command. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, this is a standard and correct method for using Azure CLI to create a VM. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-shell/quickstart\">here</a>."
    },
    {
        "text": "What can Azure Information Protection encrypt?",
        "options": ["an Azure Storage account", "documents and email messages", "an Azure SQL database", "network traffic"],
        "correct": 1,
        "explanation": "<b>Documents and email messages</b> can be encrypted by Azure Information Protection, which applies classification and protection to files and emails. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/information-protection/\">here</a>."
    },
    {
        "text": "Company needs automated creation of 20 Azure resources for multiple business units (same types). Recommend solution.",
        "options": ["Azure Resource Manager templates", "virtual machine scale sets", "the Azure API Management service", "management groups"],
        "correct": 0,
        "explanation": "<b>Azure Resource Manager templates</b> enable Infrastructure as Code for repeatable deployments across multiple business units. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/templates/\">here</a>."
    },
    {
        "text": "You can use the same account to manage multiple Azure subscriptions.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, you can use the same account to manage multiple Azure subscriptions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/manage/subscription-management\">here</a>."
    },
    {
        "text": "Evaluate Bold text: <b>Azure policies provide</b> a common platform for deploying objects... and implementing consistency...",
        "options": ["No change is needed", "Resource groups provide", "Azure Resource Manager provides", "Management groups provide"],
        "correct": 2,
        "explanation": "<b>Azure Resource Manager provides</b> the deployment and management platform for implementing consistency. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/overview\">here</a>."
    },
    {
        "text": "Evaluate underlined text: An Azure service is available to all Azure customers when it is in <b>public preview</b>",
        "options": ["No change is needed.", "private preview", "development", "an Enterprise Agreement (EA) subscription"],
        "correct": 0,
        "explanation": "<b>No change is needed</b>. Public preview is generally available to all customers. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-preview\">here</a>."
    },
    {
        "text": "Need VM service availability if a single data center fails. Solution: Deploy VMs to two or more availability zones. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, Availability Zones are physically separate locations within a region designed for ensuring service availability if a single data center fails. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/availability-zones/\">here</a>."
    },
    {
        "text": "What is required to use Azure Cost Management?",
        "options": ["a Dev/Test subscription", "Software Assurance", "an Enterprise Agreement (EA)", "a pay-as-you-go subscription"],
        "correct": 2,
        "explanation": "<b>An Enterprise Agreement (EA)</b> is required for Azure Cost Management. It is also available for Microsoft Customer Agreement (MCA) and Microsoft Partner Agreement (MPA). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/cost-management-overview\">here</a>."
    },
    {
        "text": "Company compliance requires FinServer on a separate network segment. Recommend Azure solution.",
        "options": ["a resource group for FinServer and another resource group for all the other servers", "a virtual network for FinServer and another virtual network for all the other servers", "a VPN for FinServer and a virtual network gateway for each other server", "one resource group for all the servers and a resource lock for FinServer"],
        "correct": 1,
        "explanation": "<b>A virtual network for FinServer and another virtual network for all the other servers</b> provides network isolation and meets compliance requirements. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-overview\">here</a>."
    },    
    {
        "text": "Company has 10 departments needing separate payment options for Azure services. What should be created for each?",
        "options": ["a reservation", "a subscription", "a resource group", "a container instance"],
        "correct": 1,
        "explanation": "<b>A subscription</b> should be created for each department, as billing is managed at the subscription level. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/manage/subscription-management\">here</a>."
    },
    {
        "text": "Evaluate BOLD text: Company uses <b>Azure policies</b> to automatically add watermarks to Word docs with credit card info.",
        "options": ["No change is needed.", "DDoS protection", "Microsoft Purview Information Protection", "Azure Active Directory (Azure AD) Identity Protection"],
        "correct": 2,
        "explanation": "<b>Microsoft Purview Information Protection</b> applies labels and protection (like watermarks) based on content. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/office365/servicedescriptions/azure-information-protection\">here</a>."
      },
    {
        "text": "You need to create VM using `az vm create` command in Subscription1. Solution: Launch Bash in Cloud Shell from Azure portal and run command. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, this is a standard and correct method. Cloud Shell context is authenticated to the subscription. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-shell/overview\">here</a>."
    },
    {
        "text": "What is Azure Functions?",
        "options": ["Serverless code", "Big data analysis/ML", "Detect/diagnose web app anomalies", "Host web apps"],
        "correct": 0,
        "explanation": "<b>Serverless code</b> is the platform provided by Azure Functions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-functions/functions-overview\">here</a>."
    },
    {
        "text": "What is Azure Databricks?",
        "options": ["Serverless code", "Big data analysis/ML", "Detect/diagnose web app anomalies", "Host web apps"],
        "correct": 1,
        "explanation": "<b>Big data analysis/ML</b> is the service provided by Azure Databricks. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/databricks/\">here</a>."
    },
    {
        "text": "What is Azure Application Insights?",
        "options": ["Serverless code", "Big data analysis/ML", "Detect/diagnose web app anomalies", "Host web apps"],
        "correct": 2,
        "explanation": "<b>Detect/diagnose web app anomalies</b> is the functionality provided by Azure Application Insights. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/app/app-insights-overview\">here</a>."
    },
    {
        "text": "What is Azure App Service?",
        "options": ["Serverless code", "Big data analysis/ML", "Detect/diagnose web app anomalies", "Host web apps"],
        "correct": 3,
        "explanation": "<b>Host web apps</b> is the service provided by Azure App Service. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/overview\">here</a>."
    },
    {
        "text": "Store 20 TB data, accessed infrequently, visualized using Power BI. Recommend two storage solutions.",
        "options": ["Azure SQL Database, Azure Synapse Analytics", "Azure SQL Database, Azure Data Lake Storage", "Azure Database for PostgreSQL, Azure Cosmos DB", "Azure Synapse Analytics, Azure Data Lake Storage"],
        "correct": 3,
        "explanation": "Correct options: <b>Azure Synapse Analytics</b> (formerly SQL Data Warehouse) and <b>Azure Data Lake Storage</b> are suitable for large datasets and analytics integration. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/synapse-analytics/\">here</a> and <a href=\"https://learn.microsoft.com/en-us/azure/storage/data-lake-storage-introduction\">here</a>."
    },
    {
        "text": "Evaluate underlined text: If RG1 has a delete lock, <b>only a member of the global administrators group can delete RG1</b>.",
        "options": ["No change is needed", "the delete lock must be removed before an administrator can delete RG1.", "an Azure policy must be modified before an administrator can delete RG1.", "an Azure tag must be added before an administrator can delete RG1."],
        "correct": 1,
        "explanation": "<b>The delete lock must be removed before an administrator can delete RG1.</b> Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/lock-resources\">here</a>."
    },
    {
        "text": "Have 10 VNets, 100 VMs. Need to limit inbound traffic to all VNets centrally. What to create?",
        "options": ["one network security group (ASG)", "10 virtual network gateways", "10 Azure ExpressRoute circuits", "one Azure firewall"],
        "correct": 3,
        "explanation": "<b>One Azure firewall</b> provides <b>centralized</b> network traffic control for all VNets. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/firewall/overview\">here</a>."
    },
    {
        "text": "Admin needs to run PowerShell script. Solution: Run from Linux with Azure CLI tools installed. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, the script is PowerShell, which requires PowerShell Core on Linux, not just Azure CLI. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/powershell/scripting/install/installing-powershell-on-linux\">here</a>."
    },
    {
        "text": "Company migrating data to Azure, need to verify compliance with regional requirements. What to use?",
        "options": ["the Knowledge Center", "Azure Marketplace", "the Azure portal", "the Trust Center"],
        "correct": 3,
        "explanation": "You should use <b>the Trust Center</b> to verify compliance with regional requirements. Learn more on Microsoft Learn <a href=\"https://www.microsoft.com/en-us/trust-center\">here</a>."
    },
    {
        "text": "Need support plan with phone/email engineer access. Solution: Recommend Basic plan. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, the Basic plan offers no technical support access. Learn more on Microsoft Learn <a href=\"https://azure.microsoft.com/en-us/support/plans/\">here</a>."
    },
    {
        "text": "Migrate external web app to Azure, minimize admin effort. Recommend cloud solution.",
        "options": ["software as a service (SaaS)", "platform as a service (PaaS)", "infrastructure as a service (IaaS)", "database as a service (DaaS)"],
        "correct": 1,
        "explanation": "<b>Platform as a Service (PaaS)</b>, such as Azure App Service, generally requires less administrative effort for web apps compared to IaaS. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/app-service-asp-net-migration\">here</a>."
    },
    {
        "text": "Users connecting from anonymous IP address must be prompted to change password. Which Azure service?",
        "options": ["Azure AD Connect Health", "Azure AD Privileged Identity Management", "Azure Advanced Threat Protection (ATP)", "Azure AD Identity Protection"],
        "correct": 3,
        "explanation": "<b>Azure AD Identity Protection</b> can enforce sign-in risk policies to prompt actions like password changes based on risk detections such as anonymous IP addresses. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/tutorial-risk-based-sspr-mfa\">here</a>."
    },
    {
        "text": "Evaluate underlined text: <b>Authorization</b> is the process of verifying a user's credentials.",
        "options": ["No change is needed.", "Authentication", "Federation", "Ticketing"],
        "correct": 1,
        "explanation": "<b>Authentication</b> is the process of verifying a user's credentials, while authorization grants permissions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity-platform/authentication-vs-authorization\">here</a>."
    },    
    {
        "text": "You can assign additional account administrators in the Azure Portal.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, you can assign additional account administrators in the Azure Portal. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/role-based-access-control/role-assignments-portal-subscription-admin\">here</a>."
    },
    {
        "text": "You need a Microsoft account to manage an Azure subscription.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, you need an account in the associated Azure AD (organizational account), though a Microsoft account can be invited or used initially. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/microsoft-365/enterprise/subscriptions-licenses-accounts-and-tenants-for-microsoft-cloud-offerings?view=o365-worldwide\">here</a>."
    },
    {
        "text": "Resource groups contain subscriptions.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, subscriptions contain resource groups, not the other way around. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/azure-setup-guide/organize-resources\">here</a>."
    },
    {
        "text": "To which cloud models can you deploy physical servers?",
        "options": ["private cloud and hybrid cloud only", "private cloud only", "private cloud, hybrid cloud and public cloud", "hybrid cloud only"],
        "correct": 0,
        "explanation": "<b>Private cloud and hybrid cloud only</b> are the cloud models where physical servers can be deployed. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/modules/align-requirements-in-azure/\">here</a>."
    },
    {
        "text": "Need to ensure VM1 accessible over HTTP. Solution: Modify a DDoS protection plan. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, DDoS protection prevents attacks but does not allow traffic. Network Security Group (NSG) or Firewall rules are needed for access. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/network-security-group-how-it-works\">here</a>."
    },
    {
        "text": "What can you use to automatically send an alert if an administrator stops an Azure virtual machine?",
        "options": ["Azure Advisor", "Azure Service Health", "Azure Monitor", "Azure Network Watcher"],
        "correct": 2,
        "explanation": "You can use <b>Azure Monitor</b> to automatically send an alert if an administrator stops an Azure virtual machine. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/vm/monitor-virtual-machine-alerts\">here</a>."
    },
    {
        "text": "Need to control internet access ports for Azure VMs. What should you use?",
        "options": ["an Azure Active Directory (AzureAD) role", "an Azure key vault", "an Azure Active Directory group", "a network security group (NSG)"],
        "correct": 3,
        "explanation": "You should use <b>a network security group (NSG)</b> to control internet access ports for Azure VMs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/network-security-group-how-it-works\">here</a>."
    },
    {
        "text": "You are charged for Azure resource groups.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Azure resource groups themselves are free and serve as logical containers for organizing resources. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/azure-setup-guide/organize-resources\">here</a>."
    },
    {
        "text": "Data ingress over a VPN connection is charged.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, data ingress over a VPN connection is typically free. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-about-vpn-gateway\">here</a>."
    },
    {
        "text": "Data egress over a VPN connection is charged.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, data egress over a VPN connection is typically charged. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-about-vpn-gateway\">here</a>."
    },
    {
        "text": "Evaluate underlined text: App with Web App (SLA 99.95%) and SQL DB (SLA 99.99%). Composite SLA is <b>the product of both SLAs, which equals 99.94 percent</b>.",
        "options": ["No change is needed.", "the lowest SLA associated to the application, which is 99.95 percent", "the highest SLA associated to the application, which is 99.99 percent", "the difference between the two SLAs, which is 0.05 percent"],
        "correct": 0,
        "explanation": "<b>No change is needed</b>. The composite SLA is calculated as the product of both SLAs: 0.9995 * 0.9999 ≈ 0.9994 (99.94%). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/framework/resiliency/business-metrics#understand-service-level-agreements\">here</a>."
    },
    {
        "text": "Evaluate underlined BOLD text: Azure Cosmos DB is an example of a <b>platform as a service (PaaS)</b> offering.",
        "options": ["No change is needed", "infrastructure as a service (IaaS)", "serverless", "software as a service (SaaS)"],
        "correct": 0,
        "explanation": "<b>No change is needed</b>. Azure Cosmos DB is a fully managed platform as a service (PaaS) offering. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cosmos-db/resource-model\">here</a>."
    },
    {
        "text": "Reduce costs by removing unused: user accounts, groups, public IPs, network interfaces. Solution: Remove unused network interfaces. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, unused network interfaces generally do not incur costs, unlike unused standard public IPs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/network-interface-overview\">here</a>."
    },
    
    {
        "text": "Data transfer between Azure services located in two Azure regions is always free.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, inter-region data transfer typically incurs costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/networking/data-transfer-pricing\">here</a>."
    },
    {
        "text": "You have an Azure VM named VM1 and plan to encrypt it using Azure Disk Encryption. Which Azure resource must you create first?",
        "options": ["An Azure Storage account", "An Azure Information Protection policy", "An Encryption Key", "An Azure Key Vault"],
        "correct": 3,
        "explanation": "You must create <b>An Azure Key Vault</b> first to encrypt the VM using Azure Disk Encryption. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/windows/disk-encryption-key-vault\">here</a>."
    },
    {
        "text": "Evaluate underlined text: The *Microsoft Online Services Privacy Statement* explains what data Microsoft processes, how Microsoft processes the data, and the purpose of processing the data.",
        "options": ["No change is needed.", "Microsoft Online Services Terms", "Microsoft Online Service Level Agreement", "Online Subscription Agreement for Microsoft Azure"],
        "correct": 0,
        "explanation": "<b>No change is needed</b>. The Microsoft Online Services Privacy Statement accurately explains what data Microsoft processes, how it processes the data, and the purpose of processing the data. Learn more on Microsoft Learn <a href=\"https://www.microsoft.com/en-us/privacy/privacystatement\">here</a>."
    },
    {
        "text": "Which statement accurately describes the Modern Lifecycle Policy for Azure services?",
        "options": ["Microsoft provides mainstream support for a service for five years.", "Microsoft provides a minimum of 12 months’ notice before ending support for a service.", "After a service is made generally available, Microsoft provides support for the service for a minimum of four years.", "When a service is retired, you can purchase extended support for the service for up to five years."],
        "correct": 1,
        "explanation": "<b>Microsoft provides a minimum of 12 months’ notice before ending support for a service</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/lifecycle/policies/modern\">here</a>."
    },
    {
        "text": "Evaluate BOLD text: The Azure *Standard* support plan is the lowest cost option to receive 24x7 access to support engineers by phone.",
        "options": ["No change is needed", "Developer", "Basic", "Professional Direct"],
        "correct": 1,
        "explanation": "<b>Developer</b> is the lowest paid plan offering email access to support engineers, while Standard is the lowest cost option for phone support. Learn more on Microsoft Learn <a href=\"https://azure.microsoft.com/en-us/support/plans/\">here</a>."
    },
    
    {
        "text": "Company needs to deploy custom invoicing apps with prerequisites. Recommend a cloud solution.",
        "options": ["Software as a Service (SaaS)", "Platform as a Service (PaaS)", "Infrastructure as a Service (IaaS)"],
        "correct": 2,
        "explanation": "<b>Infrastructure as a Service (IaaS)</b> is suitable for deploying custom applications with specific prerequisite installs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/overview\">here</a>."
    },
    {
        "text": "Company has SQL Server licenses with Software Assurance, deploying SQL on Azure VMs. How to minimize licensing costs?",
        "options": ["Use Azure reservations.", "Use Azure Hybrid Benefit.", "Deallocate the virtual machines during off hours.", "Configure Azure Cost Management budgets."],
        "correct": 1,
        "explanation": "You can minimize licensing costs by using <b>Azure Hybrid Benefit</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/windows/hybrid-use-benefit-licensing\">here</a>."
    },
    {
        "text": "A Platform as a Service (PaaS) solution that hosts web apps provides access to the operating system.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, PaaS abstracts the underlying operating system, so access is not provided. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/overview\">here</a>."
    },
    {
        "text": "A PaaS solution that hosts web apps provides the ability to manage the underlying infrastructure.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, PaaS abstracts infrastructure management and provides automatic scaling and maintenance. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/environment/intro\">here</a>."
    },
    {
        "text": "A PaaS solution that hosts web apps in Azure provides the ability to scale the platform automatically.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, autoscaling is a key feature of PaaS solutions that host web apps. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/app-service/manage-scale\">here</a>."
    },
    {
        "text": "Need to create a new Azure VM from an Android tablet. What are three possible solutions?",
        "options": ["Use the PowerApps portal, Use the Security & Compliance admin center, Use the Azure portal", "Use Bash in Azure Cloud Shell, Use PowerShell in Azure Cloud Shell, Use the Azure portal", "Use the PowerApps portal, Use PowerShell in Azure Cloud Shell, Use the Azure portal"],
        "correct": 1,
        "explanation": "Correct options: <b>Use Bash in Azure Cloud Shell</b>, <b>Use PowerShell in Azure Cloud Shell</b>, <b>Use the Azure portal</b>. All are accessible via browser on Android. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-shell/overview\">here</a>."
    },
    {
        "text": "With Azure ExpressRoute, all inbound data transfer is free of charge.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, all inbound data transfer is free of charge with Azure ExpressRoute. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/expressroute/expressroute-pricing\">here</a>."
    },
    {
        "text": "With Azure ExpressRoute, all outbound data transfer is free of charge.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, outbound data transfer with Azure ExpressRoute typically incurs charges. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/expressroute/expressroute-pricing\">here</a>."
    },
    
    {
        "text": "You need VM service availability if a single data center fails. Solution: Deploy VMs to a scale set. Does this meet the goal?",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, scale sets provide high availability within a data center (using fault/update domains), but Availability Zones are needed for cross-data center protection. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-use-availability-zones\">here</a>."
    },
    {
        "text": "An Azure Active Directory (Azure AD) tenant can contain multiple Azure subscriptions.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, an Azure AD tenant can contain multiple Azure subscriptions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/guide/multitenant/overview\">here</a>."
    },
    {
        "text": "An Azure subscription can be associated with multiple Azure AD tenants.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, an Azure subscription can only trust one Azure AD tenant. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/answers/questions/2149133/within-an-azure-subscription-you-can-create-multip\">here</a>."
    },
    {
        "text": "If your Azure subscription expires, the associated Azure AD tenant is automatically deleted.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, the Azure AD tenant remains and can be associated with another subscription even if the Azure subscription expires. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity/users/directory-delete-howto\">here</a>."
    },
    
    {
        "text": "Azure resources deployed to a single resource group must be located in the same Azure region as the resource group.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, Azure resources can be in different regions than their resource group. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/manage-resource-groups-portal\">here</a>."
    },
    {
        "text": "Tags applied to a resource group are inherited by the resources within that resource group.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, tags applied to a resource group are not inherited by the resources within that group. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/tag-resources\">here</a>."
    },
    {
        "text": "A resource group can be used to scope access control for administrative actions.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, a resource group can be used to scope access control for administrative actions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/role-based-access-control/scope-overview\">here</a>."
    },
    {
        "text": "North America has only one Azure region.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, North America has multiple Azure regions. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/reliability/regions-overview\">here</a>."
    },
    {
        "text": "An Azure region is a set of datacenters connected through a dedicated low-latency network.",
        "options": ["Yes", "No"],
        "correct": 0,
        "explanation": "<b>Yes</b>, an Azure region consists of datacenters connected through a dedicated low-latency network. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/reliability/regions-overview\">here</a>."
    },
    {
        "text": "Outbound data transfer between Azure regions is always free.",
        "options": ["Yes", "No"],
        "correct": 1,
        "explanation": "<b>No</b>, outbound data transfer between Azure regions is typically charged. Learn more on Microsoft Learn <a href=\"https://techcommunity.microsoft.com/blog/azurenetworkingblog/a-guide-to-azure-data-transfer-pricing/4374538\">here</a>."
    },
    {
        "text": "Your company has an Azure subscription that contains unused resources: 20 user accounts, 5 groups, 10 public IP addresses, 10 network interfaces. To reduce costs, which should you remove?",
        "options": ["the user accounts", "the network interfaces", "the public IP addresses", "the groups"],
        "correct": 2,
        "explanation": "You should remove <b>the public IP addresses</b>, as unused standard public IPs incur charges. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/answers/questions/1662540/stopped-vm-charged-me-or-not\">here</a>."
    },
    
    {
        "text": "Staff salaries are operational expenditure.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, staff salaries are considered operational expenditure as they represent ongoing costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "Leasing software is operational expenditure.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, leasing software is considered operational expenditure as it involves recurring payments for usage. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "Azure Security Center can monitor Azure resources and on-premises resources.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Azure Security Center can monitor both Azure and on-premises resources. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/security-center/security-center-introduction\">here</a>."
    },
    {
        "text": "All Azure Security Center features are free.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, some features in Azure Security Center require an enhanced security plan. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/security-center/security-center-pricing\">here</a>."
    },
    {
        "text": "Azure Security Center lets you track and manage compliance.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Azure Security Center provides tools to track and manage compliance. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/security/fundamentals/overview\">here</a>."
    },
    {
        "text": "Azure Monitor collects telemetry from cloud and on-premises environments.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Azure Monitor collects telemetry from both cloud and on-premises environments. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/fundamentals/overview\">here</a>."
    },
    {
        "text": "Alerts in Azure Monitor proactively notify you of critical conditions.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, alerts in Azure Monitor proactively notify you of critical conditions based on collected telemetry. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/alerts/alerts-overview\">here</a>."
    },
    {
        "text": "Azure Monitor targets can include Log Analytics workspaces.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Azure Monitor targets can include Log Analytics workspaces for data analysis and visualization. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/logs/log-analytics-workspace-overview\">here</a>."
    },
    {
        "text": "You need to start Azure Cloud Shell. What should you use?",
        "options": [
            "Azure PowerShell",
            "an Azure Resource Manager (ARM) template",
            "the Azure portal",
            "Azure Command-Line Interface (CLI)"
        ],
        "correct": 2,
        "explanation": "You should use <b>the Azure portal</b> to start Azure Cloud Shell. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-shell/get-started/classic\">here</a>."
    },
    {
        "text": "Which Azure service can you use as a security information and event management (SIEM) solution?",
        "options": [
            "Azure Analysis Services",
            "Azure Cognitive Services",
            "Microsoft Sentinel",
            "Azure Information Protection"
        ],
        "correct": 2,
        "explanation": "You can use <b>Microsoft Sentinel</b> as a security information and event management (SIEM) solution. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/sentinel/overview\">here</a>."
    },
    {
        "text": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Which one <b>cannot</b> run the script?",
        "options": [
            "a computer that runs macOS and has PowerShell Core 6.0 installed",
            "a computer that runs Windows 10 and has the Azure PowerShell module installed",
            "a computer that runs Chrome OS and uses Azure Cloud Shell",
            "a computer that runs Linux and has the Azure CLI tools installed"
        ],
        "correct": 3,
        "explanation": "Correct options: You need a computer running PowerShell or Cloud Shell. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/manage-resources-powershell\">here</a>."
    },
    {
        "text": "Your company requires PaaS only. Solution: Create Azure VMs, Azure SQL DBs, Azure Storage. Does this meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, creating Azure VMs (IaaS) violates the PaaS-only requirement. Azure SQL Database and Azure Storage are PaaS, but the inclusion of Azure VMs makes the solution non-compliant. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-sql/database/sql-database-paas-overview?view=azuresql\">here</a>."
    },
    {
        "text": "Building a data center infrastructure is operational expenditure.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, building a data center infrastructure is considered CapEx as it involves upfront investment in physical infrastructure. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "You have an accounting application named App1 that uses a legacy database. You plan to move App1 to the cloud. Which service model should you use?",
        "options": [
            "software as a service (SaaS)",
            "infrastructure as a service (IaaS)",
            "platform as a service (PaaS)"
        ],
        "correct": 1,
        "explanation": "<b>Infrastructure as a service (IaaS)</b> is suitable for migrating existing apps, especially those with specific dependencies like a legacy database. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/modernize/modernize-strategies/database-modernization\">here</a>."
    },
    {
        "text": "You must deploy a federation solution or sync on-premises identities to the cloud to use MFA.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, cloud-only identities can use MFA without requiring a federation solution or syncing on-premises identities. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-migrate-mfa-server-to-mfa-with-federation\">here</a>."
    },
    {
        "text": "Picture identification and passport numbers are valid MFA authentication methods.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, valid MFA methods include Authenticator App, SMS, Voice call, and Password. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-methods\">here</a>."
    },
    {
        "text": "You can configure MFA to be required for administrator accounts only.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, MFA can be configured for specific users/groups or all users, including administrator accounts only. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-mandatory-multifactor-authentication\">here</a>."
    },
    {
        "text": "You have on-premises servers that run Windows Server. What should you implement to manage the servers by using the Azure portal?",
        "options": [
            "Azure Kubernetes Service (AKS)",
            "Azure Arc",
            "Docker",
            "role-based access control (RBAC)"
        ],
        "correct": 1,
        "explanation": "<b>Azure Arc</b> enables you to manage on-premises servers through the Azure portal. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-arc/servers/windows-server-management-overview\">here</a>."
    },
    {
        "text": "Your company has an Azure subscription that contains several resources. You need to identify which department is responsible for the cost of each resource. What should you use?",
        "options": [
            "tags",
            "alerts",
            "budgets"
        ],
        "correct": 0,
        "explanation": "You should use <b>tags</b> to identify resource owners and cost centers. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/management/tag-resources\">here</a>."
    },
    {
        "text": "You have an Azure application that uses two services with SLAs of 99.9% and 99.99%. How should you calculate the composite SLA for the application?",
        "options": [
            "Max(0.999, 0.9999)",
            "0.999 / 0.9999",
            "0.999 * 0.9999",
            "Min(0.999, 0.9999)"
        ],
        "correct": 2,
        "explanation": "The composite SLA for dependent services is calculated as <b>0.999 * 0.9999</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/framework/resiliency/business-metrics#understand-service-level-agreements\">here</a>."
    },
    {
        "text": "What provides a unified way to project and manage non-Azure resources in Azure Resource Manager (ARM)?",
        "options": [
            "Azure Arc",
            "Azure AD Connect",
            "Azure Migrate",
            "Azure Front Door"
        ],
        "correct": 0,
        "explanation": "<b>Azure Arc</b> provides a unified way to project and manage non-Azure resources in Azure Resource Manager. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-arc/overview\">here</a>."
    },
    {
        "text": "What does a customer provide in a software as a service (SaaS) model?",
        "options": [
            "application software",
            "compute resources",
            "application data",
            "data storage"
        ],
        "correct": 2,
        "explanation": "In a SaaS model, a customer provides <b>application data</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/saas/saas-foundations/\">here</a>."
    },
    {
        "text": "What enables a cloud service to adapt quickly to changing requirements?",
        "options": [
            "high availability",
            "agility",
            "manageability",
            "predictability"
        ],
        "correct": 1,
        "explanation": "<b>Agility</b> enables a cloud service to adapt quickly to changing requirements. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/plan/adapt-roles-skills-processes\">here</a>."
    },
    {
        "text": "Where does Azure Monitor store performance data?",
        "options": [
            "a Log Analytics workspace",
            "an Azure Storage account",
            "Azure Event Hubs",
            "an event subscription"
        ],
        "correct": 0,
        "explanation": "Azure Monitor stores performance data in <b>a Log Analytics workspace</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-monitor/logs/log-analytics-workspace-overview\">here</a>."
    },
    {
        "text": "You plan to reduce ongoing Azure expenditures. You need to identify which factors affect the costs of a resource. Which three factors should you identify?",
        "options": [
            "the Azure region, the type of processed data, the volume of inbound data",
            "the Azure region, the service tier, the type of processed data",
            "the type of processed data, the volume of outbound data, the service tier"
        ],
        "correct": 2,
        "explanation": "Correct options: <b>the type of processed data</b>, <b>the volume of outbound data</b>, <b>the service tier</b>. Note: Azure region also typically affects cost. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/understand/plan-manage-costs\">here</a>."
    },
    {
        "text": "Which Service Level Agreement (SLA) is provided for Azure services in public preview?",
        "options": [
            "Each service defines its own SLA.",
            "The SLA will be 99%.",
            "The SLA will be 1% less than the general availability (GA) SLA.",
            "The SLA will be 99.95%."
        ],
        "correct": 0,
        "explanation": "<b>Each service defines its own SLA</b>. However, typically previews have no SLA or specific terms apply. Learn more on Microsoft Learn <a href=\"https://www.microsoft.com/licensing/docs/view/Service-Level-Agreements-SLA-for-Online-Services\">here</a>."
    },
    {
        "text": "What should you use to track the costs of Azure resources?",
        "options": [
            "Tags",
            "usage and quotas",
            "Azure Quickstart templates",
            "budgets"
        ],
        "correct": 3,
        "explanation": "You should use <b>budgets</b> to track the costs of Azure resources. Tags are used for allocation/filtering costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/costs/tutorial-acm-create-budgets\">here</a>."
    },
    {
        "text": "Fill in the blank: If an Azure virtual machine has a status of Stopped (deallocated), you will continue to pay for ( _______ )",
        "options": [],
        "correct": "storage",
        "explanation": "If an Azure virtual machine has a status of Stopped (deallocated), you will continue to pay for <b>storage</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/states-billing\">here</a>."
    },
    {
        "text": "Statement requires visual context.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, specific statement requires visual context. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/visualstudio/extensibility/walkthrough-displaying-statement-completion\">here</a>."
    },
    {
        "text": "Your company has an Azure subscription and three business units. You plan to deploy new resources for each business unit. You need to ensure that the new resources are deployed by using a repeatable and reliable method that applies the same configurations to each resource. What should you use?",
        "options": [
            "Azure Arc",
            "a resource group",
            "Azure Resource Manager (ARM) templates",
            "Azure Policy"
        ],
        "correct": 2,
        "explanation": "<b>Azure Resource Manager (ARM) templates</b> provide a repeatable and reliable method for deploying resources with consistent configurations. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/templates/overview\">here</a>."
    },
    {
        "text": "How many copies of data are maintained by an Azure Storage account that uses locally-redundant storage (LRS)?",
        "options": [
            "3",
            "4",
            "6",
            "9"
        ],
        "correct": 0,
        "explanation": "<b>3</b> copies of data are maintained by an Azure Storage account using locally-redundant storage (LRS). Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/common/storage-redundancy\">here</a>."
    },
    {
        "text": "What additional resource is required by an Azure virtual machine?",
        "options": [
            "Azure Firewall",
            "a virtual network",
            "a public IP address",
            "a service endpoint"
        ],
        "correct": 1,
        "explanation": "An Azure virtual machine requires <b>a virtual network</b> to function. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/network-overview\">here</a>."
    },
    {
        "text": "You can join Android devices to Azure AD.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, you can join Android devices to Azure AD. Typically, this requires Intune or Mobile Device Management (MDM) for management, but joining and registration are possible. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/windows-server/identity/ad-fs/operations/walkthrough--workplace-join-to-an-android-device\">here</a>."
    },
    {
        "text": "You must have internet connectivity to manage cloud services.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, internet connectivity is essential to manage cloud services effectively. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/networking/fundamentals/networking-overview\">here</a>."
    },
    {
        "text": "You must install a management app to manage cloud services.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, you can manage cloud services using web portals, CLI, PowerShell, and other tools without installing a dedicated management app. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/microsoft-365/solutions/apps-assign-management?view=o365-worldwide\">here</a>."
    },
    {
        "text": "You can manage cloud services from any modern web browser.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, cloud services can be managed from any modern web browser, providing flexibility and accessibility. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/modules/describe-cloud-service-types/\">here</a>."
    },
    {
        "text": "`_________` provide a common platform for deploying objects to a cloud infrastructure and for implementing consistency across the Azure environment.",
        "options": [
            "Azure Resource Manager templates",
            "Azure policies",
            "Resource groups",
            "Management groups"
        ],
        "correct": 0,
        "explanation": "<b>Azure Resource Manager templates</b> provide a common platform for deploying objects to a cloud infrastructure and ensuring consistency across the Azure environment. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-resource-manager/templates/overview\">here</a>."
    },
    {
        "text": "Paying electricity for your datacenter is an example of OpEx.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, paying electricity for your datacenter is an example of OpEx as it represents ongoing operational costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "Deploying your own datacenter is an example of CapEx.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, deploying your own datacenter is an example of CapEx as it involves upfront investment in physical infrastructure. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "You can create Group Policies in Azure AD.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, you cannot create Group Policies in Azure AD. Instead, Azure Policy is used for governance and compliance. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/governance/policy/overview\">here</a>."
    },
    {
        "text": "You can join Windows 10 devices to Azure AD.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, you can join Windows 10 devices to Azure AD to enable centralized management and access to cloud resources. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/devices/azureadjoin-plan\">here</a>."
    },
    {
        "text": "Select the answer that correctly completes the sentence: `_________` runs application code in Azure without requiring a server.",
        "options": [
            "Azure Functions",
            "An Azure DevOps pipeline",
            "An Azure Resource Manager template",
            "Azure Application Gateway"
        ],
        "correct": 0,
        "explanation": "<b>Azure Functions</b> runs application code in Azure without requiring a server. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-functions/functions-overview\">here</a>."
    },
    {
        "text": "Select the answer that correctly completes the sentence: You plan to deploy 20 virtual machines to an Azure environment. To ensure that a virtual machine named VM1 cannot connect to the other virtual machines, VM1 must `_________`.",
        "options": [
            "be deployed to a separate virtual network",
            "run a different operating system than the other virtual machines",
            "be deployed to a separate resource group",
            "have two network interfaces"
        ],
        "correct": 0,
        "explanation": "VM1 must <b>be deployed to a separate virtual network</b> to ensure it cannot connect to the other virtual machines. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-network/network-overview\">here</a>."
    },
    {
        "text": "What is the longest term you can purchase for Azure Reserved VM Instances?",
        "options": [
            "three years",
            "four years",
            "one year",
            "five years"
        ],
        "correct": 0,
        "explanation": "The longest term you can purchase for Azure Reserved VM Instances is <b>three years</b>. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/prepay-reserved-vm-instances\">here</a>."
    },
    {
        "text": "Select the answer that correctly completes the sentence: Autoscaling is an example of `_________`.",
        "options": [
            "elasticity",
            "agility",
            "geo-distribution",
            "predictability"
        ],
        "correct": 0,
        "explanation": "Autoscaling is an example of <b>elasticity</b>, which dynamically allocates resources to match performance requirements. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/architecture/best-practices/auto-scaling\">here</a>."
    },
    {
        "text": "Azure Pay-As-You-Go pricing is an example of CapEx.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, Azure Pay-As-You-Go pricing is an example of OpEx, reflecting ongoing operational costs rather than fixed equipment costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "You can use `_________` in Azure to send email alerts when the cost of the current billing period exceeds a specified limit.",
        "options": [
            "Advisor recommendations",
            "Access control (IAM)",
            "Budget alerts",
            "Compliance"
        ],
        "correct": 2,
        "explanation": "<b>Budget alerts</b> in Azure allow you to send email notifications when spending exceeds a specified limit. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/costs/tutorial-acm-create-budgets\">here</a>."
    },
    {
        "text": "`_________` is an Apache Spark-based analytics service.",
        "options": [
            "Azure Databricks",
            "Azure Data Factory",
            "Azure DevOps",
            "Azure Synapse Analytics"
        ],
        "correct": 0,
        "explanation": "<b>Azure Databricks</b> is an Apache Spark-based analytics service designed for big data and machine learning. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/databricks/\">here</a>."
    },
    {
        "text": "Trust Center is part of Microsoft Defender for Cloud.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, Trust Center is not part of Microsoft Defender for Cloud; it is a separate resource for compliance and security information. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/defender-for-cloud/zero-trust\">here</a>."
    },
    {
        "text": "Trust Center can only be accessed by users that have an Azure subscription.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, Trust Center is publicly accessible and does not require an Azure subscription. Learn more on Microsoft Learn <a href=\"https://www.microsoft.com/en-us/trust-center/compliance/accessibility\">here</a>."
    },
    {
        "text": "Trust Center provides information about the Azure compliance offerings.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Trust Center provides detailed information about Azure compliance offerings. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/compliance/\">here</a>."
    },
    {
        "text": "You must have internet connectivity to use cloud computing.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Internet connectivity is essential for accessing cloud services. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/modules/describe-cloud-compute/\">here</a>."
    },
    {
        "text": "The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Cloud computing allows for cost-effective scalability compared to on-premises datacenters. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "The Archive access tier is set at the storage account level.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Access tiers like Archive are typically set at the blob level, although defaults can be set at the account level. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "The Hot access tier is recommended for data that is accessed and modified frequently.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "The Hot tier is optimized for frequently accessed or modified data. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "The Cool access tier is recommended for long term backups.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The Archive tier is generally recommended for long-term backups. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "You plan to deploy a service to Azure virtual machines. You need to ensure that the service will be available if a datacenter fails. What should you use as part of the virtual machine deployment?",
        "options": [
            "availability sets",
            "proximity placement groups",
            "host groups",
            "availability zones"
        ],
        "correct": 3,
        "explanation": "Availability zones ensure service availability even if a datacenter fails. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/availability\">here</a>."
    },
    {
        "text": "When you are implementing a Software as a Service (SaaS) solution, you are responsible for `_________`.",
        "options": [
            "configuring high availability",
            "defining scalability rules",
            "installing the SaaS solution",
            "configuring the SaaS solution"
        ],
        "correct": 3,
        "explanation": "In a SaaS solution, you are responsible for configuring the solution to meet your needs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/saas/saas-foundations/\">here</a>."
    },
    {
        "text": "You must have internet connectivity to use cloud computing.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Internet connectivity is essential for accessing cloud services. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/modules/describe-cloud-compute/\">here</a>."
    },
    {
        "text": "The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Cloud computing allows for cost-effective scalability compared to on-premises datacenters. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "The Archive access tier is set at the storage account level.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Access tiers like Archive are typically set at the blob level, although defaults can be set at the account level. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "The Hot access tier is recommended for data that is accessed and modified frequently.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "The Hot tier is optimized for frequently accessed or modified data. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "The Cool access tier is recommended for long term backups.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The Archive tier is generally recommended for long-term backups. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/storage/blobs/access-tiers-overview\">here</a>."
    },
    {
        "text": "You plan to deploy a service to Azure virtual machines. You need to ensure that the service will be available if a datacenter fails. What should you use as part of the virtual machine deployment?",
        "options": [
            "availability sets",
            "proximity placement groups",
            "host groups",
            "availability zones"
        ],
        "correct": 3,
        "explanation": "Availability zones ensure service availability even if a datacenter fails. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/virtual-machines/availability\">here</a>."
    },
    {
        "text": "When you are implementing a Software as a Service (SaaS) solution, you are responsible for `_________`.",
        "options": [
            "configuring high availability",
            "defining scalability rules",
            "installing the SaaS solution",
            "configuring the SaaS solution"
        ],
        "correct": 3,
        "explanation": "In a SaaS solution, you are responsible for configuring the solution to meet your needs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/saas/saas-foundations/\">here</a>."
    },
    {
        "text": "Azure Cosmos DB is an example of software as a service (SaaS).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Azure Cosmos DB is a PaaS offering. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cosmos-db/resource-model\">here</a>."
    },
    {
        "text": "Select the answer that correctly completes the sentence: `_________` is the process of establishing the identity of a person or service that wants to access a resource.",
        "options": [
            "Authentication",
            "Authorization",
            "Conditional Access",
            "Synchronization"
        ],
        "correct": 0,
        "explanation": "Authentication is the process of verifying the identity of a person or service. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/entra/fundamentals/identity-fundamental-concepts\">here</a>."
    },
    {
        "text": "Microsoft Defender for Cloud can monitor Azure resources and on-premises resources.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Microsoft Defender for Cloud can monitor both Azure and on-premises resources. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/defender-for-cloud/quickstart-onboard-machines\">here</a>."
    },
    {
        "text": "All Microsoft Defender for Cloud features are free.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Some features require the enhanced security plan. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/defender-for-cloud/defender-for-cloud-introduction\">here</a>."
    },
    {
        "text": "From Microsoft Defender for Cloud, you can download a Regulatory Compliance report.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "You can download a Regulatory Compliance report from Microsoft Defender for Cloud. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/defender-for-cloud/concept-regulatory-compliance-standards\">here</a>."
    },
    {
        "text": "Requiring a user to enter a password and answer a security question when signing-in to Azure Active Directory (Azure AD) is an example of `_________`.",
        "options": [
            "multi-factor authentication (MFA)",
            "Single Sign-On (SSO)",
            "Basic Authentication"
        ],
        "correct": 0,
        "explanation": "Multi-factor authentication (MFA) adds an extra layer of security by requiring multiple forms of verification. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/active-directory-b2c/multi-factor-authentication\">here</a>."
    },
    {
        "text": "You must have physical servers to use cloud computing.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Cloud computing does not require physical servers; resources are accessed virtually. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/training/modules/describe-cloud-compute/\">here</a>."
    },
    {
        "text": "Pay-As-You-Go (PAYG) is a consumption-based model.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "PAYG allows organizations to scale usage based on demand, paying only for the consumption. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/pay-as-you-go/overview\">here</a>."
    },
    {
        "text": "Payments to cloud service providers are considered capital expenditures (CapEx).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Cloud payments are typically operational expenditures (OpEx), reflecting actual usage rather than fixed costs. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "The services provided through a consumption-based model are considered operational expenditures (OpEx).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "OpEx includes ongoing costs like periodic payments for services, promoting financial agility. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/inform/cost-efficiency\">here</a>."
    },
    {
        "text": "Azure SQL Database is an example of platform as a service (PaaS).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Azure SQL Database is a fully managed PaaS database engine, handling upgrades, backups, and monitoring. Learn more on Microsoft Learn <a href=\"https://learn.microsoft.com/en-us/azure/azure-sql/database/sql-database-paas-overview?view=azuresql\">here</a>."
    },
    {
        "text": "Does Azure Arc enable scaling of Azure Kubernetes Service (AKS) clusters?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure Arc enables scaling by providing better resource visibility, which allows administrators to monitor resource usage more effectively and manage scaling across different environments. This enhanced visibility helps in configuring and applying Kubernetes auto-scaling features, such as the Cluster Autoscaler or Horizontal Pod Autoscaler, although those features still need to be properly set up. Learn more at <a href='https://learn.microsoft.com/en-us/azure/azure-arc/kubernetes/'>Azure Arc-enabled Kubernetes</a>."
    },
    {
        "text": "Microsoft SQL Server 2019 installed on an Azure virtual machine is an example of platform as a service (PaaS).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Installing Microsoft SQL Server on an Azure virtual machine is considered Infrastructure as a Service (IaaS) because you manage the SQL Server instance and underlying operating system. In a PaaS model, the service is managed by the provider, as is the case with Azure SQL Database. Learn more at <a href='https://learn.microsoft.com/en-us/azure/architecture/guide/technology-choices/iaas-vs-paas/'>Azure IaaS vs. PaaS</a>."
    },
    {
        "text": "Azure SQL Database is an example of platform as a service (PaaS).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure SQL Database is a fully managed relational database service provided as Platform as a Service (PaaS), which means Microsoft manages the infrastructure, backups, scaling, and updates. Learn more at <a href='https://learn.microsoft.com/en-us/azure/azure-sql/database/'>Azure SQL Database</a>."
    },
    {
        "text": "Azure Cosmos DB is an example of software as a service (SaaS).",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Azure Cosmos DB is a globally distributed, multi-model database service provided as Platform as a Service (PaaS). Although it is fully managed, it is not considered Software as a Service (SaaS) because it offers a managed data platform rather than a complete end-user application. Learn more at <a href='https://learn.microsoft.com/en-us/azure/cosmos-db/introduction'>Azure Cosmos DB</a>."
    },
    {
        "text": "Is Pay-As-You-Go (PAYG) a consumption-based model?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. The Pay-As-You-Go (PAYG) model allows users to pay only for the resources they consume, making it a consumption-based model. Learn more at <a href='https://learn.microsoft.com/en-us/azure/cost-management-billing/costs/cost-analysis'>Azure Cost Management</a>."
    },
    {
        "text": "Are payments to cloud service providers considered capital expenditures (CapEx)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Payments to cloud service providers are typically classified as operational expenditures (OpEx) because they are recurring expenses rather than upfront investments. Learn more at <a href='https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/capex-vs-opex'>Azure CapEx vs OpEx</a>."
    },
    {
        "text": "Are services provided through a consumption-based model considered operational expenditures (OpEx)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Operational expenditures (OpEx) refer to recurring costs, such as those for consumption-based cloud services. Learn more at <a href='https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/capex-vs-opex'>Azure CapEx vs OpEx</a>."
    },
    {
        "text": "What is the primary reason for using Azure Arc with Kubernetes?",
        "options": [
            "To deploy new Azure Kubernetes Service (AKS) clusters in Azure",
            "To manage Kubernetes clusters across different environments",
            "To replace Kubernetes with Azure Virtual Machines",
            "To store Kubernetes container images"
        ],
        "correct": 1,
        "explanation": "<b>To manage Kubernetes clusters across different environments</b>. Azure Arc enables centralized management of Kubernetes clusters whether they run on-premises, in Azure, or in other cloud providers. Learn more at <a href='https://learn.microsoft.com/en-us/azure/azure-arc/kubernetes/overview'>Azure Arc-enabled Kubernetes Overview</a>."
    },
    {
        "text": "Can Azure Arc manage Kubernetes clusters running outside of Azure?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure Arc allows organizations to connect and manage Kubernetes clusters hosted outside of Azure, providing unified governance, security, and monitoring. Learn more at <a href='https://learn.microsoft.com/en-us/azure/azure-arc/kubernetes/'>Manage Kubernetes with Azure Arc</a>."
    },
    {
        "text": "Which benefit does Azure Arc provide for AKS clusters?",
        "options": [
            "Enables integration with Azure Monitor and Azure Policy",
            "Reduces AKS operational costs",
            "Automatically deploys new AKS clusters in Azure",
            "Runs Kubernetes workloads without nodes"
        ],
        "correct": 0,
        "explanation": "<b>Enables integration with Azure Monitor and Azure Policy</b>. Azure Arc helps extend Azure-native capabilities like monitoring, security, and policy enforcement to Kubernetes clusters across hybrid environments. Learn more at <a href='https://learn.microsoft.com/en-us/azure/azure-arc/'>Azure Arc Overview</a>."
    },
    {
        "text": "Can Azure Arc manage physical servers that run Linux?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure Arc extends management capabilities to physical servers, including Linux-based systems, allowing centralized control through Azure services."
    },
    {
        "text": "Does Azure Arc enable scaling of Azure Kubernetes Service (AKS) clusters?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure Arc supports managing AKS clusters across different environments, providing scaling, governance, and monitoring capabilities."
    },
    {
        "text": "Can Azure Arc manage third-party database solutions hosted outside of Azure?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure Arc allows businesses to manage databases hosted outside of Azure, including solutions like PostgreSQL and SQL Server, with cloud-based governance and security features."
    },
    {
        "text": "Your company has an Azure subscription that contains several resources. You need to identify which department is responsible for the cost of each resource. What should you use?",
        "options": [
            "Tags",
            "Alerts",
            "Budgets"
        ],
        "correct": 0,
        "explanation": "<b>Tags</b>. Tags allow you to assign metadata to resources, such as department names, which helps track costs across different teams in Azure Cost Management."
    },
    {
        "text": "What is the purpose of the Azure Connected Machine agent?",
        "options": [
            "Managing Azure Virtual Machines",
            "Connecting non-Azure servers to Azure Arc",
            "Providing cloud storage solutions",
            "Running automated security scans"
        ],
        "correct": 1,
        "explanation": "<b>Connecting non-Azure servers to Azure Arc</b>. The Azure Connected Machine agent enables physical and virtual servers outside of Azure to be onboarded and managed through Azure Arc."
    },
    {
        "text": "Which operating systems have limited support for the Azure Connected Machine agent?",
        "options": [
            "Ubuntu 22.04",
            "Windows Server 2016",
            "CentOS 7 and 8",
            "Debian 12"
        ],
        "correct": 2,
        "explanation": "<b>CentOS 7 and 8</b>. These operating systems have limited support, meaning they won't receive newer agent versions, but critical security fixes may be backported."
    },
    {
        "text": "What should be done when deploying Azure Arc on cloned or golden image systems?",
        "options": [
            "Install Azure Arc without modifications",
            "Ensure each machine has a unique source ID",
            "Use the same machine identity across clones",
            "Avoid using golden images for Azure Arc"
        ],
        "correct": 1,
        "explanation": "<b>Ensure each machine has a unique source ID</b>. Cloned machines must be onboarded individually to avoid conflicts where multiple agents act as one Azure resource."
    },
    {
        "text": "What environments support the installation of the Connected Machine agent for Azure Arc-enabled servers?",
        "options": [
            "Only Azure Virtual Machines",
            "On physical servers (having OS installed) and virtual machines outside Azure",
            "Only on Windows servers",
            "Only on Linux servers"
        ],
        "correct": 1,
        "explanation": "<b>On physical servers and virtual machines outside Azure</b>. The Connected Machine agent enables non-Azure servers to be onboarded to Azure Arc for management."
    },
    {
        "text": "Which architecture is NOT supported by the Azure Connected Machine agent?",
        "options": [
            "x86-64 (64-bit)",
            "Arm64",
            "32-bit",
            "Both Windows and Linux architectures"
        ],
        "correct": 2,
        "explanation": "<b>32-bit</b>. The Azure Connected Machine agent does not run on 32-bit architectures; it only supports x86-64 fully and provides limited support for Arm64."
    },
    {
        "text": "Why is cloning or using golden images a concern when deploying Azure Arc?",
        "options": [
            "It causes security vulnerabilities",
            "It creates duplicate source IDs leading to inconsistent behavior",
            "It slows down the machine's performance",
            "It prevents Azure Arc from functioning properly"
        ],
        "correct": 1,
        "explanation": "<b>It creates duplicate source IDs leading to inconsistent behavior</b>. Machines that are cloned or restored from a golden image must have unique identifiers to prevent conflicts in Azure Arc."
    },
    {
        "text": "What is the primary role of the Azure Connected Machine agent?",
        "options": [
            "Managing virtual desktops",
            "Enabling Azure Arc management for non-Azure servers",
            "Providing cloud storage",
            "Monitoring Azure network traffic"
        ],
        "correct": 1,
        "explanation": "<b>Enabling Azure Arc management for non-Azure servers</b>. The Azure Connected Machine agent connects physical and virtual servers outside of Azure to Azure Arc for centralized management."
    },
    {
        "text": "Which architecture is fully supported by the Azure Connected Machine agent?",
        "options": [
            "32-bit",
            "x86-64 (64-bit)",
            "Arm64",
            "RISC-V"
        ],
        "correct": 1,
        "explanation": "<b>x86-64 (64-bit)</b>. While x86-64 is fully supported, Arm64 only supports certain features and extensions."
    },
    {
        "text": "What is a key consideration when using Azure Arc on cloned or golden image systems?",
        "options": [
            "No additional steps are needed",
            "Each cloned system must have a unique source ID",
            "Azure Arc automatically handles clones",
            "Golden images cannot use Azure Arc"
        ],
        "correct": 1,
        "explanation": "<b>Each cloned system must have a unique source ID</b>. If two agents share the same source ID, they may exhibit inconsistent behavior when acting as a single Azure resource."
    },
    {
        "text": "What is Azure Queue Storage primarily used for?",
        "options": [
            "Storing large files",
            "Creating a backlog of work to process asynchronously",
            "Serving multimedia content",
            "Managing virtual machine disks"
        ],
        "correct": 1,
        "explanation": "<b>Creating a backlog of work to process asynchronously</b>. Azure Queue Storage is designed for scenarios like the Web-Queue-Worker architectural style, where tasks are processed asynchronously."
    },
    {
        "text": "What is the maximum size limit for a single message in Azure Queue Storage?",
        "options": [
            "32 KB",
            "64 KB",
            "128 KB",
            "256 KB"
        ],
        "correct": 1,
        "explanation": "<b>64 KB</b>. Each message in Azure Queue Storage can be up to 64 KB in size."
    },
    {
        "text": "How can messages in Azure Queue Storage be accessed securely?",
        "options": [
            "SSH",
            "FTP",
            "HTTP/HTTPS",
            "RDP"
        ],
        "correct": 2,
        "explanation": "<b>HTTP/HTTPS</b>. Messages in Azure Queue Storage can be accessed globally via authenticated HTTP or HTTPS calls."
    },
    {
        "text": "What is the default time-to-live (TTL) for messages in Azure Queue Storage if the parameter is omitted?",
        "options": [
            "7 days",
            "30 days",
            "14 days",
            "1 day"
        ],
        "correct": 0,
        "explanation": "<b>7 days</b>. If the TTL parameter is not specified, messages in Azure Queue Storage have a default TTL of 7 days."
    },
    {
        "text": "Which URL format is used to access a queue in Azure Queue Storage?",
        "options": [
            "https://<storage-account>.blob.core.windows.net/<queue>",
            "https://<storage-account>.queue.core.windows.net/<queue>",
            "https://<storage-account>.table.core.windows.net/<queue>",
            "https://<storage-account>.queue.azure.com/<queue>"
        ],
        "correct": 1,
        "explanation": "<b>https://<storage-account>.queue.core.windows.net/<queue></b>. This is the standard URL format to address a queue in Azure Queue Storage."
    },
    {
        "text": "What is the primary purpose of the Web-Queue-Worker architectural style using Azure Queue Storage?",
        "options": [
            "Real-time data processing",
            "Asynchronous task processing",
            "Data backup and recovery",
            "High-performance computing"
        ],
        "correct": 1,
        "explanation": "<b>Asynchronous task processing</b>. The Web-Queue-Worker pattern leverages Azure Queue Storage to process tasks asynchronously."
    },
    {
        "text": "What is the key component of Azure Queue Storage that holds a set of messages?",
        "options": [
            "Container",
            "Queue",
            "Blob",
            "Table"
        ],
        "correct": 1,
        "explanation": "<b>Queue</b>. In Azure Queue Storage, a queue is the component that holds a set of messages."
    },
    {
        "text": "What happens to a message in Azure Queue Storage if its time-to-live (TTL) expires?",
        "options": [
            "It is automatically deleted",
            "It is moved to a backup queue",
            "It remains indefinitely",
            "It is archived"
        ],
        "correct": 0,
        "explanation": "<b>It is automatically deleted</b>. When a message’s TTL expires, Azure Queue Storage removes it from the queue automatically."
    },
    {
        "text": "What are the three types of blobs supported in Azure Blob Storage?",
        "options": [
            "Block blobs, Append blobs, and Page blobs",
            "Text blobs, Binary blobs, and File blobs",
            "Static blobs, Dynamic blobs, and Hybrid blobs",
            "Data blobs, File blobs, and Video blobs"
        ],
        "correct": 0,
        "explanation": "<b>Block blobs, Append blobs, and Page blobs</b>. Azure Blob Storage supports these blob types for different use cases, such as storing text and binary data, append operations, and random access files."
    },
    {
        "text": "Which Azure Storage account type is recommended for scenarios requiring low latency and high transaction rates?",
        "options": [
            "General-purpose v2",
            "Block blob (Premium)",
            "Page blob (Standard)",
            "File share (Basic)"
        ],
        "correct": 1,
        "explanation": "<b>Block blob (Premium)</b>. This type is ideal for high transaction rates and scenarios with smaller objects requiring low storage latency."
    },
    {
        "text": "What protocol can be used to securely connect to Azure Blob Storage?",
        "options": [
            "FTP",
            "SFTP",
            "HTTP",
            "SMTP"
        ],
        "correct": 1,
        "explanation": "<b>SFTP</b>. Clients can use Secure File Transfer Protocol (SFTP) for secure access to Azure Blob Storage."
    },
    {
        "text": "How many containers can a storage account include in Azure Blob Storage?",
        "options": [
            "Up to 100 containers",
            "Unlimited containers",
            "Up to 1,000 containers",
            "Up to 10,000 containers"
        ],
        "correct": 1,
        "explanation": "<b>Unlimited containers</b>. An Azure storage account can include an unlimited number of containers."
    },
    {
        "text": "What feature of Azure Blob Storage supports big data analytics with a hierarchical file system?",
        "options": [
            "Azure File Share",
            "Azure Data Lake Storage Gen2",
            "Azure Virtual Disk Storage",
            "Azure Log Analytics"
        ],
        "correct": 1,
        "explanation": "<b>Azure Data Lake Storage Gen2</b>. It combines a hierarchical file system with Blob Storage’s advantages, making it ideal for big data analytics."
    },
    {
        "text": "Which tool is commonly used for migrating data to Azure Blob Storage using the command line?",
        "options": [
            "BlobMover",
            "AzCopy",
            "DataSync",
            "Azure MoveTool"
        ],
        "correct": 1,
        "explanation": "<b>AzCopy</b>. This command-line tool is used to efficiently transfer data to and from Azure Blob Storage."
    },
    {
        "text": "Which type of data is most suitable for storage in Azure Blob Storage?",
        "options": [
            "Structured data",
            "Unstructured data",
            "Tabular data",
            "SQL database data"
        ],
        "correct": 1,
        "explanation": "<b>Unstructured data</b>. Azure Blob Storage is optimized for storing massive amounts of unstructured data, such as text or binary files."
    },
    {
        "text": "What is the maximum size limit for block blobs in Azure Blob Storage?",
        "options": [
            "1 TiB",
            "190.7 TiB",
            "8 TiB",
            "63 TiB"
        ],
        "correct": 1,
        "explanation": "<b>190.7 TiB</b>. Block blobs can store up to 190.7 TiB of data in Azure Blob Storage."
    },
    {
        "text": "What type of expenditure does cloud computing fall under?",
        "options": [
            "Capital Expenditure (CapEx)",
            "Operational Expenditure (OpEx)",
            "Recurring Expenditure",
            "Non-Recurrent Expenditure"
        ],
        "correct": 1,
        "explanation": "<b>Operational Expenditure (OpEx)</b>. Cloud computing operates on a consumption-based model and falls under OpEx due to its pay-as-you-go nature."
    },
    {
        "text": "What is a key benefit of the consumption-based model in cloud computing?",
        "options": [
            "High upfront costs",
            "Pay only for resources used",
            "Guaranteed full infrastructure utilization",
            "Fixed monthly costs"
        ],
        "correct": 1,
        "explanation": "<b>Pay only for resources used</b>. The consumption-based model ensures you are billed only for the IT resources actually utilized."
    },
    {
        "text": "What happens when demand drops in a cloud-based model?",
        "options": [
            "You continue paying for unused resources",
            "Resources are removed as needed",
            "Infrastructure costs increase",
            "You need to invest in new hardware"
        ],
        "correct": 1,
        "explanation": "<b>Resources are removed as needed</b>. When demand decreases, you stop paying for unneeded resources in a cloud-based model."
    },
    {
        "text": "How does the consumption-based model differ from maintaining a traditional datacenter?",
        "options": [
            "Requires upfront investment",
            "Allows for immediate scaling",
            "Fixed resource allocation",
            "Relies on overestimating resource needs"
        ],
        "correct": 1,
        "explanation": "<b>Allows for immediate scaling</b>. Unlike a traditional datacenter, the consumption-based model lets you scale resources up or down instantly."
    },
    {
        "text": "What is the primary pricing model used in cloud computing?",
        "options": [
            "Flat-rate monthly subscription",
            "Pay-as-you-go",
            "Perpetual licensing",
            "Usage-based licenses"
        ],
        "correct": 1,
        "explanation": "<b>Pay-as-you-go</b>. Cloud computing uses a pay-as-you-go model, charging only for the services and resources you utilize."
    },
    {
        "text": "What is a primary feature of Microsoft Entra ID?",
        "options": [
            "Single Sign-On (SSO)",
            "Domain Join",
            "Private Cloud Management",
            "Firewall Configuration"
        ],
        "correct": 0,
        "explanation": "<b>Single Sign-On (SSO)</b>. Microsoft Entra ID enables secure access to multiple apps with one set of credentials."
    },
    {
        "text": "What was Microsoft Entra ID previously known as?",
        "options": [
            "Microsoft Identity Manager",
            "Azure Active Directory",
            "Microsoft Access Control",
            "Microsoft Directory Services"
        ],
        "correct": 1,
        "explanation": "<b>Azure Active Directory</b>. Microsoft Entra ID is the new name for Azure AD."
    },
    {
        "text": "What does Microsoft Entra ID Protection primarily detect?",
        "options": [
            "Malware",
            "Identity risks",
            "Data loss",
            "Phishing websites"
        ],
        "correct": 1,
        "explanation": "<b>Identity risks</b>. It helps detect risks like compromised credentials and suspicious sign-ins."
    },
    {
        "text": "Which feature is used to mitigate detected identity risks in Microsoft Entra ID Protection?",
        "options": [
            "Conditional Access",
            "Firewall rules",
            "Content filtering",
            "DNS redirection"
        ],
        "correct": 0,
        "explanation": "<b>Conditional Access</b>. It applies automated policies to address identity risks."
    },
    {
        "text": "What is the goal of Microsoft Entra ID Governance?",
        "options": [
            "Monitor resource costs",
            "Ensure secure and compliant access",
            "Manage cloud network infrastructure",
            "Improve server performance"
        ],
        "correct": 1,
        "explanation": "<b>Ensure secure and compliant access</b>. It protects critical assets while maintaining productivity."
    },
    {
        "text": "Which feature in Microsoft Entra ID Governance helps review access periodically?",
        "options": [
            "Access Reviews",
            "Multifactor Authentication",
            "Role Assignments",
            "Device Registration"
        ],
        "correct": 0,
        "explanation": "<b>Access Reviews</b>. This feature ensures access rights remain appropriate over time."
    },
    {
        "text": "Who can be managed with Microsoft Entra External ID?",
        "options": [
            "Internal employees",
            "External users like customers and partners",
            "Devices only",
            "AI services"
        ],
        "correct": 1,
        "explanation": "<b>External users like customers and partners</b>. External ID manages access for users outside the organization."
    },
    {
        "text": "Which identity providers can be supported by Microsoft Entra External ID?",
        "options": [
            "Google accounts",
            "Custom apps only",
            "Microsoft accounts only",
            "Email systems only"
        ],
        "correct": 0,
        "explanation": "<b>Google accounts</b>. It supports multiple providers, including social accounts like Google and Facebook."
    },
    {
        "text": "What does Microsoft Entra Internet Access protect?",
        "options": [
            "Data centers",
            "SaaS and Microsoft 365 apps",
            "On-premises servers",
            "Mobile apps only"
        ],
        "correct": 1,
        "explanation": "<b>SaaS and Microsoft 365 apps</b>. This service secures internet access to cloud resources."
    },
    {
        "text": "What type of gateway is Microsoft Entra Internet Access?",
        "options": [
            "Firewall Gateway",
            "VPN Gateway",
            "Secure Web Gateway",
            "Load Balancer"
        ],
        "correct": 2,
        "explanation": "<b>Secure Web Gateway</b>. It focuses on securing cloud and internet resource access."
    },
    {
        "text": "What principle does Microsoft Entra Private Access follow?",
        "options": [
            "Zero Trust",
            "High Availability",
            "End-to-End Encryption",
            "Cloud Scaling"
        ],
        "correct": 0,
        "explanation": "<b>Zero Trust</b>. It secures access to private apps using Zero Trust Network Access (ZTNA)."
    },
    {
        "text": "What does Microsoft Entra Private Access secure access to?",
        "options": [
            "Public websites",
            "Private apps and resources",
            "Network traffic",
            "Email services"
        ],
        "correct": 1,
        "explanation": "<b>Private apps and resources</b>. It ensures identity-centric security for private assets."
    },
    {
        "text": "What does Microsoft Entra Permissions Management unify?",
        "options": [
            "Server scaling",
            "Permission models across clouds",
            "User workflows",
            "Automation scripts"
        ],
        "correct": 1,
        "explanation": "<b>Permission models across clouds</b>. It simplifies managing multicloud permissions."
    },
    {
        "text": "What is a key use case for Microsoft Entra Permissions Management?",
        "options": [
            "Cost reduction",
            "Permission visibility and governance",
            "Data warehousing",
            "Network optimization"
        ],
        "correct": 1,
        "explanation": "<b>Permission visibility and governance</b>. It enables centralized permission control across environments."
    },
    {
        "text": "What type of credentials does Microsoft Entra Verified ID use?",
        "options": [
            "Physical credentials",
            "Verifiable credentials",
            "Token-based credentials",
            "Session credentials"
        ],
        "correct": 1,
        "explanation": "<b>Verifiable credentials</b>. These are secure, digital, and privacy-conscious identity credentials."
    },
    {
        "text": "What is a key feature of Microsoft Entra Verified ID?",
        "options": [
            "Data storage",
            "Privacy-focused interactions",
            "Firewall setup",
            "Server hosting"
        ],
        "correct": 1,
        "explanation": "<b>Privacy-focused interactions</b>. It ensures secure interactions while respecting privacy."
    },
    {
        "text": "What does Microsoft Entra Workload ID secure?",
        "options": [
            "User identities",
            "App and service identities",
            "Device connections",
            "Cloud infrastructure"
        ],
        "correct": 1,
        "explanation": "<b>App and service identities</b>. It secures apps and services accessing cloud resources."
    },
    {
        "text": "What is a key benefit of Microsoft Entra Workload ID?",
        "options": [
            "Resource scaling",
            "Securing workloads using identity",
            "Serverless hosting",
            "Traffic load balancing"
        ],
        "correct": 1,
        "explanation": "<b>Securing workloads using identity</b>. It protects workloads similar to how user identities are secured."
    },
    {
        "text": "What is a key advantage of Azure Virtual Network Peering?",
        "options": [
            "Traffic remains on Azure's backbone",
            "Layer 2 communication between VNets",
            "Requires a VPN Gateway",
            "Enables VLAN stretching"
        ],
        "correct": 0,
        "explanation": "<b>Traffic remains on Azure's backbone</b>. Azure Virtual Network Peering ensures private, secure communication via Azure's high-speed infrastructure."
    },
    {
        "text": "What is required to establish Global VNet Peering?",
        "options": [
            "Both VNets in the same region",
            "Use of ExpressRoute",
            "Both VNets under the same Azure subscription",
            "VNets in different regions"
        ],
        "correct": 3,
        "explanation": "<b>VNets in different regions</b>. Global VNet Peering allows VNets in different Azure regions to connect seamlessly."
    },
    {
        "text": "What feature is NOT supported in a peered VNet?",
        "options": [
            "Private communication between VNets",
            "Route traffic through a Network Virtual Appliance (NVA)",
            "Access to shared Azure services",
            "Low-latency communication"
        ],
        "correct": 1,
        "explanation": "<b>Route traffic through a Network Virtual Appliance (NVA)</b>. NVAs require custom User Defined Routes for traffic between peered VNets."
    },
    {
        "text": "What defines the behavior of a policy-based VPN?",
        "options": [
            "Dynamic IP routing",
            "Static IP address rules for encryption",
            "Support for BGP routing",
            "Coexistence with ExpressRoute"
        ],
        "correct": 1,
        "explanation": "<b>Static IP address rules for encryption</b>. Policy-based VPNs evaluate packets against predefined IP rules for tunnel selection."
    },
    {
        "text": "What configuration is recommended to improve the availability of a VPN gateway?",
        "options": [
            "Deploy as an active/active configuration",
            "Use Basic public IP addresses",
            "Limit connections to one virtual network",
            "Disable BGP routing protocol"
        ],
        "correct": 0,
        "explanation": "<b>Deploy as an active/active configuration</b>. Active/active setups with BGP routing improve availability and fault tolerance by using multiple public IP addresses."
    },
    {
        "text": "Which Azure service can optimize public connectivity to Microsoft SaaS services?",
        "options": [
            "Azure VNet Peering",
            "Azure Peering Service",
            "Azure Load Balancer",
            "Azure Application Gateway"
        ],
        "correct": 1,
        "explanation": "<b>Azure Peering Service</b>. It enhances public routing to services like Microsoft 365 and Dynamics 365 via optimized ISP connections."
    },
    {
        "text": "What is the primary purpose of a VPN?",
        "options": [
            "To improve internet speed",
            "To connect trusted private networks securely over an untrusted network",
            "To host websites",
            "To manage virtual machines"
        ],
        "correct": 1,
        "explanation": "<b>To connect trusted private networks securely over an untrusted network</b>. VPNs use encrypted tunnels to enable secure communication between trusted networks."
    },
    {
        "text": "What is a VPN gateway in Azure?",
        "options": [
            "A service for managing Azure subscriptions",
            "A type of virtual network gateway enabling secure connectivity",
            "A tool for encrypting storage accounts",
            "A feature for deploying virtual machines"
        ],
        "correct": 1,
        "explanation": "<b>A type of virtual network gateway enabling secure connectivity</b>. Azure VPN Gateways connect virtual networks to on-premises datacenters or other virtual networks."
    },
    {
        "text": "What type of VPN gateway is preferred for high-resiliency scenarios?",
        "options": [
            "Policy-based VPN",
            "Route-based VPN",
            "Active/Standby VPN",
            "ExpressRoute"
        ],
        "correct": 1,
        "explanation": "<b>Route-based VPN</b>. This type supports IP routing and is more flexible and resilient to topology changes, making it ideal for high-resiliency scenarios."
    },
    {
        "text": "What is the maximum number of VPN gateways that can be deployed in an Azure virtual network?",
        "options": [
            "One",
            "Two",
            "Unlimited",
            "Ten"
        ],
        "correct": 0,
        "explanation": "<b>One</b>. Azure allows only one VPN gateway per virtual network, but it can connect to multiple locations."
    },
    {
        "text": "Which connectivity option is NOT supported by Azure VPN Gateways?",
        "options": [
            "Site-to-site connections",
            "Point-to-site connections",
            "Virtual network-to-network connections",
            "Direct connection to ExpressRoute"
        ],
        "correct": 3,
        "explanation": "<b>Direct connection to ExpressRoute</b>. Azure VPN Gateways do not directly connect to ExpressRoute; a separate configuration is required for such integration."
    },
    {
        "text": "What defines the behavior of a policy-based VPN?",
        "options": [
            "Dynamic IP routing",
            "Static IP address rules for encryption",
            "Support for BGP routing",
            "Coexistence with ExpressRoute"
        ],
        "correct": 1,
        "explanation": "<b>Static IP address rules for encryption</b>. Policy-based VPNs evaluate packets against predefined IP rules for tunnel selection."
    },
    {
        "text": "What configuration is recommended to improve the availability of a VPN gateway?",
        "options": [
            "Deploy as an active/active configuration",
            "Use Basic public IP addresses",
            "Limit connections to one virtual network",
            "Disable BGP routing protocol"
        ],
        "correct": 0,
        "explanation": "<b>Deploy as an active/active configuration</b>. Active/active setups with BGP routing improve availability and fault tolerance by using multiple public IP addresses."
    },
    {
        "text": "What is the purpose of a zone-redundant gateway in Azure?",
        "options": [
            "To ensure seamless integration with policy-based VPNs",
            "To enhance resiliency by deploying in different availability zones",
            "To minimize costs for VPN connectivity",
            "To increase traffic throughput by removing encryption"
        ],
        "correct": 1,
        "explanation": "<b>To enhance resiliency by deploying in different availability zones</b>. Zone-redundant gateways improve reliability and protect against zone-level failures."
    },
    {
        "text": "What is the primary purpose of Microsoft Defender for Cloud?",
        "options": [
            "Cloud storage management",
            "Security posture management and threat protection",
            "Network optimization",
            "Data replication"
        ],
        "correct": 1,
        "explanation": "<b>Microsoft Defender for Cloud</b> is designed to manage security posture and provide threat protection across various environments."
    },
    {
        "text": "Which environments can Microsoft Defender for Cloud monitor?",
        "options": [
            "Azure only",
            "On-premises only",
            "Azure, on-premises, hybrid, and multicloud environments",
            "Multicloud only"
        ],
        "correct": 2,
        "explanation": "Microsoft Defender for Cloud monitors <b>Azure, on-premises, hybrid, and multicloud environments</b> to ensure comprehensive security."
    },
    {
        "text": "What feature does Defender for Cloud use to assess security for AWS resources without agents?",
        "options": [
            "Just-in-time VM access",
            "Fusion kill-chain analysis",
            "Cloud Security Posture Management (CSPM)",
            "Azure Arc"
        ],
        "correct": 2,
        "explanation": "<b>Cloud Security Posture Management (CSPM)</b> is an agentless feature that assesses AWS resources for security and compliance."
    },
    {
        "text": "What tool does Microsoft Defender for Cloud use to extend its capabilities to non-Azure machines?",
        "options": [
            "Azure Arc",
            "Microsoft Defender for Endpoint",
            "Log Analytics agent",
            "Azure Security Benchmark"
        ],
        "correct": 0,
        "explanation": "<b>Azure Arc</b> is used to extend Defender for Cloud capabilities to hybrid and multicloud environments."
    },
    {
        "text": "Which feature in Defender for Cloud reduces exposure to brute force attacks?",
        "options": [
            "Adaptive application controls",
            "Just-in-time VM access",
            "Secure score",
            "Fusion kill-chain analysis"
        ],
        "correct": 1,
        "explanation": "<b>Just-in-time VM access</b> limits unnecessary access to virtual machine ports, reducing exposure to brute force attacks."
    },
    {
        "text": "What does Defender for Cloud's secure score represent?",
        "options": [
            "System performance",
            "Cost optimization",
            "Security posture",
            "Compliance level"
        ],
        "correct": 2,
        "explanation": "<b>Secure score</b> provides an at-a-glance indicator of the health of your security posture."
    },
    {
        "text": "What is one benefit of the Azure Security Benchmark integrated into Defender for Cloud?",
        "options": [
            "Database replication",
            "Guidelines for security and compliance best practices",
            "Log analytics deployment",
            "Dynamic workload scaling"
        ],
        "correct": 1,
        "explanation": "<b>Azure Security Benchmark</b> provides guidelines for security and compliance best practices across your resources."
    },
    {
        "text": "Which feature helps correlate security alerts based on cyber kill-chain analysis?",
        "options": [
            "Advanced threat protection",
            "Fusion kill-chain analysis",
            "Adaptive application controls",
            "Security controls"
        ],
        "correct": 1,
        "explanation": "<b>Fusion kill-chain analysis</b> automatically correlates alerts to understand the impact of attack campaigns."
    },
    {
        "text": "What is Microsoft Entra ID primarily used for?",
        "options": [
            "Network management",
            "Cloud application identity and access management",
            "Database management",
            "File storage"
        ],
        "correct": 1,
        "explanation": "<b>Microsoft Entra ID</b> is a directory service focused on identity and access management for Microsoft cloud applications and services."
    },
    {
        "text": "Which feature of Microsoft Entra ID allows users to access multiple applications with one set of credentials?",
        "options": [
            "Multifactor authentication",
            "Single sign-on (SSO)",
            "Application Proxy",
            "Device registration"
        ],
        "correct": 1,
        "explanation": "<b>Single sign-on (SSO)</b> simplifies access by enabling users to use a single username and password for multiple applications."
    },
    {
        "text": "How does Microsoft Entra ID help secure on-premises Active Directory?",
        "options": [
            "By providing real-time database synchronization",
            "By detecting suspicious sign-in attempts",
            "By managing hardware resources",
            "By automating password resets"
        ],
        "correct": 1,
        "explanation": "When connected with on-premises Active Directory, <b>Microsoft Entra ID</b> detects suspicious sign-ins from unexpected locations or devices at no additional cost."
    },
    {
        "text": "What service can be used to synchronize user identities between on-premises AD and Microsoft Entra ID?",
        "options": [
            "Microsoft Entra Domain Services",
            "Microsoft Entra Connect",
            "Microsoft Intune",
            "Application Proxy"
        ],
        "correct": 1,
        "explanation": "<b>Microsoft Entra Connect</b> synchronizes user identities between on-premises Active Directory and Microsoft Entra ID, allowing for a unified identity experience."
    },
    {
        "text": "What does Microsoft Entra Domain Services provide?",
        "options": [
            "Domain join and group policy without managing domain controllers",
            "Identity management for on-premises databases",
            "A platform for building and deploying applications",
            "Advanced analytics for Azure services"
        ],
        "correct": 0,
        "explanation": "<b>Microsoft Entra Domain Services</b> offers domain join, group policy, and other directory services without the need to manage or update domain controllers in the cloud."
    },
    {
        "text": "What is the basic building block of Azure?",
        "options": [
            "Management groups",
            "Resources",
            "Subscriptions",
            "Resource groups"
        ],
        "correct": 1,
        "explanation": "<b>Resources</b> are the fundamental building blocks of Azure, representing anything you create, provision, or deploy."
    },
    {
        "text": "How are resources grouped together in Azure for management purposes?",
        "options": [
            "Using subscriptions",
            "Using management groups",
            "Using resource groups",
            "Using regions"
        ],
        "correct": 2,
        "explanation": "<b>Resource groups</b> allow related resources to be grouped together for streamlined management and action application."
    },
    {
        "text": "Why can’t resource groups be nested in Azure?",
        "options": [
            "Resource groups are not hierarchical",
            "Resources can belong to multiple groups",
            "Azure does not support nesting",
            "Resource nesting increases complexity"
        ],
        "correct": 0,
        "explanation": "<b>Resource groups are not hierarchical</b>, meaning they cannot contain other resource groups within them."
    },
    {
        "text": "What happens to resources when a resource group is deleted in Azure?",
        "options": [
            "Resources are moved to another group",
            "Resources are deleted",
            "Resources become inactive",
            "Resources are detached"
        ],
        "correct": 1,
        "explanation": "<b>Resources are deleted</b> when their resource group is deleted, ensuring unified action for all grouped resources."
    },
    {
        "text": "What is the purpose of an Azure subscription?",
        "options": [
            "To group resources logically",
            "To provide access and billing units",
            "To connect to virtual networks",
            "To scale applications"
        ],
        "correct": 1,
        "explanation": "<b>Subscriptions</b> provide authenticated access to Azure products and services, facilitate billing, and define management boundaries."
    },
    {
        "text": "What are the two types of boundaries defined by Azure subscriptions?",
        "options": [
            "Access control and resource grouping",
            "Billing and access control",
            "Resource scaling and billing",
            "Data replication and compliance"
        ],
        "correct": 1,
        "explanation": "<b>Billing boundaries</b> determine invoicing, while <b>access control boundaries</b> apply policies at the subscription level."
    },
    {
        "text": "How can creating additional subscriptions help with resource or billing management in Azure?",
        "options": [
            "By grouping resources by region",
            "By isolating data for compliance",
            "By providing cost tracking and access control",
            "By scaling resources efficiently"
        ],
        "correct": 2,
        "explanation": "<b>Creating additional subscriptions</b> allows better cost tracking, resource separation, and access control for organizational needs."
    },
    {
        "text": "What is the purpose of Azure management groups?",
        "options": [
            "To manage resource groups",
            "To organize subscriptions for governance",
            "To control billing across regions",
            "To deploy applications globally"
        ],
        "correct": 1,
        "explanation": "<b>Management groups</b> provide governance and policy enforcement for multiple subscriptions at an enterprise scale."
    },
    {
        "text": "How do management groups enforce policies across multiple subscriptions in Azure?",
        "options": [
            "By assigning Azure RBAC roles",
            "By deploying resources automatically",
            "By isolating subscriptions geographically",
            "By defining pricing tiers"
        ],
        "correct": 0,
        "explanation": "<b>Azure RBAC assignments</b> at the management group level apply permissions to all subscriptions and resources within it."
    },
    {
        "text": "What is the maximum depth supported in a management group tree within a single directory?",
        "options": [
            "Three levels",
            "Four levels",
            "Six levels",
            "Ten levels"
        ],
        "correct": 2,
        "explanation": "<b>A management group tree</b> can support up to six levels of depth, excluding the root and subscription levels."
    },
    {
        "text": "What is the purpose of Azure's physical infrastructure?",
        "options": [
            "To store resources locally",
            "To create an isolated global network",
            "To enable cloud-based services",
            "To manage individual servers"
        ],
        "correct": 2,
        "explanation": "<b>To enable cloud-based services</b> is the purpose of Azure's physical infrastructure, comprising datacenters grouped into regions and availability zones."
    },
    {
        "text": "How are Azure datacenters grouped to ensure resiliency and reliability?",
        "options": [
            "By continents",
            "Into regions and availability zones",
            "By data types",
            "Into isolated networks"
        ],
        "correct": 1,
        "explanation": "<b>Azure datacenters are grouped into regions and availability zones</b> to ensure resiliency and reliability for business-critical workloads."
    },
    {
        "text": "What defines an Azure region, and why is it important to select a region when deploying resources?",
        "options": [
            "A datacenter with no network latency",
            "A geographical area with networked datacenters",
            "A backup system for global services",
            "An isolated facility for data storage"
        ],
        "correct": 1,
        "explanation": "<b>An Azure region is a geographical area with networked datacenters</b> to ensure balanced workloads. Selecting a region is essential for deploying resources with optimal performance."
    },
    {
        "text": "What are availability zones, and how do they contribute to high availability?",
        "options": [
            "Regions with faster networks",
            "Physically separate datacenters in a region",
            "Redundant services across regions",
            "Isolated sovereign regions"
        ],
        "correct": 1,
        "explanation": "<b>Availability zones are physically separate datacenters within a region</b>, ensuring high availability through independent power, cooling, and networking."
    },
    {
        "text": "How many availability zones are present in availability zone-enabled Azure regions?",
        "options": [
            "Two zones",
            "Three zones",
            "Four zones",
            "Five zones"
        ],
        "correct": 1,
        "explanation": "<b>Three separate availability zones</b> are present in all availability zone-enabled Azure regions to ensure resiliency."
    },
    {
        "text": "What types of Azure services support availability zones?",
        "options": [
            "Networking services only",
            "All Azure services",
            "VMs, managed disks, SQL databases",
            "Backup and recovery services only"
        ],
        "correct": 2,
        "explanation": "<b>VMs, managed disks, SQL databases, and similar services</b> support availability zones to enhance application resiliency."
    },
    {
        "text": "What is a region pair in Azure, and how does it enhance disaster recovery?",
        "options": [
            "Two nearby regions with shared resources",
            "Two regions in separate geographies",
            "Two regions connected for replication and failover",
            "Two zones within a region"
        ],
        "correct": 2,
        "explanation": "<b>A region pair consists of two regions connected for replication and failover</b>, enhancing disaster recovery by minimizing service disruptions."
    },
    {
        "text": "Why are some region pairs prioritized during extensive Azure outages?",
        "options": [
            "To reduce latency",
            "To restore services faster in one region",
            "To isolate unaffected regions",
            "To increase data redundancy"
        ],
        "correct": 1,
        "explanation": "<b>One region in a pair is prioritized during extensive outages</b> to restore services faster and minimize risks to applications hosted there."
    },
    {
        "text": "What are sovereign regions in Azure, and what are their unique characteristics?",
        "options": [
            "Global regions with backup systems",
            "Regions operated independently for compliance",
            "Regions with faster services",
            "Regions isolated for disaster recovery"
        ],
        "correct": 1,
        "explanation": "<b>Sovereign regions are operated independently for compliance</b>, providing isolated Azure instances for legal and security needs."
    },
    {
        "text": "How do region pairs support compliance and legal requirements for data residency?",
        "options": [
            "By isolating data globally",
            "By storing data outside the pair's geography",
            "By ensuring data resides within the same geography",
            "By increasing data redundancy"
        ],
        "correct": 2,
        "explanation": "<b>Region pairs ensure data resides within the same geography</b> to support compliance and legal requirements, except for Brazil South."
    },
    {
        "text": "Which authentication method in Azure allows users to sign in once and access multiple applications without needing to re-enter credentials?",
        "options": [
            "Single sign-on (SSO)",
            "Multifactor authentication (MFA)",
            "Passwordless authentication"
        ],
        "correct": 0,
        "explanation": "<b>Single sign-on (SSO)</b> simplifies authentication by allowing users to log in once and access multiple applications without repeated authentication prompts."
    },
    {
        "text": "Which Azure authentication method enhances security by requiring users to verify their identity using two or more factors?",
        "options": [
            "Single sign-on (SSO)",
            "Multifactor authentication (MFA)",
            "Passwordless authentication"
        ],
        "correct": 1,
        "explanation": "<b>Multifactor authentication (MFA)</b> improves security by requiring additional verification beyond just a password, such as a mobile device code or biometric authentication."
    },
    {
        "text": "Which authentication method eliminates the need for passwords by using alternative verification methods like biometrics or security keys?",
        "options": [
            "Single sign-on (SSO)",
            "Multifactor authentication (MFA)",
            "Passwordless authentication"
        ],
        "correct": 2,
        "explanation": "<b>Passwordless authentication</b> removes passwords entirely and relies on more secure verification techniques such as fingerprint scanning or authentication apps."
    },
    {
        "text": "Which of the following Azure identity services enables users to securely sign in using single sign-on (SSO), multifactor authentication (MFA), and passwordless authentication?",
        "options": [
            "Microsoft Entra ID",
            "Microsoft Entra Domain Services",
            "Azure Role-Based Access Control (RBAC)"
        ],
        "correct": 0,
        "explanation": "<b>Microsoft Entra ID</b>. Microsoft Entra ID (formerly Azure Active Directory) is a cloud-based identity and access management service that supports secure sign-in through various authentication methods."
    },
    {
        "text": "Your organization needs managed domain services, including LDAP, Kerberos authentication, and group policy support, without maintaining domain controllers. Which Azure identity solution best meets this requirement?",
        "options": [
            "Microsoft Entra ID",
            "Microsoft Entra Domain Services",
            "Azure Active Directory B2C"
        ],
        "correct": 1,
        "explanation": "<b>Microsoft Entra Domain Services</b>. This service provides managed domain services for Azure-based workloads that require traditional domain authentication."
    },
    {
        "text": "Which Azure security principle emphasizes strict identity verification and least privilege access for all users and devices, regardless of location?",
        "options": [
            "Zero Trust",
            "Defense In Depth",
            "Role-Based Access Control (RBAC)"
        ],
        "correct": 0,
        "explanation": "<b>Zero Trust</b>. The Zero Trust model requires continuous identity verification and least privilege access to enhance security across all environments."
    },
    {
        "text": "Which Azure identity service allows external users, such as partners and contractors, to securely access resources while maintaining security policies?",
        "options": [
            "Azure Role-Based Access Control (RBAC)",
            "Microsoft Entra Conditional Access",
            "Microsoft Entra ID External Identities"
        ],
        "correct": 2,
        "explanation": "<b>Microsoft Entra ID External Identities</b>. This service enables organizations to securely manage access for external users while enforcing authentication policies."
    },
    {
        "text": "Which Azure service provides a unified migration platform for assessing and migrating on-premises servers, databases, and applications?",
        "options": [
            "Azure Data Box",
            "Azure Migrate",
            "Azure Backup",
            "Azure Site Recovery"
        ],
        "correct": 1,
        "explanation": "<b>Azure Migrate</b>. Azure Migrate offers a centralized hub for planning and executing cloud migrations."
    },
    {
        "text": "Which tool enables the migration of VMware VMs, Hyper-V VMs, physical servers, and public cloud VMs to Azure?",
        "options": [
            "Azure Database Migration Service",
            "Azure Migrate: Server Migration",
            "Azure App Service Migration Assistant",
            "Azure Storage Explorer"
        ],
        "correct": 1,
        "explanation": "<b>Azure Migrate: Server Migration</b>. This tool facilitates the migration of virtualized and physical servers to Azure."
    },
    {
        "text": "Which Azure migration tool helps assess SQL Server databases and identify potential compatibility issues before migration?",
        "options": [
            "Azure Database Migration Service",
            "Data Migration Assistant",
            "Azure App Service Migration Assistant",
            "Azure Storage Explorer"
        ],
        "correct": 1,
        "explanation": "<b>Data Migration Assistant</b>. It evaluates SQL Server databases to highlight migration blockers and enhancements."
    },
    {
        "text": "Which Azure service is best suited for transferring large volumes of offline data using physical storage devices?",
        "options": [
            "Azure Data Box",
            "Azure Migrate",
            "Azure File Sync",
            "Azure Backup"
        ],
        "correct": 0,
        "explanation": "<b>Azure Data Box</b>. It allows secure offline bulk data transfers using proprietary storage devices."
    },
    {
        "text": "What is the primary use of Azure Database Migration Service?",
        "options": [
            "Migrate websites to Azure App Service",
            "Migrate on-premises databases to Azure SQL solutions",
            "Perform disaster recovery for Azure workloads",
            "Synchronize on-premises file shares with Azure Storage"
        ],
        "correct": 1,
        "explanation": "<b>Azure Database Migration Service</b>. This tool helps transition on-premises databases to Azure SQL offerings like SQL Managed Instances."
    },
    {
        "text": "Which migration tool is designed to help assess and move on-premises websites to Azure App Service?",
        "options": [
            "Azure Data Box",
            "Azure Migrate",
            "Azure App Service Migration Assistant",
            "Azure Blob Storage"
        ],
        "correct": 2,
        "explanation": "<b>Azure App Service Migration Assistant</b>. It assists in migrating .NET and PHP web applications to Azure App Service."
    },
    {
        "text": "Which Azure migration method is best for incremental data transfers after an initial bulk migration?",
        "options": [
            "Azure Migrate",
            "Azure Data Box",
            "Azure Database Migration Service",
            "Azure File Sync"
        ],
        "correct": 3,
        "explanation": "<b>Azure File Sync</b>. It enables seamless synchronization between on-premises file shares and Azure."
    },
    {
        "text": "What happens to data on an Azure Data Box device after the migration is complete?",
        "options": [
            "Data is archived for future use",
            "Data remains accessible for 30 days",
            "Data is wiped according to NIST 800-88r1 standards",
            "Data is automatically transferred to Azure Blob Storage"
        ],
        "correct": 2,
        "explanation": "<b>Data is wiped according to NIST 800-88r1 standards</b>. Microsoft ensures secure erasure of data after migration completion."
    },
    {
        "text": "Which Azure storage redundancy option replicates data across multiple availability zones within a single region?",
        "options": [
            "Locally redundant storage (LRS)",
            "Geo-redundant storage (GRS)",
            "Zone-redundant storage (ZRS)",
            "Read-access geo-redundant storage (RA-GRS)"
        ],
        "correct": 2,
        "explanation": "<b>Zone-redundant storage (ZRS)</b>. ZRS replicates data across multiple availability zones within a single Azure region, ensuring resiliency against data center failures."
    },
    {
        "text": "Which Azure storage account type supports Blob Storage, Queue Storage, Table Storage, and Azure Files?",
        "options": [
            "Premium block blobs",
            "Standard general-purpose v2",
            "Premium file shares",
            "Premium page blobs"
        ],
        "correct": 1,
        "explanation": "<b>Standard general-purpose v2</b>. This storage account type supports blobs, file shares, queues, and tables, making it the recommended option for most Azure Storage scenarios."
    },
    {
        "text": "What is the primary benefit of Read-Access Geo-Redundant Storage (RA-GRS)?",
        "options": [
            "It provides lower storage costs",
            "It allows read access to the secondary region",
            "It improves write performance",
            "It eliminates the need for backups"
        ],
        "correct": 1,
        "explanation": "<b>It allows read access to the secondary region</b>. RA-GRS enables applications to read data from the secondary region, improving availability during primary region failures."
    },
    {
        "text": "Which Azure storage service provides a unique namespace for your data that is accessible over HTTP or HTTPS?",
        "options": [
            "Azure Blob Storage",
            "Azure Queue Storage",
            "Azure Table Storage",
            "Azure Storage Account"
        ],
        "correct": 3,
        "explanation": "<b>Azure Storage Account</b>. A storage account provides a globally unique namespace for Azure Storage data, ensuring secure, highly available, and scalable access."
    },
    {
        "text": "Which Azure storage service is optimized for storing large amounts of unstructured data, such as images and videos?",
        "options": [
            "Azure Files",
            "Azure Blob Storage",
            "Azure Table Storage",
            "Azure Queue Storage"
        ],
        "correct": 1,
        "explanation": "<b>Azure Blob Storage</b>. Blob Storage is designed for storing massive amounts of unstructured data, including documents, images, videos, and backups."
    },
    {
        "text": "What is the correct endpoint format for accessing Azure Blob Storage?",
        "options": [
            "https://<storage-account-name>.blob.core.windows.net",
            "https://<storage-account-name>.queue.core.windows.net",
            "https://<storage-account-name>.file.core.windows.net",
            "https://<storage-account-name>.table.core.windows.net"
        ],
        "correct": 0,
        "explanation": "<b>https://<storage-account-name>.blob.core.windows.net</b>. This is the standard endpoint format for accessing Azure Blob Storage."
    },
    {
        "text": "Which Azure Virtual Machine feature staggers updates across VMs based on their update domain and fault domain?",
        "options": [
            "Availability sets",
            "Scale sets",
            "Update sets"
        ],
        "correct": 0,
        "explanation": "<b>Availability sets</b>. Availability sets ensure high availability of Azure Virtual Machines by distributing instances across multiple update domains and fault domains, minimizing downtime during maintenance or outages."
    },
    {
        "text": "Which Azure service allows users to use a cloud-hosted version of Windows from any location and connect from most modern browsers?",
        "options": [
            "Azure Virtual Desktop",
            "Azure Virtual Machines",
            "Azure Container Instances"
        ],
        "correct": 0,
        "explanation": "<b>Azure Virtual Desktop</b>. Azure Virtual Desktop provides a cloud-hosted Windows environment that users can access remotely from anywhere using modern web browsers."
    },
    {
        "text": "If you need connections between virtual networks, point-to-site connections, multisite connections, or coexistence with an Azure ExpressRoute gateway, which type of VPN gateway should you use?",
        "options": [
            "Policy-based VPN gateway",
            "Point-based VPN gateway",
            "Route-based VPN gateway"
        ],
        "correct": 2,
        "explanation": "<b>Route-based VPN gateway</b>. Route-based VPN gateways use dynamic routing protocols to support connections between virtual networks, point-to-site VPNs, multisite connections, and coexistence with ExpressRoute."
    },
    {
        "text": "What is Azure DNS used for?",
        "options": [
            "Buying domain names",
            "Hosting and managing DNS domains",
            "Providing internet access",
            "Encrypting network traffic"
        ],
        "correct": 1,
        "explanation": "<b>Hosting and managing DNS domains</b>. Azure DNS is a service for hosting DNS domains and managing DNS records using Microsoft Azure infrastructure. It does not sell domain names."
    },
    {
        "text": "How does Azure DNS ensure high availability and performance?",
        "options": [
            "By using dedicated physical servers",
            "By relying on external DNS providers",
            "By using anycast networking",
            "By caching responses locally"
        ],
        "correct": 2,
        "explanation": "<b>By using anycast networking</b>. Azure DNS ensures high availability and fast performance by routing DNS queries to the closest available DNS server."
    },
    {
        "text": "Which security feature does Azure DNS provide?",
        "options": [
            "DNS encryption",
            "Role-based access control (RBAC)",
            "Built-in firewall",
            "Blockchain-based domain verification"
        ],
        "correct": 1,
        "explanation": "<b>Role-based access control (RBAC)</b>. Azure DNS is integrated with Azure Resource Manager, which provides RBAC for controlling access to DNS management."
    },
    {
        "text": "Can Azure DNS be used to manage private domains?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. Azure DNS supports private DNS domains, allowing custom domain names within private virtual networks."
    },
    {
        "text": "What happens to alias records in Azure DNS when an underlying resource's IP address changes?",
        "options": [
            "The record must be manually updated",
            "Azure DNS automatically updates the alias record",
            "The resource becomes unavailable",
            "The domain must be re-registered"
        ],
        "correct": 1,
        "explanation": "<b>Azure DNS automatically updates the alias record</b>. Alias records dynamically reference Azure resources, updating automatically when the underlying IP changes."
    },
    {
        "text": "Are availability zones used to replicate data and applications to multiple regions?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Availability zones are used to replicate data and applications within a single region across multiple zones (datacenters). For replication across multiple regions, you would use features like Azure Geo-Replication or Recovery Services."
    },
    {
        "text": "Can only virtual machines that run Windows Server be created in availability zones?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Availability zones are not limited to virtual machines running Windows Server. They support virtual machines running both Windows and Linux operating systems, as well as other Azure resources like databases and containers."
    },
    {
        "text": "Can availability zones be implemented in all Azure regions?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Availability zones are not available in all Azure regions. They are only offered in regions that support high availability and redundancy, such as regions with multiple physically separated datacenters."
    },
    {
        "text": "Does an Azure resource group contain multiple Azure subscriptions?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. An Azure resource group is tied to a single subscription. However, resources within different resource groups can belong to the same subscription."
    },
    {
        "text": "Can each Azure subscription be managed by using a Microsoft account only?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. We have two possibilities not only one! Azure subscriptions can be managed using either a <b>Microsoft account</b> or an <b>Azure Active Directory (AAD) account</b>, depending on the setup and requirements."
    },
    {
        "text": "Can each Azure subscription contain multiple account administrators? ",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>In the context of Azure subscriptions, there is <b>only one Account Administrator per subscription</b>, as this is a classic role tied to billing and subscription management.\n\nHowever, through Azure Role-Based Access Control (RBAC), multiple users can be assigned administrative roles, such as <pre><code>Owner</pre></code>, which grants full access to manage resources. So, if the question was asking specifically about Account Administrators (classic role), the correct answer would be <pre><code>No</pre></code>. But if it's asking about administrative access in general, Azure allows multiple <pre><code>Owners</pre></code> or other roles with similar privileges, which is why I initially said <b>Yes</b>."
    },
    {
        "text": "You attempt to create several managed Microsoft SQL Server instances in an Azure environment and receive a message that you must increase your Azure subscription limits.\n\nWhat should you do to increase the limits?",
        "options": [
            "Create a service health alert",
            "Upgrade your support plan",
            "Modify an Azure policy",
            "Create a new support request"
        ],
        "correct": 3,
        "explanation": "The correct answer is <b>Create a new support request</b>.\n\nTo increase Azure subscription limits, you need to submit a support request through the Azure portal. Specifically, you would select the <b>Service and subscription limits (quotas)</b> issue type and provide details about the quota increase you require.\n\n<b>Upgrade your support plan is not the correct choice</b> because upgrading your support plan in Azure primarily provides access to additional support features, faster response times, or advanced technical guidance. However, it does not directly affect or increase your subscription limits, such as quotas for resources like managed SQL Server instances."
    },
    {
        "text": "You have an Azure environment that contains multiple Azure virtual machines.\nYou plan to implement a solution that enables the client computers on your on-premises network to communicate to the Azure virtual machines.\nYou need to recommend which Azure resources must be created for the planned solution.\nWhich two Azure resources should you include in the recommendation? Each correct answer presents part of the solution.",
        "options": [
            "a virtual network gateway, a load balancer",
            "an application gateway, a virtual network",
            "a virtual network gateway, a gateway subnet",
            "a load balancer, an application gateway"
        ],
        "correct": 2,
        "explanation": "The correct answers are:\n\n1. <b>A virtual network gateway</b>: This is required to establish a secure connection between your on-premises network and the Azure virtual network, typically using a VPN or ExpressRoute.\n\n2. <b>A gateway subnet</b>: This is a dedicated subnet within the Azure virtual network where the virtual network gateway is deployed. It is essential for enabling communication between the on-premises network and Azure resources.\n\nThese two resources together enable client computers on your on-premises network to communicate with Azure virtual machines securely. Let me know if you'd like further details on setting this up!"
    },
    {
        "text": "Can IaaS and PaaS be moved from one resource group to another one ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, IaaS (Infrastructure as a Service) and PaaS (Platform as a Service) resources can generally be moved from one resource group to another within the same subscription or even across subscriptions, provided certain conditions are met. For example, Azure allows you to move resources like virtual machines, storage accounts, and databases between resource groups using the Azure portal, CLI, or PowerShell.\n\nPlease note, <b>SaaS (Software as a Service)</b> offerings, such as Office 365 or Dynamics 365, are typically not tied to resource groups in the same way as IaaS or PaaS resources. <b>SaaS applications are managed differently and are not directly associated with Azure resource groups</b>, so moving them between resource groups is not applicable."
    },
    {
        "text": "Generally, can IaaS, PaaS or even SaaS be moved from one resource group to another one ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, <b>SaaS (Software as a Service) offerings cannot be moved to another resource group</b> because they are not directly associated with Azure resource groups in the same way as IaaS (Infrastructure as a Service) or PaaS (Platform as a Service) resources. SaaS applications like Office 365, Dynamics 365, or Salesforce operate as managed services and exist outside the Azure Resource Manager (ARM) model that organizes resources into resource groups./n/nResource groups are used for Azure-specific resources under the IaaS and PaaS umbrellas, while SaaS operates independently. If you need to manage or organize SaaS services differently, this is typically done through account-level or subscription-level settings, not resource groups"
    },
    {
        "text": "You have several virtual machines in an Azure subscription. You create a new subscription.",
        "options": [
            "The virtual machines cannot be moved to the new subscription.",
            "The virtual machines can be moved to the new subscription.",
            "The virtual machines can be moved to the new subscription only if they are all in the same resource group.",
            "The virtual machines can be moved to the new subscription only if they run Windows Server 2016."
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>The virtual machines can be moved to the new subscription</b>.\n\nVirtual machines in Azure can be moved between subscriptions, provided that both subscriptions are associated with the same Azure Active Directory (AAD) tenant. This enables resource reorganization or migration across different subscriptions as needed."
    },
    {
        "text": "Can a company use resources from multiple subscriptions?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, a company can use resources from multiple subscriptions. Azure supports scenarios where resources are spread across different subscriptions, allowing organizations to manage diverse workloads and environments efficiently."
    },
    {
        "text": "Can two Azure subscriptions be merged into a single subscription?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, two Azure subscriptions cannot be merged into a single subscription. However, resources can be transferred between subscriptions if needed."
    },
    {
        "text": "Can a single Microsoft account be used to manage multiple Azure subscriptions?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, a single Microsoft account can be used to manage multiple Azure subscriptions. This enables users or administrators to handle resources and configurations across multiple subscriptions from a single account."
    },
    {
        "text": "The company has several departments. All the Azure resources used by each department will be managed by a department administrator. What are two possible techniques to segment Azure for the departments?",
        "options": [
            "multiple subscriptions & multiple Azure Active Directory (Azure AD) directories",
            "multiple Azure Active Directory (Azure AD) directories & multiple resource groups",
            "multiple regions & multiple subscriptions",
            "multiple resource groups & multiple subscriptions"
        ],
        "correct": 3,
        "explanation": "The two <possible techniques to segment Azure for the departments are:\n\n1/ <b>Multiple subscriptions</b>: Each department can have its own Azure subscription, providing separate billing and resource management boundaries. This allows each department administrator to manage resources independently.\n\n2/ <b>Multiple resource groups</b>: Resources for each department can be grouped into separate resource groups within the same subscription. Resource groups make it easier to organize, monitor, and manage resources based on department-specific needs.\n\nThese techniques provide flexibility and administrative separation while maintaining efficient management of Azure resources. Let me know if you'd like more guidance on implementing these approaches!"
    },
    {
        "text": "Autoscaling is an example of ",
        "options": [
            "agility",
            "elasticity",
            "geo-distribution",
            "predictability"
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>elasticity</b>.\n\nAutoscaling exemplifies this concept, as it enables systems to automatically adjust resources—scaling up or down—to meet changing workload demands dynamically."
    },
    {
        "text": "Which advantage of cloud computing supports deploying applications to multiple regions around the globe?",
        "options": [
            "Agility",
            "Scalability",
            "Geo-distribution"
        ],
        "correct": 2,
        "explanation": "The correct answer is <b>Geo-distribution</b>.\n\nThis advantage of cloud computing enables organizations to deploy applications across multiple regions worldwide, ensuring better availability and performance for users in different geographic locations. Let me know if you'd like further assistance!"
    },
    {
        "text": "Which feature of cloud computing enables the dynamic addition or removal of resources to handle varying workloads?",
        "options": [
            "Agility",
            "Scalability",
            "Geo-distribution"
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>Scalability</b>.\n\nThis feature of cloud computing allows resources to be added or removed dynamically to accommodate varying workloads, ensuring optimal performance and cost efficiency. Let me know if you'd like assistance with the next question!"
    },
    {
        "text": "Which benefit of cloud computing allows for rapid application development and deployment?",
        "options": [
            "Agility",
            "Scalability",
            "Geo-distribution"
        ],
        "correct": 0,
        "explanation": "The answer is <b>Agility</b>.\n\nThis benefit of cloud computing enables rapid application development and deployment, allowing organizations to adapt quickly to changing needs and innovate efficiently. Let me know if you'd like help with the other questions!"
    },
    {
        "text": "The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "The statement <pre><code>The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter</code></pre> is correct, so the answer is <b>Yes</b>."
    },
    {
        "text": "You must have internet connectivity to use cloud computing.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, we need internet connectivity to reach Azure Public Cloud.\n\n<b>IMPORTANT NOTE</b>: For the AZ-900 Microsoft Azure Fundamentals certification, you should primarily focus on understanding the public cloud model. This is because the course and exam revolve around Azure, which is primarily a public cloud platform offering scalable, on-demand resources accessible via the internet."
    },
    {
        "text": "You must have physical servers to use cloud computing.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The statement \"You must have physical servers to use cloud computing\" is incorrect. Cloud computing does not require you to have physical servers; instead, it provides access to shared resources like servers, storage, and applications hosted by cloud service providers over the internet."
    },
    {
        "text": "Review this statement \"[Resource groups] provide organizations with the ability to manage the compliance of Azure resources across multiple subscriptions.\". If this statement is correct, select `No change is needed`. If the statement is incorrect, select the answer choice that makes the statement correct.",
        "options": [
            "No change is needed",
            "Management groups",
            "Azure policies",
            "Azure App Service plans"
        ],
        "correct": 1,
        "explanation": "The correct answer is \"Management groups\". Explanation: 1/ Resource groups: These are used to organize and manage Azure resources within a single subscription, but they cannot span multiple subscriptions. 2/ Management groups: These provide the ability to manage and enforce policies, compliance, and access across multiple subscriptions in Azure. Therefore, they are the correct choice for managing compliance across subscriptions. 3/ Azure policies: These are used to define and enforce compliance rules for resources, but they work at a subscription or resource group level, not across subscriptions directly. 4/ Azure App Service plans: These are used for hosting web apps and are unrelated to compliance management."
    },
    {
        "text": "When an Azure subscriptions expires, the associated Azure Active Directory (Azure AD) tenant is deleted automatically.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, an Azure subscription's expiration does not automatically lead to the deletion of the associated Azure Active Directory (Azure AD) tenant. Explanation: Azure Subscriptions: If an Azure subscription expires, the resources within the subscription may become inaccessible, but the Azure AD tenant remains active. Azure AD Tenant: The tenant is independent of the subscription and continues to exist even without an active subscription. It remains responsible for managing identities and authentication."
    },
    {
        "text": "You can change the Azure Active Directory (Azure AD) tenant to which an Azure subscription is associated.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, you can change the Azure Active Directory (Azure AD) tenant to which an Azure subscription is associated.\n\nThis process involves transferring the subscription to a different Azure AD tenant. Here's how it works step be step:\n\n1/ Prepare the Subscription,\n\n2/ Transfer Ownership,\n\n3/ Post-Transfer Actions."
    },
    {
        "text": "An Azure subscription can be associated to multiple Azure Active Directory (Azure AD) tenants?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, an Azure subscription cannot be associated with multiple Azure Active Directory (Azure AD) tenants at the same time. An Azure subscription has a one-to-one relationship with an Azure AD tenant, meaning it is always tied to a single Azure AD tenant for identity and access management."
    },
    {
        "text": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to a scale set. Does this meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>No</b>.\n\n Explanation: Deploying virtual machines to a scale set alone does not ensure availability if a single data center fails. While scale sets provide automatic scaling and load balancing, to protect against data center failure you need to deploy the virtual machines across Availability Zones or use Availability Sets. These features are specifically designed to provide redundancy and resilience against such failures."
    },
    {
        "text": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more resource groups. Does this meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>No</b>. Explanation: Deploying virtual machines to two or more resource groups does not ensure availability in the event of a single data center failure. Resource groups are logical containers and do not provide physical redundancy. To achieve high availability, the virtual machines must be deployed across Availability Zones or Availability Sets within an Azure region. These features are designed to protect against data center failures."
    },
    {
        "text": "You plan to extend your company's network to Azure. The network contains a VPN appliance that uses an IP address of 131.107.200.1. You need to create an Azure resource that defines the VPN appliance in Azure. Which Azure resource should you create? To answer, select the appropriate resource in the answer area.",
        "options": [
            "NAT gateways",
            "Application gateways",
            "Local network gateways",
            "Virtual network gateways",
            "On-premises data gateways",
            "Azure data box gateway",
            "Azure Stack Edge / Data Box gateway",
            "Web Application Firewall policies"
        ],
        "correct": 2,
        "explanation": "The correct answer is \"Local network gateways\". Explanation: A local network gateway in Azure represents the on-premises network or VPN appliance, enabling Azure to recognize and establish connections to it. It specifies the IP address of the VPN appliance (in this case, 131.107.200.1) and allows configurations for connecting an Azure Virtual Network to your company's network."
    },
    {
        "text": "You need to identify the type of failure for which an Azure Availability Zone can be used to protect access to Azure services. What should you identify?",
        "options": [
            "a physical server failure",
            "an Azure region failure",
            "a storage failure",
            "an Azure data center failure"
        ],
        "correct": 3,
        "explanation": "The correct answer is \"an Azure data center failure\". Explanation: Azure Availability Zones are designed to protect access to Azure services by providing redundancy across physically separate data centers within the same region. This ensures that services remain operational even if a specific data center within the region experiences a failure."
    },
    {
        "text": "Which cloud computing benefit provides continuous user access to a cloud-based application with minimal downtime?",
        "options": [
            "agility",
            "scalability",
            "elasticity",
            "high availability"
        ],
        "correct": 3,
        "explanation": "The correct answer is \"high availability\". Explanation: High availability ensures that cloud-based applications remain operational and accessible with minimal downtime. This is achieved through redundant systems, failover mechanisms, and resilient infrastructure, providing a seamless experience for users."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Ensure that users always have the best experience by deploying apps to all the regions where there are users.\"",
        "options": [
            "Disaster recovery",
            "Geo-distribution",
            "High availability",
            "Scalability"
        ],
        "correct": 1,
        "explanation": "The correct answer is \"Geo-distribution\". Explanation: Geo-distribution ensures that applications and resources are deployed in multiple regions to be closer to users. This approach minimizes latency, improves performance, and delivers the best user experience by utilizing Azure's global data center network."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Provide a continous user experience with no apparent downtime.\"",
        "options": [
            "Disaster recovery",
            "Geo-distribution",
            "High availability",
            "Scalability"
        ],
        "correct": 2,
        "explanation": "The correct answer is \"High availability\". Explanation: High availability ensures that systems or services are continuously operational without noticeable downtime, even in the event of hardware or software failures. This capability is achieved through redundancy, failover mechanisms, and resilient infrastructure."
    },
    {
        "text": "Select the appropriate benefit that match the definition \"Increase the compute capacity of apps in the cloud.\"",
        "options": [
            "Disaster recovery",
            "Geo-distribution",
            "High availability",
            "Scalability"
        ],
        "correct": 3,
        "explanation": "The correct answer is \"geo-redundancy\". Explanation: Geo-redundancy in Azure ensures that resources and data are replicated across multiple geographic locations. This capability helps deploy resources closer to users, enhancing performance and reducing latency while also providing resiliency against regional outages."
    },
    {
        "text": "What Azure capability ensures that resources are deployed closer to users? ",
        "options": [
            "elasticity",
            "high availability",
            "geo-distribution",
            "scalability"
        ],
        "correct": 2,
        "explanation": "The correct answer is \"geo-redundancy\". Explanation: Geo-redundancy in Azure ensures that resources and data are replicated across multiple geographic locations. This capability helps deploy resources closer to users, enhancing performance and reducing latency while also providing resiliency against regional outages."
    },
    {
        "text": "What is a feature of an Azure virtual network?",
        "options": [
            "resource cost analysis",
            "packet inspection",
            "geo-redundancy",
            "isolation and segmentation"
        ],
        "correct": 3,
        "explanation": "The correct answer is \"isolation and segmentation\". Explanation: Azure Virtual Network (VNet) enables isolation and segmentation, which allows you to create secure and private communication environments for your resources. It provides control over IP addresses, subnets, and network traffic, ensuring that your resources are isolated from other users and networks."
    },
    {
        "text": "What are two benefits of cloud computing? ",
        "options": [
            "Enables the rapid provisioning of resources, Has the same configuration options as on-premises",
            "Enables the rapid provisioning of resources, Has increased administrative complexity",
            "Has the same configuration options as on-premises, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)",
            "Enables the rapid provisioning of resources, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)"
        ],
        "correct": 3,
        "explanation": "The correct option is \"Enables the rapid provisioning of resources, Shifts capital expenditures (CAPEX) to operating expenditures (OPEX)\".1/ Rapid provisioning of resources: Cloud computing allows for quick scaling of resources to meet changing demands efficiently. 2/ Shifts CAPEX to OPEX: With cloud computing, organizations avoid large upfront capital expenses for infrastructure and instead pay for resources as they use them, making it an operational expense."
    },
    {
        "text": "Which term represents the ability to increase the computing capacity of a virtual machine by adding memory or CPUs?",
        "options": [
            "agility",
            "vertical scaling",
            "horizontal scaling",
            "elasticity"
        ],
        "correct": 1,
        "explanation": "The correct term is vertical scaling. This represents the ability to increase the computing capacity of a virtual machine by adding resources such as memory or CPUs. Vertical scaling enhances the performance of the existing instance without adding new instances. Reference: https://learn.microsoft.com/en-us/azure/azure-monitor/autoscale/autoscale-overview."
    },
    {
        "text": "Select appropriate answer: What Azure Service supports synchronization between on-premises storage and Azure Storage?",
        "options": [
            "Azure Blob Storage",
            "Azure Files",
            "Azure Queue Storage ",
            "Azure File Sync"
        ],
        "correct": 3,
        "explanation": "The correct service is Azure File Sync, not Azure Files. Azure File Sync is specifically designed to enable synchronization between on-premises file servers and Azure Files, allowing you to centralize file storage in Azure while keeping local access to frequently used data. Azure Files, on the other hand, provides fully managed cloud file shares, but it doesn't include synchronization capabilities by itself. - Azure Blob Storage: Designed for storing large amounts of unstructured data, such as text or binary files. It's ideal for scenarios like serving images, streaming media, or creating data lakes for analytics. - Azure Files: Provides fully managed file shares in the cloud, accessible via SMB or NFS protocols. It's perfect for replacing on-premises file servers or enabling shared application settings. - Azure Queue Storage: A service for storing large numbers of messages, enabling asynchronous communication between application components. Commonly used in distributed systems. - Azure Table Storage: A NoSQL datastore for structured data, offering fast and cost-effective storage for applications that don't require complex joins or stored procedures"
    },
    {
        "text": "Which cloud computing model includes on-premises and cloud-based resources?",
        "options": [
            "Hybrid Cloud",
            "Private Cloud",
            "Public Cloud"
        ],
        "correct": 0,
        "explanation": "The correct answer is Hybrid Cloud. This cloud computing model combines on-premises infrastructure with cloud-based resources, allowing organizations to use both environments seamlessly to meet their needs."
    },
    {
        "text": "A Microsoft SQL Server database that is hosted in the cloud and has software updates managed by Azure is an example of ...",
        "options": [
            "disaster recovery as a service (DRaaS)",
            "Infrastructure as a Service (Iaas)",
            "Platform as a Service (PaaS)",
            "Software as a Service (SaaS)"
        ],
        "correct": 2,
        "explanation": "The correct answer is Platform as a Service (PaaS). This is because, in this scenario, Azure manages the software updates and underlying infrastructure for the Microsoft SQL Server database while allowing users to focus on managing and using the database itself. PaaS is designed to reduce administrative effort by handling these backend tasks."
    },
    {
        "text": "Select the answer that correctly completes the sentence. An Azure web app that queries an on-premises Microsoft SQL server is an example of a [ ... ].",
        "options": [
            "Hybrid Cloud",
            "Private Cloud",
            "Public Cloud",
            "Multi-vendor Cloud"
        ],
        "correct": 0,
        "explanation": "The correct answer is Hybrid Cloud. An Azure web app querying an on-premises Microsoft SQL server demonstrates a combination of public cloud services (Azure) and on-premises infrastructure, which is the essence of a hybrid cloud setup."
    },
    {
        "text": "Microsoft 365 is an example of which cloud service model?",
        "options": [
            "Infrastructure as a Service (Iaas)",
            "Platform as a Service (SaaS)",
            "Software as a Service (SaaS)"
        ],
        "correct": 2,
        "explanation": "The correct answer is Software as a Service (SaaS). Microsoft 365 is a SaaS model, as it provides ready-to-use software applications like Word, Excel, and Outlook that are accessed over the internet without requiring users to manage the underlying infrastructure or platform."
    },
    {
        "text": "You have an accounting application named App1 that uses a legacy database. You plan to move App1 to the cloud. Which service model should you use?",
        "options": [
            "Infrastructure as a Service (Iaas)",
            "Platform as a Service (PaaS)",
            "Software as a Service (SaaS)"
        ],
        "correct": 0,
        "explanation": "The best choice in this scenario is Infrastructure as a Service (IaaS). Since App1 uses a legacy database, migrating it to the cloud via IaaS would provide the necessary flexibility and control. With IaaS, you can replicate your on-premises setup and manage the operating system, database, and application as needed, making it ideal for legacy systems."
    },
    {
        "text": "You plan to use Azure to host application named App2. The application must meet the following requirements: App2 must run interactively with the operating system of the server.",
        "options": [
            "Infrastructure as a Service (Iaas)",
            "Platform as a Service (PaaS)",
            "Software as a Service (SaaS)"
        ],
        "correct": 0,
        "explanation": "The correct answer is Infrastructure as a Service (IaaS). Here's why: IaaS provides virtualized computing resources such as servers, storage, and networking. It enables applications like App2 to interact directly with the operating system of the server, giving you complete control over the server environment. This is ideal for scenarios requiring close integration with the OS."
    },
    {
        "text": "You plan to use Azure to host application named App1. The application must meet the following requirements: 1/ You must be able to modify the code of App1. 2/ Administrative effort to manage the operating system of App1 must be minimized.",
        "options": [
            "Infrastructure as a Service (Iaas)",
            "Platform as a Service (PaaS)",
            "Software as a Service (SaaS)"
        ],
        "correct": 1,
        "explanation": "The correct answer is Platform as a Service (PaaS). Here's why: PaaS allows you to modify and control the application code while the cloud provider manages the underlying operating system and infrastructure. This minimizes the administrative effort required to maintain the operating system. PaaS provides a framework that developers can build upon to develop or customize cloud-based applications. Similar to the way you create an Excel macro, PaaS lets developers create applications using built-in software components. Cloud features such as scalability, high-availability, and multi-tenant capability are included, reducing the amount of coding that developers must do."
    },
    {
        "text": "Select the appropriate answer that correctly completes the sentence : Azure Site recovery provides [ ... ] for virtual machines.",
        "options": [
            "high availability",
            "disaster recovery",
            "elasticity ",
            "fault tolerance"
        ],
        "correct": 1,
        "explanation": "The correct answer is disaster recovery. Azure Site Recovery is designed to ensure business continuity by replicating virtual machines, enabling organizations to recover and maintain operations during outages or disasters."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Applications can be developed, tested and launched rapidly.",
        "options": [
            "Agility",
            "Geo-distribution",
            "Scalability"
        ],
        "correct": 0,
        "explanation": "The cloud computing benefit that matches the description is Agility. This refers to the ability to quickly adapt and innovate, enabling efficient development and deployment processes."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Applications and data can be deployed to multiple regions.",
        "options": [
            "Agility",
            "Geo-distribution",
            "Scalability"
        ],
        "correct": 1,
        "explanation": "The cloud computing benefit that matches the description is <b>Geo-distribution</b>. This benefit refers to the ability to distribute resources, applications, and data across multiple geographical locations for better performance, availability, and compliance."
    },
    {
        "text": "Select the appropriate cloud computing benefits that matches the description : Resources can be provisioned dynamically to meet changing demands.",
        "options": [
            "Agility",
            "Geo-distribution",
            "Scalability"
        ],
        "correct": 2,
        "explanation": "The cloud computing benefit that matches the description is Scalability. This refers to the ability to quickly adjust resources up or down based on workload demands, ensuring efficiency and cost-effectiveness."
    },
    {
        "text": "Is this statment correct. The costs to increase cloud computing capacity are less than the costs to increase the computing capacity of an on-premises datacenter.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, the statement is generally correct. Scaling up cloud computing capacity is often more cost-effective than increasing the computing capacity of an on-premises datacenter. Here's why: 1/ Cloud Computing: Cloud providers use pay-as-you-go pricing models. You only pay for the resources you use, and scaling is immediate, without the need for upfront investments in hardware or infrastructure. - 2/ On-Premises Datacenter: Expanding capacity typically involves purchasing new hardware, upgrading infrastructure, and potentially investing in space and cooling systems, which can be costly and time-consuming."
    },
    {
        "text": "Is this statment correct. You must have internet connectivity to use cloud computing!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, you don't necessarely need internet connectivity, 2 reasons: 1/ Private Cloud and Internet Connectivity: Private clouds operate within an organization's local network, so they don't require internet access. Users can access resources directly through the internal network, ensuring data stays within the organization's infrastructure. 2/ Azure ExpressRoute: This service provides a private, dedicated connection between on-premises infrastructure and Microsoft Azure. It bypasses the public internet, offering enhanced reliability, security, and lower latency for hybrid cloud setups."
    },
    {
        "text": "Is this statment correct. You must have physical servers to use cloud computing!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, the statement \"You must have physical servers to use cloud computing\" is not entirely correct. Cloud computing involves accessing resources (like storage, applications, and processing power) hosted on remote servers via the internet or a private network. For public cloud services, users don't need their own physical servers—resources are provided by the cloud provider. However, private cloud or hybrid cloud setups may require physical servers for hosting infrastructure within the organization's premises."
    },
    {
        "text": "Your company has virtual machines (VMs) hosted in Microsoft Azure. The VMs are located in a single Azure virtual network named VNet1. The company has users that work remotely. The remote workers require access to the VMs on VNet1. You need to provide access for the remote workers. What should you do?",
        "options": [
            "Configure a Site-to-Site (S2S) VPN",
            "Configure a VNet-toVNet VPN",
            "Configure a Point-to-Site (P2S) VPN",
            "Configure DirectAccess on a Windows Server 2012 server VM",
            "Configure a Multi-Site VPN"
        ],
        "correct": 2,
        "explanation": "A Point-to-Site (P2S) VPN gateway connection lets you create a secure connection to your virtual network from an individual client computer. ... P2S VPN is also a useful solution to use instead of S2S VPN when you have only a few clients that need to connect to a VNet."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] Provides a choice to use on-premises or cloud-based resources.",
        "options": [
            "Hybrid Cloud",
            "Private Cloud",
            "Public Cloud"
        ],
        "correct": 0,
        "explanation": "The cloud model that best matches the advantage Provides a choice to use on-premises or cloud-based resources is \"Hybrid Cloud\". This model combines the flexibility of public cloud services with the control of on-premises infrastructure, allowing organizations to balance their workloads between the two as needed."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] Provides complete control over security.",
        "options": [
            "Hybrid Cloud",
            "Private Cloud",
            "Public Cloud"
        ],
        "correct": 1,
        "explanation": "The cloud model that best matches the advantage Provides complete control over security is \"Private Cloud\". This model allows organizations to have exclusive access to infrastructure, enabling them to implement and manage their own security measures according to specific needs and standards."
    },
    {
        "text": "Match the cloud model to the correct advantage: [ ... ] No required capital expenditure.",
        "options": [
            "Hybrid Cloud",
            "Private Cloud",
            "Public Cloud"
        ],
        "correct": 2,
        "explanation": "Based on the advantage No required capital expenditure, the best match among the cloud models would be \"Public Cloud\". This model operates on a pay-as-you-go system, removing the need for upfront hardware investments."
    },
    {
        "text": "You are tasked with deploying Azure virtual machines for your company and need the appropriate cloud deployment solution—you recommend using Infrastructure as a Service (IaaS); does this solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, VM's are delivered through Infrastructure as a Service (IaaS)."
    },
    {
        "text": "Your developers have created 10 web applications to host on Azure, requiring custom domains, 10 GB of storage each, dedicated compute instances, load balancing, and cost minimization—what Azure web tier plan should you use?",
        "options": [
            "Standard",
            "Basic",
            "Free",
            "Shared"
        ],
        "correct": 0,
        "explanation": "App Service Free and Shared Plans are not for production and offers only 1 GB of storage, they also do not have dedicated compute. Basic plan, even it offers 10 GB of storage do not offers load-balancing 'no traffic management' refer to https://azure.microsoft.com/en-us/pricing/details/app-service/windows/. Cheapest solution is then Standard plan. Note that each tier provides a specific subset of App Service features. These features include custom domains and TLS/SSL certificates, autoscaling, deployment slots, backups, Azure Traffic Manager integration, and more."
    },
    {
        "text": "You plan to migrate a company to Azure with each division having an administrator to manage its Azure resources and want the deployment to allow segmentation while minimizing administrative effort—you propose using several Azure Active Directory (Azure AD) directories; does this solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "You do not need 'several' AAD directories, best practice is only one, the word 'several' cause problem here! You plan to make use of several Azure Active Directory (Azure AD) directories.."
    },
    {
        "text": "Your developers created a publicly accessible portal web app for Miami branch users to retrieve customer and product information, and you plan to host it on Azure, requiring the miami.weyland.com URL, deployment to two instances, SSL support, 12 GB of storage, and minimized costs—which Azure web tier plan should you use?",
        "options": [
            "Standard",
            "Basic",
            "Free",
            "Shared"
        ],
        "correct": 0,
        "explanation": "Standard offer 50 GB, Basic 10 GB only, as costs must be optimized this is the most cost efficient solution."
    },
    {
        "text": "Your company plans to migrate virtual machines from Hyper-V hosts in a data center to an Azure pay-as-you-go subscription, requiring the correct expenditure model—you recommend using the elastic expenditure model; does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The term \"elastic expenditure model\" isn't a standard term or concept used in Azure or cloud computing. The two common expenditure models in Azure are \"pay-as-you-go\" and \"reserved instances\"."
    },
    {
        "text": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required to make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the scalable expenditure model. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Operating expenditures are ongoing costs of doing business. Consuming cloud services in a pay-as-you-go model could qualify as an operating expenditure. References : https://docs.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/business-outcomes/fiscal-outcomes."
    },
    {
        "text": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the operational expenditure model. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Operating expenditures are ongoing costs of doing business. Consuming cloud services in a pay-as-you-go model could qualify as an operating expenditure. References : https://docs.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/business-outcomes/fiscal-outcomes."
    },
    {
        "text": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Cosmos DB. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Machine Learning Studio (classic) is a drag-and-drop tool you can use to build, test, and deploy predictive analytics solutions. Azure Cosmos DB is a fully managed NoSQL database for modern app development."
    },
    {
        "text": "Your company's Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to sync all the Active Directory user accounts to Azure Active Directory (Azure AD). Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Answer is <b>Yes</b>; it is beneficial to sync your on premise AD with the AD Azure to minimize the impact on users."
    },
    {
        "text": "You have been informed by your superiors of the company's intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. The solution to encrypt credentials is Azure Key Vault. Reference https://learn.microsoft.com/en-us/azure/key-vault/. Azure Multi-Factor Authentication (MFA) is a security feature that adds an extra layer of protection to user accounts by requiring multiple forms of verification during sign-in."
    },
    {
        "text": "You have been informed by your superiors of the company's intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Information Protection. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. The solution to encrypt credentials is Azure Key Vault. Reference https://learn.microsoft.com/en-us/azure/key-vault/. Azure Information Protection (AIP) is a cloud-based solution designed to help organizations classify, label, and protect sensitive information, whether it's stored in the cloud or on-premises."
    },
    {
        "text": "Is this statment correct. A company can extend its internal network to the public cloud!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, the statement is correct! A company can extend its internal network to the public cloud through various connectivity solutions. This is typically done using secure networking methods such as: 1/ VPN (Virtual Private Network): Provides a secure connection between on-premises resources and the cloud. - 2/ Azure ExpressRoute: Offers private, high-speed connectivity directly to the Azure cloud without using the public internet. - 3/ Hybrid Cloud Integration: Allows seamless extension of resources and workloads between the internal network and public cloud infrastructure. - These solutions enable businesses to leverage the scalability and flexibility of the public cloud while maintaining connectivity with their internal network."
    },
    {
        "text": "Is this statment correct. A company can extend an internal network by adding its own physical servers to the public cloud!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, the statement is not correct. A company cannot extend its internal network by adding its own physical servers to the public cloud, as the public cloud is managed by cloud providers like Microsoft, AWS, or Google, and consists of infrastructure owned and operated by them."
    },
    {
        "text": "Is this statment correct. A private cloud must be disconnected from the Internet!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, the statement is incorrect. A private cloud does not have to be disconnected from the Internet. While private clouds are designed for exclusive use by a single organization and often emphasize security and control, they can still be connected to the Internet if needed—for example, to facilitate remote access, hybrid cloud integrations, or external communications. The level of connectivity depends on the organization's requirements and security policies."
    },
    {
        "text": "Is this statment correct. Part of a hybrid cloud is the public cloud!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, the statement is correct! A hybrid cloud is a computing environment that combines public cloud, private cloud, and sometimes on-premises infrastructure. In a hybrid cloud, the public cloud is an integral part, enabling organizations to benefit from scalability and cost-effectiveness while maintaining control over sensitive data in private cloud or on-premises systems."
    },
    {
        "text": "What is the first stage in the Microsoft Cloud Adoption Framework for Azure?",
        "options": [
            "Adopt the cloud.",
            "Make a plan.",
            "Ready your organization.",
            "Define your strategy."
        ],
        "correct": 3,
        "explanation": "The correct answer is \"Define your strategy.\" The first stage in the Microsoft Cloud Adoption Framework for Azure involves defining your strategy, where you clarify business objectives, identify motivations for cloud adoption, and establish measurable outcomes. This stage sets the foundation for a successful cloud journey."
    },
    {
        "text": "Is this statment correct. Cloud computing leverages virtualization to provide services to multiple customers simultaneously!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, the statement is correct! Cloud computing leverages virtualization to provide services to multiple customers simultaneously. Virtualization allows cloud providers to divide physical hardware into multiple virtual machines (VMs) or environments. These virtual resources can then be allocated dynamically to different customers, enabling the efficient and simultaneous use of the same underlying physical infrastructure. This approach ensures cost-effectiveness, scalability, and resource optimization."
    },
    {
        "text": "Is this statment correct. Customers can minimize capital expenditure (CapEx) by using a public cloud!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, the statement is correct! By using a public cloud, customers can minimize capital expenditure (CapEx) because they avoid the upfront costs of purchasing hardware, setting up infrastructure, and maintaining physical servers. Instead, they shift to an operational expenditure (OpEx) model, paying for resources like storage, compute, or networking only as needed."
    },
    {
        "text": "Is this statment correct. Cloud computing provides elastic scalability!",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, the statement is correct! Cloud computing does provide elastic scalability. This means that resources such as compute power, storage, and network capacity can be scaled up or down dynamically based on demand. Elastic scalability ensures that organizations pay only for the resources they use, making it cost-effective and highly efficient."
    },
    {
        "text": "Is Microsoft Intune an example of Software as a Service (SaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, Microsoft Intune is an example of Software as a Service (SaaS). It is a cloud-based service designed for mobile device and application management. As a SaaS offering, Intune allows organizations to manage their devices, ensure security compliance, and control access to corporate resources without the need for on-premises infrastructure. Microsoft handles the backend operations, and users focus on configuring policies and managing devices."
    },
    {
        "text": "Is a DNS running on an Azure virtual machine an example of Platform as a Service (PaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, a DNS running on an Azure virtual machine is an example of Infrastructure as a Service (IaaS), not Platform as a Service (PaaS). When you deploy a DNS server on an Azure VM, Azure provides the virtual machine infrastructure, but you are responsible for configuring, managing, and maintaining the DNS software and operating system. This level of control and responsibility places it in the IaaS category. If you’re looking for a PaaS solution for DNS in Azure, Azure DNS is the service to consider. It provides a managed DNS solution where Azure takes care of the infrastructure, scalability, and maintenance, leaving you to manage your DNS zones and records."
    },
    {
        "text": "Is Azure Files an example of Infrastructure as a Service (IaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Azure Files is a Platform as a Service (PaaS) that provides fully managed, cloud-based file shares accessible via standard protocols like SMB and NFS. It is serverless, supports hybrid environments (cloud and on-premises), and offers features like Azure File Sync for local caching and synchronization. Azure manages the underlying infrastructure, allowing users to focus on storing and sharing files without worrying about maintenance or scalability."
    },
    {
        "text": "What does a customer provide in a software as a service (SaaS) model?",
        "options": [
            "application data",
            "data storage",
            "compute resources",
            "application software"
        ],
        "correct": 0,
        "explanation": "The correct answer is \"application data\". In the Software as a Service (SaaS) model, the customer is responsible for providing and managing their own application data, while the SaaS provider handles everything else, including application software, data storage, compute resources, and maintenance. This allows customers to focus on using the software without worrying about infrastructure or backend systems."
    },
    {
        "text": "Is this statment correct? Azure Cosmos DB is an example of Software as a Service (SaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "The correct answer is <b>No</b>. Azure Cosmos DB is not an example of Software as a Service (SaaS); it is an example of Platform as a Service (PaaS). As a PaaS offering, Azure Cosmos DB provides a globally distributed, multi-model database solution that is managed by Azure. You, as the user, handle the application and data, while Azure manages the underlying infrastructure and services for scalability, availability, and maintenance."
    },
    {
        "text": "Is this statment correct? Azure SQL database is an example of platform as a Service (PaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "The correct answer is <b>Yes</b>. Azure SQL Database is indeed an example of Platform as a Service (PaaS). In this service model, Azure manages the infrastructure, operating system, and database server for you. This allows you to focus on using the database without worrying about hardware, maintenance, or updates."
    },
    {
        "text": "Is this statment correct? MS SQL 2029 installed on an Azure virtual machine is an example of platform as a Service (PaaS)?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>, that statement is incorrect. Microsoft SQL Server installed on an Azure virtual machine is an example of Infrastructure as a Service (IaaS), not Platform as a Service (PaaS)."
    },
    {
        "text": "Select the answer that correctly completes the sentence. You can assign a [ ... ] to every Azure resource.",
        "options": [
            "blueprint",
            "lock",
            "policy",
            "service endpoint"
        ],
        "correct": 1,
        "explanation": "The correct answer is \"lock\". In Azure, you can assign a lock to every resource to prevent accidental deletion or modification. Locks can be set at different levels, such as resource groups or individual resources, and they enforce either a \"Read-Only\" or \"Delete\" restriction."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company's migration plan. What should you create?",
        "options": [
            "Azure virtual machines, Azure SQL databases, and Azure Storage accounts.",
            "an Azure App Service and Azure virtual machines that have Microsoft SQL Server installed.",
            "an Azure App Service and Azure SQL databases.",
            "Azure storage accounts and web server in Azure virtual machines."
        ],
        "correct": 2,
        "explanation": "The correct answer is <b>an Azure App Service and Azure SQL databases</b>. Here's why:\n\nPlatform as a Service (PaaS) includes services like Azure App Service and Azure SQL Database. These are managed services that handle the underlying infrastructure, allowing you to focus solely on application development and data management.\n\n- The other options, such as using virtual machines (VMs), involve managing infrastructure, which makes them part of Infrastructure as a Service (IaaS) rather than PaaS."
    },
    {
        "text": "To which cloud models can you deploy physical servers?",
        "options": [
            "private cloud and hybrid cloud only",
            "private cloud only",
            "private cloud, hybrid cloud and public cloud",
            "hybrid cloud only"
        ],
        "correct": 0,
        "explanation": "The correct answer is <b>private cloud and hybrid cloud only</b>.\n\nExplanation:\n\n- Private Cloud: Physical servers can be deployed in a private cloud because the infrastructure is dedicated solely to one organization. It allows complete control over hardware, including physical servers.\n\n- Hybrid Cloud: A hybrid cloud integrates private and public cloud models. Physical servers can be part of the private portion of the hybrid cloud, working alongside public cloud resources to handle specific workloads or meet regulatory requirements.\n\n- Public Cloud: Physical servers are managed by the cloud provider in a public cloud, and customers don’t have the option to deploy their own physical servers. Instead, they use shared or dedicated virtualized resources."
    },
    {
        "text": "You plan to provision Infrastructure as a Service (IaaS) resources in Azure. Which resource is an example of IaaS?",
        "options": [
            "an Azure web app",
            "an Azure virtual machine",
            "an Azure logic app",
            "an Azure SQL database"
        ],
        "correct": 1,
        "explanation": "The correct answer is \"an Azure virtual machine\". Infrastructure as a Service (IaaS) provides virtualized computing resources like servers, storage, and networking, enabling users to manage operating systems and applications. Azure Virtual Machines fall under this category because they offer raw computing resources that users can configure and control. - Why others are not IaaS: Azure web app: This is a Platform as a Service (PaaS) solution that abstracts the infrastructure, offering a managed environment for hosting web applications. Azure logic app: This is a PaaS/Serverless solution for automating workflows and integrations without requiring infrastructure management. Azure SQL database: This is also a PaaS solution, as it provides a fully managed relational database service without the need for infrastructure oversight."
    },
    {
        "text": "Your company has an on-premises network that contains multiple servers. The company plans to migrate servers to Azure virtual machines to reduce administrative responsibilities. You need to identify which administrative responsibilities will be eliminated after the planned migration. Which two responsibilities should you identify? Each correct answer presents a complete solution.",
        "options": [
            "Backing up application data, Replacing failed server hardware",
            "Managing physical server security, Replacing failed server hardware",
            "Updating server operating systems, Managing permissions to shared documents",
            "Managing permissions to shared documents, Backing up application data"
        ],
        "correct": 1,
        "explanation": "The two responsibilities that will be eliminated after migrating servers to Azure virtual machines are: 1/ \"Replacing failed server hardware\": Azure, being a cloud platform, handles all hardware-related responsibilities, including maintaining and replacing failed server hardware. This is no longer a concern for the customer. 2/ \"Managing physical server security\": Since Azure provides physical infrastructure and its data centers are secured by Microsoft, managing physical server security will no longer be the company's responsibility."
    },
    {
        "text": "In a public cloud model, only guest users at your company can access the resources in the cloud?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No, that statement is incorrect. In a public cloud model, resources are accessible to authorized users regardless of whether they are internal employees, external partners, or guest users. Access is determined by identity and access management policies rather than user type. Public cloud providers, like Azure, AWS, or Google Cloud, offer tools to manage permissions and roles to ensure only authenticated users can access specific resources."
    },
    {
        "text": "can a company extend the computing resources of its internal network by using an hybrid cloud?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, a company can extend the computing resources of its internal network by using a hybrid cloud. A hybrid cloud integrates an organization's on-premises infrastructure with public cloud services. This setup allows companies to: 1/ Scale computing resources seamlessly by leveraging the public cloud during peak workloads or for specific tasks. 2/ Maintain control over sensitive data and applications by keeping them on-premises while still benefiting from the flexibility and scalability of the public cloud. 3/ Optimize costs by balancing workloads between on-premises infrastructure and the cloud."
    },
    {
        "text": "To implement a hybrid cloud model, a company must have an internal network?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, that's correct. To implement a hybrid cloud model, a company needs to have an internal network, often referred to as on-premises infrastructure. The hybrid cloud model integrates this internal network with a public cloud platform, enabling seamless interaction between the two environments."
    },
    {
        "text": "What feature need a cloud service that can be accessed quickly from the Internet",
        "options": [
            "Disaster recovery",
            "Fault tolerance",
            "Low latency",
            "Dynamic scalability"
        ],
        "correct": 2,
        "explanation": "The correct answer is Low latency. Low latency refers to a cloud service's ability to process and respond to requests quickly, ensuring smooth and fast accessibility from the internet. This is crucial for real-time applications, such as online gaming, video streaming, and e-commerce platforms, where delay can negatively impact user experience."
    },
    {
        "text": "What feature need a cloud service that performs quickly when demand increases",
        "options": [
            "Disaster recovery",
            "Fault tolerance",
            "Low latency",
            "Dynamic scalability"
        ],
        "correct": 3,
        "explanation": "The correct answer is Dynamic scalability. Dynamic scalability refers to a cloud service's ability to automatically and efficiently allocate more resources (such as compute power, storage, or bandwidth) when demand increases. This ensures optimal performance even during high-demand periods, making it a key feature of modern cloud platforms."
    },
    {
        "text": "What feature need a cloud service that can be recovered after a failure occurs",
        "options": [
            "Disaster recovery",
            "Fault tolerance",
            "Low latency",
            "Dynamic scalability"
        ],
        "correct": 0,
        "explanation": "The correct answer is Disaster recovery. Disaster recovery refers to the ability of a cloud service to be restored or recovered after a failure occurs. This typically involves predefined strategies and tools to back up data, systems, and applications, ensuring they can be restored quickly to minimize downtime."
    },
    {
        "text": "What feature need a cloud service that remains available after a failure occurs",
        "options": [
            "Disaster recovery",
            "Fault tolerance",
            "Low latency",
            "Dynamic scalability"
        ],
        "correct": 1,
        "explanation": "The correct answer is Fault tolerance. A fault-tolerant cloud service is designed to continue operating without interruption even if a failure occurs in its components. This ensures high availability and reliability, as the system can detect and manage failures automatically, maintaining service continuity."
    },
    {
        "text": "You have 1,000 virtual machines hosted on the Hyper-V hosts in a data center. You plan to migrate all the virtual machines to an Azure pay-as-you-go subscription. You need to identify which expenditure model to use for the planned Azure solution. Which expenditure model should you identify?",
        "options": [
            "operational",
            "capital",
            "elastic",
            "scalable"
        ],
        "correct": 0,
        "explanation": "The correct answer is \"operational\". When migrating to an Azure pay-as-you-go subscription, the expenditure model shifts from capital expenditure (CapEx), which involves upfront costs for physical infrastructure, to operational expenditure (OpEx). This is because pay-as-you-go services are billed based on consumption, meaning you only pay for the resources you use, turning infrastructure costs into ongoing operating expenses."
    },
    {
        "text": "Select the answer that correctly completes the sentence. [ ... ] is a desktop and application virtualization service that enables the use of a cloud-hosted version of Windows from any location.",
        "options": [
            "An availability set",
            "Azure Spot Virtual Machines",
            "Azure Virtual Desktop",
            "Azure Virtual Machines Scales Sets"
        ],
        "correct": 2,
        "explanation": "The correct answer is Azure Virtual Desktop. Azure Virtual Desktop is a cloud-based desktop and application virtualization service that allows users to access a fully hosted version of Windows from any location. It enables remote work, offering features such as multi-session Windows 10 or 11, seamless Microsoft 365 integration, and robust security."
    },
    {
        "text": "In which type of cloud model are all the hardware resources owned by a third-party and shared between multiple tenants?",
        "options": [
            "private",
            "hybrid",
            "public "
        ],
        "correct": 2,
        "explanation": "In the public cloud model, all hardware resources are owned and maintained by a third-party cloud provider (e.g., Microsoft Azure, AWS, Google Cloud) and are shared among multiple tenants in a multi-tenant environment. This allows for cost efficiency and scalability since users share the infrastructure while maintaining their own separate data and applications through strict access controls."
    },
    {
        "text": "To complete the sentence, select the appropriate option in the answer area. Azure site Recover provides [ ... ] for virtual machines.",
        "options": [
            "fault tolerance",
            "disaster recovery",
            "elasticity",
            "high availability"
        ],
        "correct": 1,
        "explanation": "Azure Site Recovery ensures business continuity by continuously replicating workloads—whether they're on physical or virtual machines—from a primary site to a secondary location. These workloads are not actively running in the secondary location during normal operation but are kept up-to-date through real-time synchronization. Reference: https://learn.microsoft.com/en-us/azure/site-recovery/site-recovery-overview."
    },
    {
        "text": "You plan to migrate several servers from an on-premises network to Azure. What is an advantage of using a public cloud service for the servers over an on-premises network?",
        "options": [
            "The public cloud is owned by the public, NOT a private corporation",
            "The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud",
            "All public cloud resources can be freely accessed by every member of the public",
            "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud"
        ],
        "correct": 3,
        "explanation": "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud. In a public cloud model, resources such as storage, compute power, and networking are shared among multiple organizations (known as a multi-tenant environment). This sharing of resources allows for cost efficiency and scalability, as companies can use only the resources they need without investing in physical infrastructure. The cloud provider manages the underlying hardware and ensures resource availability for all users."
    },
    {
        "text": "When planning to migrate a public website to Azure, you must plan to",
        "options": [
            "deploy a VPN",
            "pay monthly usage costs",
            "pay to transfer all the website data to Azure",
            "reduce the number of connections to the website"
        ],
        "correct": 1,
        "explanation": "The correct answer is \"pay monthly usage costs\". When migrating a public website to Azure, the organization will need to plan for ongoing costs based on Azure's consumption-based pricing model. These costs include charges for compute resources, storage, bandwidth, and other Azure services used by the website."
    },
    {
        "text": "Select appropriate option:  An organization that hosts its infrastructure [ ... ] no longer requires a data center.",
        "options": [
            "in a private cloud",
            "in a hybrid cloud",
            "in the public cloud",
            "on a Hyper-V hosts"
        ],
        "correct": 2,
        "explanation": "The correct answer is \"in the public cloud\". When an organization hosts its infrastructure in the public cloud, it no longer needs a physical data center because the cloud provider manages all the underlying hardware, networking, and maintenance. Public cloud services allow organizations to focus on their applications and data without worrying about owning or maintaining infrastructure."
    },
    {
        "text": "Complete this sentence: When you are implementing a Software as a Service (SaaS) solution, you are responsible for",
        "options": [
            "configuring high-availability",
            "defining scalability rules",
            "installing the SaaS solution",
            "configuring the SaaS solution"
        ],
        "correct": 3,
        "explanation": "The correct answer is configuring the SaaS solution. When implementing a SaaS solution, the provider takes care of the infrastructure, scalability, and high availability, leaving the customer responsible for configuring the solution to meet their specific needs. This typically involves setting up user access, permissions, workflows, and customizations to tailor the software for business processes."
    },
    {
        "text": "Is this statement correct? A platform as a service (PaaS) solution that hosts web apps in Azure provides the ability to scale the platform automatically.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "A PaaS solution that hosts web apps in Azure does provide the ability to scale the platform automatically. This is known as autoscaling. Behind the scenes, the web apps are hosted on virtual machines running IIS. Autoscaling means adding more load balanced virtual machines to host the web apps."
    },
    {
        "text": "Is this statement correct? A platform as a service (PaaS) solution that hosts web apps in Azure provides full control of the operatings systems that hosts applications.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "A PaaS solution does not provide access to the operating system. The Azure Web Apps service provides an environment for you to host your web applications. Behind the scenes, the web apps are hosted on virtual machines running IIS. However, you have no direct access to the virtual machine, the operating system or IIS."
    },
    {
        "text": "Select correct statement. Azure virtual machines is",
        "options": [
            "Infrastructure as a Service (IaaS)",
            "Platform as a Service (PaaS)",
            "Sotfware as a Service (SaaS)"
        ],
        "correct": 0,
        "explanation": "Infrastructure as a Service is the most flexible category of cloud services. It aims to give you complete control over the hardware that runs your application (IT infrastructure servers and virtual machines (VMs), storage, networks, and operating systems). Instead of buying hardware, with IaaS, you rent it."
    },
    {
        "text": "Select correct statement. Azure SQL databases is",
        "options": [
            "Infrastructure as a Service (IaaS)",
            "Platform as a Service (PaaS)",
            "Sotfware as a Service (SaaS)"
        ],
        "correct": 1,
        "explanation": "Azure SQL Database is a fully managed Platform as a Service (PaaS) Database Engine that handles most of the database management functions such as upgrading, patching, backups, and monitoring without user involvement. Azure SQL Database is always running on the latest stable version of SQL Server Database Engine and patched OS with 99.99% availability. PaaS capabilities that are built-in into Azure SQL database enable you to focus on the domain specific database administration and optimization activities that are critical for your business."
    },
    {
        "text": "Is this statment correct? In a public cloud model, only guest users at your company can access the resources in the cloud.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. This statement is not correct. In a public cloud model, resources are made accessible over the internet to authorized users. These users could include employees, contractors, or even third-party collaborators, depending on the company's access policies. It's not restricted to \"guest users\" specifically."
    },
    {
        "text": "Is this statment correct? A company can extend the capacity of its internal network by using public cloud?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. This statement is correct! A company can indeed extend the capacity of its internal network by utilizing public cloud resources. This approach is known as \"cloud bursting,\" where businesses leverage the public cloud to handle temporary spikes in workload or add extra capacity as needed."
    },
    {
        "text": "Is this statment correct? To achieve a hybrid cloud model a company must always migrate from a private cloud.",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. The statement is not entirely correct. A hybrid cloud model combines elements of both private and public clouds, allowing data and applications to be shared between them. However, achieving a hybrid cloud setup does not always require migrating from an existing private cloud."
    },
    {
        "text": "You have an on-premises network that contains 100 servers. You need to recommend a solution that provides additional resources to your users. The solution must minimize capital and operational expenditure costs. What should you include in the recommendation?",
        "options": [
            "a complete migration to the public cloud",
            "an additional data center",
            "a private cloud",
            "a hybrid cloud"
        ],
        "correct": 3,
        "explanation": "By adopting a hybrid cloud model, you can leverage your existing on-premises infrastructure (already spent CAPEX) while integrating with the cloud to minimize future CAPEX and OPEX."
    },
    {
        "text": "You plan to migrate a web application to Azure. The web application is accessed by external users. You need to recommend a cloud deployment solution to minimize the amount of administrative effort used to manage the web application. What should you include in the recommendation?",
        "options": [
            "Software as a Service (SaaS)",
            "Platform as a Service (PaaS)",
            "Infrastructure as a Service (IaaS)",
            "Database as a Service (DaaS)"
        ],
        "correct": 1,
        "explanation": "Platform as a Service (PaaS). A PaaS solution, such as Azure App Service, is designed to reduce administrative effort by managing the underlying infrastructure, operating system updates, scaling, and other platform-related tasks. This allows you to focus on developing and maintaining your web application without worrying about server management."
    },
    {
        "text": "Your company hosts an accounting application named App1 that is used by all the customers of the company. App1 has low usage during the first three weeks of each month and very high usage during the last week of each month. Which benefit of Azure Cloud Services supports cost management for this type of usage pattern?",
        "options": [
            "high availability",
            "high latency",
            "elasticity ",
            "load balancing"
        ],
        "correct": 2,
        "explanation": "Elasticity refers to the ability of cloud resources to automatically scale up or down based on demand."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure Storage accounts. Does this meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Azure Storage is generally categorized as an Infrastructure as a Service (IaaS) offering rather than a Platform as a Service (PaaS).However, it is often integrated with PaaS services (e.g., Azure App Service or Azure Functions) as part of a larger solution, and it abstracts some infrastructure management tasks, making it feel \"PaaS-like\" in its simplicity and scalability. But strictly speaking, it is considered more IaaS than PaaS. On top of this, as we don't have an inventory of all PaaS to be migrated we cannot guarantee all PaaS solution can be migrated."
    },
    {
        "text": "Your company plans to migrate all its data and resources to Azure. The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure SQL databases. Does this meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b> as we don't have an inventory of all PaaS to be migrated. If your company migration plan only involves hosting web applications and databases, then creating Azure App Service and Azure SQL Database as Platform as a Service (PaaS) solutions does meet the goal. However, if your migration includes other workloads (e.g., workflow automation, event-driven computing, or IoT solutions), additional PaaS services like Azure Functions, Azure Logic Apps, or Azure IoT Hub might be required to fully align with the company's stated plan to only use PaaS solutions."
    },
    {
        "text": "What are two characteristics of the public cloud? Each correct answer presents a complete solution.",
        "options": [
            "dedicated hardware,limited storage",
            "unsecured connections, metered pricing",
            "dedicated hardware, self-service management",
            "metered pricing, self-service management"
        ],
        "correct": 3,
        "explanation": "Hardware is shared, connections are secured and robust, storage is scalable, price is metered and it is self-service management."
    },
    {
        "text": "You have an on-premises network that contains several servers. You plan to migrate all the servers to Azure. You need to recommend a solution to ensure that some of the servers are available if a single Azure data center goes offline for an extended period. What should you include in the recommendation?",
        "options": [
            "fault tolerance",
            "elasticity",
            "scalability",
            "low latency"
        ],
        "correct": 0,
        "explanation": "\"fault tolerance\". To ensure server availability in case a single Azure data center goes offline, you should include Azure Availability Zones in your recommendation as it provides \"fault tolerance\"."
    },
    {
        "text": "If you create two Azure virtual machines that use B2S size, each virtual machine will always generate the same monthly costs, correct ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. While two Azure virtual machines (VMs) with the same B2S size may have identical base pricing for their compute resources, their monthly costs may still vary depending on additional factors such as: - Running Hours: If one VM runs continuously while the other is stopped for some time, their costs will differ. - Storage: The costs of storage, like managed disks or additional data disks attached to each VM, may vary. - Networking: Outbound data transfer charges and network traffic can differ for each VM. - Resource Location: If the VMs are deployed in different regions, pricing differences might apply. So, while the base cost for compute might be the same, additional charges can cause the total monthly costs to vary. Let me know if you'd like to dive deeper into cost calculations or optimization strategies!"
    },
    {
        "text": "Azure provides flexibility between capital expenditure (CAPEX) and operational expenditure (OPEX), correct ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, that's correct! Azure offers flexibility by allowing businesses to shift their spending from capital expenditures (CAPEX) to operational expenditures (OPEX). Here's how: - CAPEX: Traditionally, organizations would need to invest heavily upfront in hardware, servers, and data centers, which are considered capital expenses. - OPEX: With Azure, businesses can adopt a pay-as-you-go model, where they only pay for the resources they use, such as virtual machines, storage, or bandwidth. This is classified as operational expenditure. By moving to Azure, companies can avoid large upfront costs and instead manage their IT budgets with predictable, ongoing operational expenses, which adds financial flexibility."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides professional development services to continuously add features to custom applications, correct ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>, that's not accurate. A Platform as a Service (PaaS) solution in Azure, like Azure App Service, provides a platform for developers to build, deploy, and manage web apps without worrying about the underlying infrastructure. However, it does not include professional development services for continuously adding features to custom applications. PaaS simplifies the development process by providing tools and resources, such as frameworks, APIs, and scaling capabilities, but the development of features and enhancements to the application itself remains the responsibility of the application developers or the organization using the service."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides the ability to scale the platform automatically, correct ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, that's correct! A Platform as a Service (PaaS) solution like Azure App Service includes built-in features for automatic scaling. You can configure it to scale out (adding more instances) or scale up (increasing the resources of the existing instance) based on factors such as traffic, CPU usage, memory usage, or a specific schedule. This flexibility is one of the key benefits of PaaS, as it allows applications to handle varying workloads efficiently without requiring manual intervention."
    },
    {
        "text": "A platform as a service (PaaS) solution thats hosts web apps in Azure provides full control of the operating systems that host application, correct ?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. A Platform as a Service (PaaS) solution in Azure, such as Azure App Service, does not provide full control of the operating systems hosting the application. PaaS is designed to abstract infrastructure management, allowing developers to focus on building and deploying applications without worrying about the underlying hardware or operating systems. With PaaS, you can control and configure application settings, scaling, and deployment, but the underlying operating system is managed by Azure. This means you cannot directly modify or access the operating system or its settings, which is one of the defining characteristics of PaaS. If full control over the operating system is needed, you might want to explore Infrastructure as a Service (IaaS) solutions like Azure Virtual Machines."
    },
    {
        "text": "Your company's Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to require Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. This solution does not meet the goal. While Azure Multi-Factor Authentication (MFA) enhances security by adding an additional verification step for users, it does not directly address the goal of reducing the effect on users after the migration of network resources to Azure. To minimize the impact on users during such a migration, a strategy like implementing Azure AD Connect with hybrid identity would be more suitable. This ensures a smooth transition by allowing users to maintain their existing credentials and continue accessing resources seamlessly"
    },
    {
        "text": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include a local network gateway in your strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. The local network gateway is a specific object that represents your on-premises location (the site) for routing purposes."
    },
    {
        "text": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include network security groups (NSGs) in your strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>. You can use an Azure network security group to filter network traffic to and from Azure resources in an Azure virtual network. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. For each rule, you can specify source and destination, port, and protocol."
    },
    {
        "text": "Your company has an Azure Active Directory (Azure AD) environment. Users occasionally connect to Azure AD via the Internet. You have been tasked with making sure that users who connect to Azure AD via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Azure AD Privileged Identity Management. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "<b>No</b>. Correct service would be Azure AD Identity Protection. Azure AD Privileged Identity Management provides time-based and approval-based role activation to mitigate the risks of excessive, unnecessary, or misused access permissions on resources that you care about."
    },
    {
        "text": "Your company has an Azure Active Directory (Azure AD) environment. Users occasionally connect to Azure AD via the Internet. You have been tasked with making sure that users who connect to Azure AD via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Azure AD Identity Protection. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, this solution meets the goal. Azure AD Identity Protection allows you to configure risk-based policies to detect and respond to suspicious activities, such as sign-ins from unidentified IP addresses. By using this feature, you can create policies that automatically require users to change their passwords when such risky sign-in activities are detected. This aligns with the requirement to encourage users to change passwords in these specific scenarios. Do not confuse with Azure Information Protection."
    },
    {
        "text": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Machine Learning Studio. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Azure Machine Learning Studio is the correct tool for predictive analytics in AI solutions, the solution meets the goal."
    },
    {
        "text": "Your company's infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure API Management service be included in the strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "No. ARM (Azure Resource Manager) is a tool that automates the deployments on the AZ cloud. Azure API Management Service ( APIM ) is a way to create and manage customer APIs for existing backend services. "
    },
    {
        "text": "Your company's infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure Resource Manager templates be included in the strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Yes, ARM templates allows deployment of many identical instances."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and one availability zone in your strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include one virtual machine and two availability zones in your strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and two availability zones in your strategy. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Correct, answer is <b>Yes</b>. To ensure 99.99 SLA you need 2 VMs in 2 availability zones."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Microsoft Managed Desktop. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. 1st, Ubuntu is Not supported by Microsoft Managed Desktop; 2nd ,key here is \"developers\", as we commission and decomission quite often it sounds we use a Dev lab and for Dev labs we use Azure DevTest Labs. Reference : https://azure.microsoft.com/en-us/products/devtest-lab/ & https://azure.microsoft.com/en-us/pricing/details/devtest-lab/."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Azure Reserved Virtual Machines (VM) Instances. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Answer is <b>No</b>. While Azure Reserved Virtual Machines (VM) Instances (reserved for 1 or 3 years, so long-term) can do the trick, the most efficient, from costs perspective is to use Azure DevTest Labs that is specifically designed for short-term service.  Reference : https://azure.microsoft.com/en-us/products/devtest-lab/  & https://azure.microsoft.com/en-us/pricing/details/devtest-lab/."
    },
    {
        "text": "Your company's developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: You recommend the use of Azure DevTest Labs. Does the solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "<b>Yes</b>, Azure DevTest Labs is the best answer. This service is designed for developers to deploy for testing purpose, this is for short-term provisioning and the most cost efficient solution."
    },
    {
        "text": "Your company intends to subscribe to an Azure support plan. The support plan must allow for new support requests to be opened. Which of the following are support plans that will allow this?",
        "options": [
            "Basic, Developer, Standard, Professional Direct",
            "Developer, Standard, Professional Direct",
            "Basic, Developer, Standard"
        ],
        "correct": 1,
        "explanation": "References: https://azure.microsoft.com/en-us/support/plans/"
    },
    {
        "text": "Your company has datacenters in Los Angeles and New York, a Microsoft Azure subscription, and wants to configure the datacenters as geo-clustered sites for site resiliency with data stored on multiple Nodes in separate geographic locations and readable from both primary and secondary locations—what Azure storage redundancy option should you recommend?",
        "options": [
            "Geo-redundant storage",
            "Read-only geo-redundant storage",
            "Zone-redundant storage",
            "Locally redundant storage"
        ],
        "correct": 1,
        "explanation": "Geo-redundant because of LA and NY and read-only because we mentioned 'readable', Not writable!"
    },
    {
        "text": "Your company's Azure subscription includes a Basic support plan, and they want an assessment of an Azure environment's design from Microsoft, which isn't supported by the existing plan—you recommend subscribing to the Professional Direct support plan to enable this functionality while minimizing expenses; does this solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 0,
        "explanation": "Assessment of an Azure environment's design is only provided with the Professional Direct subscription plan. References: https://azure.microsoft.com/en-us/support/plans/"
    },
    {
        "text": "You are tasked with deploying Azure virtual machines for your company and need the appropriate cloud deployment solution—you recommend using Platform as a Service (PaaS); does this solution meet the goal?",
        "options": [
            "Yes",
            "No"
        ],
        "correct": 1,
        "explanation": "Azure's primary service for Infrastructure as a Service (IaaS) is Azure Virtual Machines (VMs). References: https://learn.microsoft.com/en-us/azure/virtual-machines/overview."
    },
    {
        "text": "Who can use Azure Government services?",
        "options": [
            "A governement contractor from any country, A governement entity from any country",
            "A governement entity from any country, A European governement entity, A United State governement entity",
            "A United State governement entity, A United State governement contractor",
            "A governement contractor from any country, A European governement contractor, A United State governement contractor"
        ],
        "correct": 2,
        "explanation": "Azure Government is ONLY for <b>United State governement and its contractors</b>."
    }
]